#### MaxRange Property

---

|  |
| --- |
| ElectricalDemandFactorValue Class   See Also |

The maximum range for this demand factor value. For example, objects 1 to 3 can have 100% demand factor. In the example above, the maximum range will be 3.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public double MaxRange { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MaxRange As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double MaxRange { 	double get (); 	void set (double value); } ``` |

# See Also

ElectricalDemandFactorValue Class

Autodesk.Revit.DB.Electrical Namespace

#### SetGlobal3DDirectionHandles Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

Sets the handles representing the cardinal directions in 3D.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static void SetGlobal3DDirectionHandles( 	bool positive, 	IFCAnyHandle xDir, 	IFCAnyHandle yDir, 	IFCAnyHandle zDir ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub SetGlobal3DDirectionHandles ( _ 	positive As Boolean, _ 	xDir As IFCAnyHandle, _ 	yDir As IFCAnyHandle, _ 	zDir As IFCAnyHandle _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void SetGlobal3DDirectionHandles( 	bool positive,  	IFCAnyHandle^ xDir,  	IFCAnyHandle^ yDir,  	IFCAnyHandle^ zDir ) ``` |

#### Parameters

positive
:   Type:  System Boolean
     True if the handles returned should be in the positive direction, false if the handles should be in the negative direction.

xDir
:   Type:  Autodesk.Revit.DB.IFC IFCAnyHandle
     The X direction handle.

yDir
:   Type:  Autodesk.Revit.DB.IFC IFCAnyHandle
     The Y direction handle.

zDir
:   Type:  Autodesk.Revit.DB.IFC IFCAnyHandle
     The Z direction handle.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace

#### Dispose Method

---

|  |
| --- |
| LightFamily Class   See Also |

Releases all resources used by the  LightFamily

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

LightFamily Class

Autodesk.Revit.DB.Lighting Namespace

#### Rotation Property

---

|  |
| --- |
| TextNoteOptions Class   See Also |

Base line angle of a text note, in radians.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public double Rotation { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Rotation As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Rotation { 	double get (); 	void set (double value); } ``` |

# Remarks

Default value is 0.0.

# See Also

TextNoteOptions Class

Autodesk.Revit.DB Namespace

#### CannotCreateGroup Property

---

|  |
| --- |
| BuiltInFailures GroupFailures Class   See Also |

Cannot create group of these elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCreateGroup { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCreateGroup As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCreateGroup { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GroupFailures Class

Autodesk.Revit.DB Namespace

#### ListNames Method

---

|  |
| --- |
| ExportDWGSettings Class   See Also |

Returns a list of names of dwg/dxf export settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static IList<string> ListNames( 	Document aDoc ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ListNames ( _ 	aDoc As Document _ ) As IList(Of String) ``` |

| Visual C++ |
| --- |
| ``` public: static IList<String^>^ ListNames( 	Document^ aDoc ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     A Revit document to retrieve names from.

#### Return Value

An array of strings representing names of predefined setups.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportDWGSettings Class

Autodesk.Revit.DB Namespace

#### SetAllCapsStatus Method (TextRange, Boolean)

---

|  |
| --- |
| FormattedText Class   See Also |

Sets the characters in a given text range to be in all caps or not.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void SetAllCapsStatus( 	TextRange textRange, 	bool isAllCaps ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetAllCapsStatus ( _ 	textRange As TextRange, _ 	isAllCaps As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetAllCapsStatus( 	TextRange^ textRange,  	bool isAllCaps ) ``` |

#### Parameters

textRange
:   Type:  Autodesk.Revit.DB TextRange
     The given text range.

isAllCaps
:   Type:  System Boolean
     The desired all caps status of characters in the given text range. True will render all characters in all caps. False will revert the characters back to their original mixed case.

# Remarks

Removing the all caps status will revert the characters back to their original case. It will not make them lower case.

The given text range should not be empty.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This text range is empty. -or- This start index of this text range is not within the text range identifying the entire text. -or- The end of this text range is not within the text range identifying the entire text. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FormattedText Class

SetAllCapsStatus Overload

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ValueParsingOptions Class   See Also |

Releases all resources used by the  ValueParsingOptions

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ValueParsingOptions Class

Autodesk.Revit.DB Namespace

#### GetObjectData Method

---

|  |
| --- |
| DisabledDisciplineException Class   See Also |

Retrieves data needed to serialize the target object.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override void GetObjectData( 	SerializationInfo info, 	StreamingContext context ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub GetObjectData ( _ 	info As SerializationInfo, _ 	context As StreamingContext _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void GetObjectData( 	SerializationInfo^ info,  	StreamingContext context ) override ``` |

#### Parameters

info
:   Type:  System.Runtime.Serialization SerializationInfo
     Data needed to serialize or deserialize the object.

context
:   Type:  System.Runtime.Serialization StreamingContext
     The destination of the serialized stream.

#### Implements

 ISerializable GetObjectData(SerializationInfo, StreamingContext)
  \_Exception GetObjectData(SerializationInfo, StreamingContext)

# See Also

DisabledDisciplineException Class

Autodesk.Revit.Exceptions Namespace

#### GetExportLineweightInfo Method

---

|  |
| --- |
| ExportLineweightTable Class   See Also |

Gets a copy of the ExportLineweightInfo corresponding to the given ExportLineweightKey.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public ExportLineweightInfo GetExportLineweightInfo( 	ExportLineweightKey exportLineweightKey ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetExportLineweightInfo ( _ 	exportLineweightKey As ExportLineweightKey _ ) As ExportLineweightInfo ``` |

| Visual C++ |
| --- |
| ``` public: ExportLineweightInfo^ GetExportLineweightInfo( 	ExportLineweightKey^ exportLineweightKey ) ``` |

#### Parameters

exportLineweightKey
:   Type:  Autodesk.Revit.DB ExportLineweightKey
     The export line weight Key.

#### Return Value

Returns the line weight info for this key.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | An entry with the given key is not present in the table. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportLineweightTable Class

Autodesk.Revit.DB Namespace

#### DockablePanes.BuiltInDockablePanes Class

---

|  |
| --- |
| DockablePanes Class   Members   See Also |

A collection of ids of the dockable panes provided by Revit.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static class BuiltInDockablePanes ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class BuiltInDockablePanes ``` |

| Visual C++ |
| --- |
| ``` public ref class BuiltInDockablePanes abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.UI DockablePanes BuiltInDockablePanes

# See Also

DockablePanes BuiltInDockablePanes Members

Autodesk.Revit.UI Namespace

#### BasepointElevationParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Elev"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BasepointElevationParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BasepointElevationParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BasepointElevationParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### NewFamilyInstanceCreationData Method (FamilySymbol, IList(XYZ))

---

|  |
| --- |
| Application Class   See Also |

Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FamilyInstanceCreationData NewFamilyInstanceCreationData( 	FamilySymbol symbol, 	IList<XYZ> adaptivePoints ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewFamilyInstanceCreationData ( _ 	symbol As FamilySymbol, _ 	adaptivePoints As IList(Of XYZ) _ ) As FamilyInstanceCreationData ``` |

| Visual C++ |
| --- |
| ``` public: FamilyInstanceCreationData^ NewFamilyInstanceCreationData( 	FamilySymbol^ symbol,  	IList<XYZ^>^ adaptivePoints ) ``` |

#### Parameters

symbol
:   Type:  Autodesk.Revit.DB FamilySymbol
     A FamilySymbol object that represents the type of the instance that is to be inserted.

adaptivePoints
:   Type:  System.Collections.Generic IList   XYZ
     The adaptive point location where the adaptive instance is to be placed.

# See Also

Application Class

NewFamilyInstanceCreationData Overload

Autodesk.Revit.Creation Namespace

#### StructuralSectionZprofileBottomFlangeLength Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bottom Flange Length"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionZprofileBottomFlangeLength { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionZprofileBottomFlangeLength As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionZprofileBottomFlangeLength { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Flipped Property

---

|  |
| --- |
| DividedPath Class   See Also |

If the divided path is flipped the nodes are numbered in the reverse order. It also switches the ends from which beginningIndent and endIndent are measured from.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool Flipped { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Flipped As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool Flipped { 	bool get (); } ``` |

# See Also

DividedPath Class

Autodesk.Revit.DB Namespace

#### Erase Method

---

|  |
| --- |
| ConnectorSet Class   See Also |

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Erase( 	Connector item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Erase ( _ 	item As Connector _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: virtual int Erase( 	Connector^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB Connector

# See Also

ConnectorSet Class

Autodesk.Revit.DB Namespace

#### Visible Property

---

|  |
| --- |
| RibbonItem Class   See Also |

Gets or sets a value indicating whether the item is visible.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool Visible { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Visible As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool Visible { 	bool get (); 	void set (bool value); } ``` |

# Remarks

When the Visible property is set to false, the item won't be displayed on Ribbon.

# See Also

RibbonItem Class

Autodesk.Revit.UI Namespace

#### GetColorOptions Method

---

|  |
| --- |
| ColorOptions Class   See Also |

Returns the current Revit instance's ColorOptions.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public static ColorOptions GetColorOptions() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetColorOptions As ColorOptions ``` |

| Visual C++ |
| --- |
| ``` public: static ColorOptions^ GetColorOptions() ``` |

#### Return Value

The ColorOptions for the current Revit instance.

# See Also

ColorOptions Class

Autodesk.Revit.DB Namespace

#### ShowDownText Property

---

|  |
| --- |
| StairsPath Class   See Also |

Represents whether show stairs down text or not.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool ShowDownText { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ShowDownText As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ShowDownText { 	bool get (); 	void set (bool value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The type of this stairs path is not automatic up/down direction. |

# See Also

StairsPath Class

Autodesk.Revit.DB.Architecture Namespace

#### CannotComputeRailElevation Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Can't compute elevation profile for one or more Rails

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotComputeRailElevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotComputeRailElevation As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotComputeRailElevation { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### DigitGroupingAmount Property

---

|  |
| --- |
| Units Class   See Also |

The number of digits in each group when numbers are formatted with digit grouping.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public DigitGroupingAmount DigitGroupingAmount { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DigitGroupingAmount As DigitGroupingAmount 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property DigitGroupingAmount DigitGroupingAmount { 	DigitGroupingAmount get (); 	void set (DigitGroupingAmount value); } ``` |

#### Field Value

The number of digits in each group. The default is Three.

# Remarks

This setting only has an effect when the UseDigitGrouping property is set to true in the FormatOptions object for the unit type being formatted.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

Units Class

Autodesk.Revit.DB Namespace

#### CreateGreaterRule Method (ElementId, Double, Double)

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

Creates a filter rule that determines whether double-precision values from the document are greater than a certain value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static FilterRule CreateGreaterRule( 	ElementId parameter, 	double value, 	double epsilon ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateGreaterRule ( _ 	parameter As ElementId, _ 	value As Double, _ 	epsilon As Double _ ) As FilterRule ``` |

| Visual C++ |
| --- |
| ``` public: static FilterRule^ CreateGreaterRule( 	ElementId^ parameter,  	double value,  	double epsilon ) ``` |

#### Parameters

parameter
:   Type:  Autodesk.Revit.DB ElementId
     A double-typed parameter used to get values from the document for a given element.

value
:   Type:  System Double
     The user-supplied value against which values from the document will be compared.

epsilon
:   Type:  System Double
     Defines the tolerance within which two values may be considered equal.

# Remarks

Values greater than  *value*  but within  *epsilon*  are considered equal, not greater.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given value for value is not finite -or- The given value for value is not a number -or- The given value for epsilon is not finite -or- The given value for epsilon is not a number |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterFilterRuleFactory Class

CreateGreaterRule Overload

Autodesk.Revit.DB Namespace

#### HasSameType Method

---

|  |
| --- |
| PanelScheduleTemplate Class   See Also |

Checks if given template has the same panel schedule type with this template.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool HasSameType( 	PanelScheduleTemplate otherTemplate ) ``` |

| Visual Basic |
| --- |
| ``` Public Function HasSameType ( _ 	otherTemplate As PanelScheduleTemplate _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool HasSameType( 	PanelScheduleTemplate^ otherTemplate ) ``` |

#### Parameters

otherTemplate
:   Type:  Autodesk.Revit.DB.Electrical PanelScheduleTemplate
     The given template to check.

#### Return Value

True if the given template has the same panel schedule type with this template, false otherwise.

# Remarks

The panel schedule type is the enum type of PanelScheduleType class (Branch, switchboard, data etc.)

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PanelScheduleTemplate Class

Autodesk.Revit.DB.Electrical Namespace

#### AreSolidsEqual Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

Determines whether two solids are identical, potentially offset from each other.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static bool AreSolidsEqual( 	Solid first, 	Solid second, 	out Transform trf ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function AreSolidsEqual ( _ 	first As Solid, _ 	second As Solid, _ 	<OutAttribute> ByRef trf As Transform _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool AreSolidsEqual( 	Solid^ first,  	Solid^ second,  	[OutAttribute] Transform^% trf ) ``` |

#### Parameters

first
:   Type:  Autodesk.Revit.DB Solid
     The first solid.

second
:   Type:  Autodesk.Revit.DB Solid
     The second solid

trf
:   Type:  Autodesk.Revit.DB Transform   %
     The offset transform

#### Return Value

True if they are identical, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace

#### IsValidObject Property

---

|  |
| --- |
| SynchronizeWithCentralOptions Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

SynchronizeWithCentralOptions Class

Autodesk.Revit.DB Namespace

#### PostWarning Method

---

|  |
| --- |
| PerformanceAdviser Class   See Also |

Reports a problem detected during execution of a rule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void PostWarning( 	FailureMessage message ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub PostWarning ( _ 	message As FailureMessage _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void PostWarning( 	FailureMessage^ message ) ``` |

#### Parameters

message
:   Type:  Autodesk.Revit.DB FailureMessage
     Warning describing the problem detected by a rule.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The message must have severity "warning". |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Performance advisor is not executing rules. |

# See Also

PerformanceAdviser Class

Autodesk.Revit.DB Namespace

#### CannotDrawSingularSlantedWallError Property

---

|  |
| --- |
| BuiltInFailures CreationFailures Class   See Also |

Cannot create wall - it would intersect itself. Reduce the wall's height or slant.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotDrawSingularSlantedWallError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotDrawSingularSlantedWallError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotDrawSingularSlantedWallError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CreationFailures Class

Autodesk.Revit.DB Namespace

#### Append Method

---

|  |
| --- |
| PhaseArray Class   See Also |

Add the phase to the end of the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Append( 	Phase item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Append ( _ 	item As Phase _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Append( 	Phase^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB Phase
     The phase to be added.

# See Also

PhaseArray Class

Autodesk.Revit.DB Namespace

#### PanelMismatchDistSysWhenCircuitAssigned Property

---

|  |
| --- |
| BuiltInFailures ElectricalFailures Class   See Also |

The selected circuit was added to panel [Element], but the distribution system for the panel does not match the power connector definition on the panel.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId PanelMismatchDistSysWhenCircuitAssigned { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PanelMismatchDistSysWhenCircuitAssigned As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ PanelMismatchDistSysWhenCircuitAssigned { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElectricalFailures Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| AnalyticalModelSelector Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

AnalyticalModelSelector Class

Autodesk.Revit.DB.Structure Namespace

#### WeatherStationName Property

---

|  |
| --- |
| SiteLocation Class   See Also |

The name of the weather station at the site location.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014 UR2

# Syntax

| C# |
| --- |
| ``` public string WeatherStationName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property WeatherStationName As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ WeatherStationName { 	String^ get (); } ``` |

# See Also

SiteLocation Class

Autodesk.Revit.DB Namespace

#### PointAdaptiveOrientationType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Orients to"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PointAdaptiveOrientationType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PointAdaptiveOrientationType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PointAdaptiveOrientationType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, IList(Curve), Level, XYZ, Boolean)

---

|  |
| --- |
| BeamSystem Class   See Also |

Creates a new BeamSystem with specified profile curves.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static BeamSystem Create( 	Document document, 	IList<Curve> profile, 	Level level, 	XYZ direction, 	bool is3d ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	profile As IList(Of Curve), _ 	level As Level, _ 	direction As XYZ, _ 	is3d As Boolean _ ) As BeamSystem ``` |

| Visual C++ |
| --- |
| ``` public: static BeamSystem^ Create( 	Document^ document,  	IList<Curve^>^ profile,  	Level^ level,  	XYZ^ direction,  	bool is3d ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document in which the new BeamSystem is created.

profile
:   Type:  System.Collections.Generic IList   Curve
     The profile of the BeamSystem.

level
:   Type:  Autodesk.Revit.DB Level
     The level on which the BeamSystem is to be created. The work-plane of the BeamSystem will be the sketch plane associated with the Level. If there is no current sketch plane associated with the level yet, we will create a default one.

direction
:   Type:  Autodesk.Revit.DB XYZ
     The direction is the direction of the BeamSystem.

is3d
:   Type:  System Boolean
     Whether the BeamSystem is 3D. If the BeamSystem is 3D, the sketchPlane must be a level, otherwise an exception will be thrown.

#### Return Value

If successful, a new BeamSystem object will be returned.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input profile contains at least one helical curve and is not supported for this operation. -or- The input level does not have associated plan view. -or- The plan view associated with the input level is not valid. -or- Can not get valid sketch plane from the input level. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

BeamSystem Class

Create Overload

Autodesk.Revit.DB Namespace

#### RebarSystemAddlBottomOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Additional Bottom Cover Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemAddlBottomOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemAddlBottomOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemAddlBottomOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsDefault Property

---

|  |
| --- |
| Railing Class   See Also |

Indicates if the railing is the default one that system generates.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool IsDefault { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsDefault As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsDefault { 	bool get (); } ``` |

# See Also

Railing Class

Autodesk.Revit.DB.Architecture Namespace

#### SurfaceArea Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Surface Area"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SurfaceArea { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SurfaceArea As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SurfaceArea { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IFCVersion Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing available IFC file versions into which a file may be exported.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public enum IFCVersion ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration IFCVersion ``` |

| Visual C++ |
| --- |
| ``` public enum class IFCVersion ``` |

# Members

| Member name | Description |
| --- | --- |
| Default | The Autodesk Revit application's default export format. Note that this may change as the defaults change in the Revit user interface. |
| IFCBCA | IFC BCA file format. This is a certified variant of IFC 2x2 used for submitting files to the Singapore BCA ePlan Check Server. |
| IFC2x2 | IFC 2x2 file format. |
| IFC2x3 | IFC 2x3 file format. |
| IFCCOBIE | IFC GSA COBIE 2010 file format. This is a variant of IFC 2x3 used for submitting files that are COBIE 2010-complaint. |
| IFC2x3CV2 | IFC 2x3 Coordination View 2.0 file format. This is a variant of IFC 2x3 used for exporting files using the Coordination View 2.0 model view. |
| IFC4 | IFC 4 file format. |
| IFC2x3FM | IFC2x3 Extended FM Handover View |
| IFC4RV | IFC4 Reference View |
| IFC4DTV | IFC4 Design Transfer View |
| IFC2x3BFM | IFC2x3 Basic FM Handover View |

# See Also

Autodesk.Revit.DB Namespace

#### SillHeight Property

---

|  |
| --- |
| MassSurfaceData Class   See Also |

The height above the level where the bottoms of auto-generated windows will be located.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double SillHeight { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SillHeight As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double SillHeight { 	double get (); 	void set (double value); } ``` |

# Remarks

Will be accurate unless the target glazing percentage cannot be achieved using this height. In that case, the sillHeight will be ignored and windows will be created below this height.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The sill height is less than zero. |

# See Also

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace

#### IsDataPanelSchedule Property

---

|  |
| --- |
| PanelScheduleTemplate Class   See Also |

Checks to see if this object is data panel schedule template element.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsDataPanelSchedule { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsDataPanelSchedule As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsDataPanelSchedule { 	bool get (); } ``` |

# See Also

PanelScheduleTemplate Class

Autodesk.Revit.DB.Electrical Namespace

#### SurfaceName Property

---

|  |
| --- |
| EnergyAnalysisSurface Class   See Also |

The unique name identifier for this surface.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public string SurfaceName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property SurfaceName As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ SurfaceName { 	String^ get (); } ``` |

# Remarks

Surface and Opening elements get an Name element assigned according to the below described schema:

(Orientation)(Space#)(Other space#)(Type)-(sequence number)[Opening Type+#]

Sample: N-101-102-E-W-O-77

* N = Orientation [N/NE/E/SE/S/SW/W/NW/N/T/B/X] (every surface within the sector of 22.5 degrees from the north vector gets the letter N etc) (horizontal surfaces facing upwards get the letter T for top, downwards B for bottom) (shading surfaces get the letter X for differentiation).
* 101 = Space number.
* 102 = Other space number.
* E = Exposure - exterior/interior/underground [E/I/U].
* W = Type [W/C/R/F] (Wall, Roof, Ceiling, Floor, Shade) (every surface type has it's letter W-Wall R-Roof C-Ceiling F-Floor S-Shade).
* O = Opening Type [W/D/O] (Window, Door, Opening) (every opening type has it's letter W-Window D-Door O-Opening).
* 77 = sequence number.

Sample surface names:

* N-101-E-W-84 North facing Exterior Wall #84 in space 101.
* N-101-E-W-84-D-1 Door #1 in North facing Exterior Wall #84 in space 101.
* E-101-102-I-W-92 Vertical Interior Wall #92 between space 101 and 102.
* T-101-E-R-141 Top facing Exterior Roof #141 in space 101.
* B-101-201-I-F-88 Bottom facing Interior Floor #88 between space 101 and 201.
* X-73 Shade #73.

# See Also

EnergyAnalysisSurface Class

Autodesk.Revit.DB.Analysis Namespace

#### InchesPerSecondSquared Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Inches per second squared.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId InchesPerSecondSquared { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InchesPerSecondSquared As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ InchesPerSecondSquared { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### Index Property

---

|  |
| --- |
| DuctFittingAndAccessoryConnectorData Class   See Also |

return the index of this connector

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public int Index { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Index As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int Index { 	int get (); } ``` |

# See Also

DuctFittingAndAccessoryConnectorData Class

Autodesk.Revit.DB.Mechanical Namespace

#### MassSubCategoryId Property

---

|  |
| --- |
| ConceptualSurfaceType Class   See Also |

The mass subcategory id of the ConceptualSurfaceType.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ElementId MassSubCategoryId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property MassSubCategoryId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ MassSubCategoryId { 	ElementId^ get (); } ``` |

# See Also

ConceptualSurfaceType Class

Autodesk.Revit.DB.Analysis Namespace

#### ExtensibleStorageFilter Constructor

---

|  |
| --- |
| ExtensibleStorageFilter Class   See Also |

Constructs a new instance of a filter to match elements with extensible storage data based on specific Schema id.

**Namespace:**   Autodesk.Revit.DB.ExtensibleStorage
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ExtensibleStorageFilter( 	Guid schemaGuid ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	schemaGuid As Guid _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ExtensibleStorageFilter( 	Guid schemaGuid ) ``` |

#### Parameters

schemaGuid
:   Type:  System Guid
     Schema id used to filter elements with extensible storage data

# See Also

ExtensibleStorageFilter Class

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### RbsElecLoadsummaryLoadclassificationParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Load Classification"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecLoadsummaryLoadclassificationParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecLoadsummaryLoadclassificationParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecLoadsummaryLoadclassificationParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RailingCurvesNotSplitRamp Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

The slope of this railing will not parallel the ramp at landings. To get a parallel railing, split the railing sketch at the ends of landings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RailingCurvesNotSplitRamp { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RailingCurvesNotSplitRamp As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RailingCurvesNotSplitRamp { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### GetScans Method

---

|  |
| --- |
| PointCloudInstance Class   See Also |

Returns array of scan names.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public IList<string> GetScans() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetScans As IList(Of String) ``` |

| Visual C++ |
| --- |
| ``` public: IList<String^>^ GetScans() ``` |

#### Return Value

Resulting array of scan names.

# See Also

PointCloudInstance Class

Autodesk.Revit.DB Namespace

#### Action Property

---

|  |
| --- |
| IFCImportOptions Class   See Also |

The action of the import.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public IFCImportAction Action { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Action As IFCImportAction 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property IFCImportAction Action { 	IFCImportAction get (); 	void set (IFCImportAction value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

IFCImportOptions Class

Autodesk.Revit.DB.IFC Namespace

#### NewAreaBoundaryConditions Method (Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double)

---

|  |
| --- |
| Document Class   Example   See Also |

Creates a new Area BoundaryConditions element on a reference.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public BoundaryConditions NewAreaBoundaryConditions( 	Reference reference, 	TranslationRotationValue X_Translation, 	double X_TranslationSpringModulus, 	TranslationRotationValue Y_Translation, 	double Y_TranslationSpringModulus, 	TranslationRotationValue Z_Translation, 	double Z_TranslationSpringModulus ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewAreaBoundaryConditions ( _ 	reference As Reference, _ 	X_Translation As TranslationRotationValue, _ 	X_TranslationSpringModulus As Double, _ 	Y_Translation As TranslationRotationValue, _ 	Y_TranslationSpringModulus As Double, _ 	Z_Translation As TranslationRotationValue, _ 	Z_TranslationSpringModulus As Double _ ) As BoundaryConditions ``` |

| Visual C++ |
| --- |
| ``` public: BoundaryConditions^ NewAreaBoundaryConditions( 	Reference^ reference,  	TranslationRotationValue X_Translation,  	double X_TranslationSpringModulus,  	TranslationRotationValue Y_Translation,  	double Y_TranslationSpringModulus,  	TranslationRotationValue Z_Translation,  	double Z_TranslationSpringModulus ) ``` |

#### Parameters

reference
:   Type:  Autodesk.Revit.DB Reference
     The Geometry reference obtained from a Wall, Slab or Slab Foundation.

X\_Translation
:   Type:  Autodesk.Revit.DB.Structure TranslationRotationValue
     A value indicating the X axis translation option.

X\_TranslationSpringModulus
:   Type:  System Double
     Translation Spring Modulus for X axis. Ignored if X\_Translation is not "Spring".

Y\_Translation
:   Type:  Autodesk.Revit.DB.Structure TranslationRotationValue
     A value indicating the Y axis translation option.

Y\_TranslationSpringModulus
:   Type:  System Double
     Translation Spring Modulus for Y axis. Ignored if Y\_Translation is not "Spring".

Z\_Translation
:   Type:  Autodesk.Revit.DB.Structure TranslationRotationValue
     A value indicating the Z axis translation option.

Z\_TranslationSpringModulus
:   Type:  System Double
     Translation Spring Modulus for Z axis. Ignored if Z\_Translation is not "Spring".

#### Return Value

If successful, NewAreaBoundaryConditions returns an object for the newly created BoundaryConditions with the BoundaryType = 2 - "Area".    a null reference (  Nothing  in Visual Basic)  is returned if the operation fails.

# Remarks

This method will only function with the Autodesk Revit Structure application.

# Examples

 Copy  C#

```
bool CreateAreaConditionWithReference(AnalyticalPanel wall, Autodesk.Revit.Creation.Document docCreation)
{
   // Get the Geometry reference to the wall
   Reference profileReference = null;
   if (null == wall)
   {
      return false; // the profile reference can't be retrieved.
   }

   // loop through the curves of the wall and get the first one as a reference
   foreach (Curve curve in wall.GetOuterContour())
   {
      AnalyticalModelSelector selector = new AnalyticalModelSelector(curve);

      profileReference = wall.GetReference(selector);
      if (null != profileReference)
      {
         break;
      }
   }
   BoundaryConditions condition = null;
   // Create the Area Boundary Conditions if we have a profileReference
   if (null != profileReference)
   {
      // Create Area Boundary Conditions with profile reference.
      condition = docCreation.NewAreaBoundaryConditions(profileReference, TranslationRotationValue.Fixed, 0,
                                                                          TranslationRotationValue.Fixed, 0,
                                                                          TranslationRotationValue.Fixed, 0);
   }
   return (null != condition);
}
```

 Copy  VB.NET

```
Private Function CreateAreaConditionWithReference(wall As Wall, docCreation As Autodesk.Revit.Creation.Document) As Boolean
   ' Get the Geometry reference to the wall
   Dim profileReference As Reference = Nothing
   Dim document As Document = wall.Document
   Dim analytical As Autodesk.Revit.DB.Structure.AnalyticalPanel = Nothing
   Dim relManager As Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager = Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.GetAnalyticalToPhysicalAssociationManager(document)

   If (relManager Is Nothing) Then
      Return False
   End If

   Dim counterpartId As ElementId = relManager.GetAssociatedElementId(wall.Id)
   If (counterpartId Is Nothing) Then
      Return False
   End If

   analytical = document.GetElement(counterpartId)
   If analytical Is Nothing Then
      ' the profile reference can't be retrieved.
      Return False
   End If

   ' loop through the curves of the wall and get the first one as a reference
   For Each curve As Curve In analytical.GetOuterContour().ToList()
      profileReference = curve.Reference
      If profileReference IsNot Nothing Then
         Exit For
      End If
   Next

   Dim condition As BoundaryConditions = Nothing
   ' Create the Area Boundary Conditions if we have a profileReference
   If profileReference IsNot Nothing Then
      ' Create Area Boundary Conditions with profile reference.
      condition = docCreation.NewAreaBoundaryConditions(profileReference, TranslationRotationValue.Fixed, 0, TranslationRotationValue.Fixed, 0, TranslationRotationValue.Fixed,
              0)
   End If
   Return (condition IsNot Nothing)
End Function
```

# See Also

Document Class

NewAreaBoundaryConditions Overload

Autodesk.Revit.Creation Namespace

#### KgPerM Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol kg/m, indicating unit Kilograms per meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KgPerM { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KgPerM As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KgPerM { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### GetSelectedElementIds Method

---

|  |
| --- |
| NavisworksExportOptions Class   See Also |

Returns the element ids of the elements to export. Empty by default.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ICollection<ElementId> GetSelectedElementIds() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSelectedElementIds As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<ElementId^>^ GetSelectedElementIds() ``` |

# See Also

NavisworksExportOptions Class

Autodesk.Revit.DB Namespace

#### RungSpace Property

---

|  |
| --- |
| CableTray Class   See Also |

Distance between two rungs for the ladder cable tray.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double RungSpace { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property RungSpace As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double RungSpace { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The rung space value should be at least equal to or larger than rang width which is 1 inch. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also

CableTray Class

Autodesk.Revit.DB.Electrical Namespace

#### RadiansPerSecond Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Radians per second.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RadiansPerSecond { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RadiansPerSecond As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RadiansPerSecond { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### Clone Method

---

|  |
| --- |
| Curve Class   See Also |

Returns a copy of this curve.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Curve Clone() ``` |

| Visual Basic |
| --- |
| ``` Public Function Clone As Curve ``` |

| Visual C++ |
| --- |
| ``` public: Curve^ Clone() ``` |

#### Return Value

A copy of this curve.

# See Also

Curve Class

Autodesk.Revit.DB Namespace

#### IsMasking Property

---

|  |
| --- |
| FilledRegion Class   See Also |

Indicates whether this element is a 'Filled Region or a 'Masking Region'.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool IsMasking { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsMasking As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsMasking { 	bool get (); } ``` |

# See Also

FilledRegion Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| TransmissionData Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

TransmissionData Class

Autodesk.Revit.DB Namespace

#### ConnectPipePlaceholdersAtCross Method (Document, Connector, Connector, Connector, Connector)

---

|  |
| --- |
| PlumbingUtils Class   See Also |

Connects placeholders that looks like Cross connection.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static bool ConnectPipePlaceholdersAtCross( 	Document document, 	Connector connector1, 	Connector connector2, 	Connector connector3, 	Connector connector4 ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ConnectPipePlaceholdersAtCross ( _ 	document As Document, _ 	connector1 As Connector, _ 	connector2 As Connector, _ 	connector3 As Connector, _ 	connector4 As Connector _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool ConnectPipePlaceholdersAtCross( 	Document^ document,  	Connector^ connector1,  	Connector^ connector2,  	Connector^ connector3,  	Connector^ connector4 ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

connector1
:   Type:  Autodesk.Revit.DB Connector
     The first end connector of placeholder to be connected to the second.

connector2
:   Type:  Autodesk.Revit.DB Connector
     The second end connector of placeholder to be connected to the first.

connector3
:   Type:  Autodesk.Revit.DB Connector
     The third end connector of placeholder to be connected to the forth.

connector4
:   Type:  Autodesk.Revit.DB Connector
     The fourth end connector of placeholder to be connected to the third.

#### Return Value

True if connection succeeds, false otherwise.

# Remarks

The placeholders may or may not have physical connection. However a) The ends of four connectors should intersect at same point; b) the first and second placeholders should be collinear each other; c) the third and fourth placeholders should be collinear each other and d) the third and fourth should have intersection with first or second placeholder. If connection fails, the placeholders cannot be physically connected.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The owner of connector is not pipe placeholder. -or- The owners of connectors belong to different types of system. -or- The curves of connector1 and connector2 are not collinear or either the connecto1 or connector2 is not connector of curve end. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PlumbingUtils Class

ConnectPipePlaceholdersAtCross Overload

Autodesk.Revit.DB.Plumbing Namespace

#### GetTransparency Method

---

|  |
| --- |
| ColorWithTransparency Class   See Also |

get transparency

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public uint GetTransparency() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetTransparency As UInteger ``` |

| Visual C++ |
| --- |
| ``` public: unsigned int GetTransparency() ``` |

#### Return Value

transparency

# See Also

ColorWithTransparency Class

Autodesk.Revit.DB Namespace

#### JoinGeometry Method

---

|  |
| --- |
| JoinGeometryUtils Class   See Also |

Creates clean joins between two elements that share a common face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static void JoinGeometry( 	Document document, 	Element firstElement, 	Element secondElement ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub JoinGeometry ( _ 	document As Document, _ 	firstElement As Element, _ 	secondElement As Element _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void JoinGeometry( 	Document^ document,  	Element^ firstElement,  	Element^ secondElement ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document containing the two elements.

firstElement
:   Type:  Autodesk.Revit.DB Element
     The first element to be joined.

secondElement
:   Type:  Autodesk.Revit.DB Element
     The second element to be joined. This element must not be joined to the first element.

# Remarks

The visible edge between joined elements is removed. The joined elements then share the same line weight and fill pattern. This functionality is not available for family documents.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | document is not a project document. -or- The element firstElement was not found in the given document. -or- The element secondElement was not found in the given document. -or- The elements are already joined. -or- The elements cannot be joined. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Please remove or add segments on curtain grids instead of joining or unjoining geometry of the panels. |

# See Also

JoinGeometryUtils Class

Autodesk.Revit.DB Namespace

#### RailingSystemSegmentVGrid Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"V Grid"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RailingSystemSegmentVGrid { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RailingSystemSegmentVGrid As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RailingSystemSegmentVGrid { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### SetDeckEmbeddingType Method

---

|  |
| --- |
| CompoundStructure Class   See Also |

Sets the deck embedding type to use for the specified structural deck.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetDeckEmbeddingType( 	int layerIdx, 	StructDeckEmbeddingType embedType ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetDeckEmbeddingType ( _ 	layerIdx As Integer, _ 	embedType As StructDeckEmbeddingType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetDeckEmbeddingType( 	int layerIdx,  	StructDeckEmbeddingType embedType ) ``` |

#### Parameters

layerIdx
:   Type:  System Int32
     Index of a layer in the CompoundStructure.

embedType
:   Type:  Autodesk.Revit.DB StructDeckEmbeddingType
     The embedding type to be used by the specified layer if it is a structural deck.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The layer is not a structural deck. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The layer index is out of range. -or- A value passed for an enumeration argument is not a member of that enumeration |

# See Also

CompoundStructure Class

Autodesk.Revit.DB Namespace

#### ExportExtrudedSlabOpenings Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static void ExportExtrudedSlabOpenings( 	ExporterIFC exporterIFC, 	Element pElem, 	IFCLevelInfo levelInfo, 	IFCAnyHandle localPlacementAny, 	IList<IFCAnyHandle> elementSlabAnyArr, 	IList<IList<CurveLoop>> extrusionLoops, 	Plane plane, 	IFCProductWrapper pWrapper ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub ExportExtrudedSlabOpenings ( _ 	exporterIFC As ExporterIFC, _ 	pElem As Element, _ 	levelInfo As IFCLevelInfo, _ 	localPlacementAny As IFCAnyHandle, _ 	elementSlabAnyArr As IList(Of IFCAnyHandle), _ 	extrusionLoops As IList(Of IList(Of CurveLoop)), _ 	plane As Plane, _ 	pWrapper As IFCProductWrapper _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void ExportExtrudedSlabOpenings( 	ExporterIFC^ exporterIFC,  	Element^ pElem,  	IFCLevelInfo^ levelInfo,  	IFCAnyHandle^ localPlacementAny,  	IList<IFCAnyHandle^>^ elementSlabAnyArr,  	IList<IList<CurveLoop^>^>^ extrusionLoops,  	Plane^ plane,  	IFCProductWrapper^ pWrapper ) ``` |

#### Parameters

exporterIFC
:   Type:  Autodesk.Revit.DB.IFC ExporterIFC

pElem
:   Type:  Autodesk.Revit.DB Element

levelInfo
:   Type:  Autodesk.Revit.DB.IFC IFCLevelInfo

localPlacementAny
:   Type:  Autodesk.Revit.DB.IFC IFCAnyHandle

elementSlabAnyArr
:   Type:  System.Collections.Generic IList   IFCAnyHandle

extrusionLoops
:   Type:  System.Collections.Generic IList   IList   CurveLoop

plane
:   Type:  Autodesk.Revit.DB Plane

pWrapper
:   Type:  Autodesk.Revit.DB.IFC IFCProductWrapper

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace

#### GetFlangeThicknessInQuarterWidth Method

---

|  |
| --- |
| StructuralSectionGeneralT Class   See Also |

Returns thickness of flange measured in the 0.25 \* width, sometimes used for sections with width <= 300 mm.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public double GetFlangeThicknessInQuarterWidth() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFlangeThicknessInQuarterWidth As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetFlangeThicknessInQuarterWidth() ``` |

# See Also

StructuralSectionGeneralT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### Create Method

---

|  |
| --- |
| PhaseFilter Class   See Also |

Creates a new phase filter with default status presentation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static PhaseFilter Create( 	Document document, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	name As String _ ) As PhaseFilter ``` |

| Visual C++ |
| --- |
| ``` public: static PhaseFilter^ Create( 	Document^ document,  	String^ name ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

name
:   Type:  System String
     The name.

#### Return Value

The newly created phase filter.

# Remarks

The default status presentation is ShowByCategory for New status, and ShowOverriden for Existing, Demolished and Temporary statuses.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | name is already in use. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PhaseFilter Class

Autodesk.Revit.DB Namespace

#### Insert Method

---

|  |
| --- |
| AssetSet Class   See Also |

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool Insert( 	Asset item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Insert ( _ 	item As Asset _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Insert( 	Asset^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB.Visual Asset

# See Also

AssetSet Class

Autodesk.Revit.DB.Visual Namespace

#### AlertColor Property

---

|  |
| --- |
| ColorOptions Class   See Also |

The color used to highlight elements when a special alert is required.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public Color AlertColor { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property AlertColor As Color 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Color^ AlertColor { 	Color^ get (); 	void set (Color^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ColorOptions Class

Autodesk.Revit.DB Namespace

#### DpartShapeModified Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Shape is modified"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DpartShapeModified { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DpartShapeModified As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DpartShapeModified { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetResolutionCaption Method

---

|  |
| --- |
| FailureDefinitionAccessor Class   See Also |

Retrieves the caption for a specific resolution type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public string GetResolutionCaption( 	FailureResolutionType type ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetResolutionCaption ( _ 	type As FailureResolutionType _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetResolutionCaption( 	FailureResolutionType type ) ``` |

#### Parameters

type
:   Type:  Autodesk.Revit.DB FailureResolutionType
     The resolution type.

#### Return Value

The caption of the resolution.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Resolution of the type is not applicable to the failure. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | The FailureDefinitionAccessor has not been properly initialized. -or- FailureDefinition does not have any resolutions. |

# See Also

FailureDefinitionAccessor Class

Autodesk.Revit.DB Namespace

#### Insert Method

---

|  |
| --- |
| SlabShapeVertexArray Class   See Also |

Insert the specified item into the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Insert( 	SlabShapeVertex item, 	int index ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Insert ( _ 	item As SlabShapeVertex, _ 	index As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Insert( 	SlabShapeVertex^ item,  	int index ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB SlabShapeVertex
     The item to be inserted into the array.

index
:   Type:  System Int32
     The item will be inserted before this index.

#### Return Value

Returns whether the item was inserted into the array.

# See Also

SlabShapeVertexArray Class

Autodesk.Revit.DB Namespace

#### DocumentSaved Event

---

|  |
| --- |
| Document Class   See Also |

Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public event EventHandler<DocumentSavedEventArgs> DocumentSaved ``` |

| Visual Basic |
| --- |
| ``` Public Event DocumentSaved As EventHandler(Of DocumentSavedEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<DocumentSavedEventArgs^>^ DocumentSaved { 	void add (EventHandler<DocumentSavedEventArgs^>^ value); 	void remove (EventHandler<DocumentSavedEventArgs^>^ value); } ``` |

# Remarks

This event is raised immediately after Revit has finished saving a document. Note that the first save of a newly created document will raise  DocumentSavedAs  rather than the DocumentSaved event. It is raised even when document saving failed or was cancelled (during DocumentSaving event).

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

Check the 'Status' property in event's argument to see whether the action itself was successful or not.

This event is not cancellable, for the process of saving document has already been finished.

The following API functions are not available for the current document during this event:

* Close  and similar overloads.
* Save  .
* SaveAs(String)  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### BoundaryYRotationFixed Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Y Rotation - Fixed"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BoundaryYRotationFixed { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BoundaryYRotationFixed As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BoundaryYRotationFixed { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StretchAndFit Method

---

|  |
| --- |
| FabricationPart Class   See Also |

Stretch the fabrication part from the specified connector and fit to the target routing end.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static FabricationPartFitResult StretchAndFit( 	Document document, 	Connector stretchConnector, 	FabricationPartRouteEnd target, 	out ISet<ElementId> newPartIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function StretchAndFit ( _ 	document As Document, _ 	stretchConnector As Connector, _ 	target As FabricationPartRouteEnd, _ 	<OutAttribute> ByRef newPartIds As ISet(Of ElementId) _ ) As FabricationPartFitResult ``` |

| Visual C++ |
| --- |
| ``` public: static FabricationPartFitResult StretchAndFit( 	Document^ document,  	Connector^ stretchConnector,  	FabricationPartRouteEnd^ target,  	[OutAttribute] ISet<ElementId^>^% newPartIds ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document in which to perform the stretch and fit.

stretchConnector
:   Type:  Autodesk.Revit.DB Connector
     The connector of the fabrication part to be stretched.

target
:   Type:  Autodesk.Revit.DB.Fabrication FabricationPartRouteEnd
     The target routing end to align and fit to.

newPartIds
:   Type:  System.Collections.Generic ISet   ElementId   %
     New fabrication part element identifiers.

#### Return Value

Returns FabricationPartFitResult::Success if successful.

# Remarks

Cannot stretch and fit fabrication part straight, tap or hanger.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Connector does not belong to a fabrication part with a valid fabrication service. -or- Connector is connected. -or- Connector belongs to a fabrication part straight, tap or hanger. -or- routing end is valid to route to. -or- stretch target end type must be a supported type. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | fabrication part is not connected at one end only. -or- cannot stretch fabrication part to a different service. |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### SetValue Method (Int32)

---

|  |
| --- |
| ScheduleFilter Class   See Also |

Set the filter value to an integer.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetValue( 	int value ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetValue ( _ 	value As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetValue( 	int value ) ``` |

#### Parameters

value
:   Type:  System Int32
     The filter value.

# See Also

ScheduleFilter Class

SetValue Overload

Autodesk.Revit.DB Namespace

#### HideCategoriesTemporary Method

---

|  |
| --- |
| View Class   See Also |

Set multiple categories to be temporarily hidden in the view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void HideCategoriesTemporary( 	ICollection<ElementId> elementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub HideCategoriesTemporary ( _ 	elementIds As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void HideCategoriesTemporary( 	ICollection<ElementId^>^ elementIds ) ``` |

#### Parameters

elementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     Ids of the categories to be hidden

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Some elements in elementIds do not correspond to a Category. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### Percentage Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Percentage.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Percentage { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Percentage As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Percentage { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### CategoryId2 Property

---

|  |
| --- |
| AssemblyMemberDifferentCategory Class   See Also |

Category id of the second assembly member

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ElementId CategoryId2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property CategoryId2 As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ CategoryId2 { 	ElementId^ get (); } ``` |

# See Also

AssemblyMemberDifferentCategory Class

Autodesk.Revit.DB Namespace

#### Value Property

---

|  |
| --- |
| ElementIdParameterValue Class   See Also |

The stored value

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public ElementId Value { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Value As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ Value { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ElementIdParameterValue Class

Autodesk.Revit.DB Namespace

#### CreateElevationMarker Method

---

|  |
| --- |
| ElevationMarker Class   See Also |

Creates a new ElevationMarker.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static ElevationMarker CreateElevationMarker( 	Document document, 	ElementId viewFamilyTypeId, 	XYZ origin, 	int initialViewScale ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateElevationMarker ( _ 	document As Document, _ 	viewFamilyTypeId As ElementId, _ 	origin As XYZ, _ 	initialViewScale As Integer _ ) As ElevationMarker ``` |

| Visual C++ |
| --- |
| ``` public: static ElevationMarker^ CreateElevationMarker( 	Document^ document,  	ElementId^ viewFamilyTypeId,  	XYZ^ origin,  	int initialViewScale ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document to which the new ElevationMarker will be added.

viewFamilyTypeId
:   Type:  Autodesk.Revit.DB ElementId
     This ViewFamilyType will be used by all elevations hosted on the new ElevationMarker.

origin
:   Type:  Autodesk.Revit.DB XYZ
     The desired origin for the ElevationMarker.

initialViewScale
:   Type:  System Int32
     This view scale will be automatically applied to new elevations created on the ElevationMarker. The scale is the ratio of true model size to paper size.

#### Return Value

The new ElevationMarker.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This view family type is not appropriate for ElevationMarkers. -or- The denominator X of the view scale 1/X must be in the range 1 to 24,000. -or- Elevation view creation is not allowed in this family. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ElevationMarker Class

Autodesk.Revit.DB Namespace

#### SetPartCustomDataReal Method

---

|  |
| --- |
| FabricationPart Class   See Also |

Set the custom data real value for the specified custom data.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public void SetPartCustomDataReal( 	int customId, 	double value ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetPartCustomDataReal ( _ 	customId As Integer, _ 	value As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetPartCustomDataReal( 	int customId,  	double value ) ``` |

#### Parameters

customId
:   Type:  System Int32
     The identifier of the custom data field to set.

value
:   Type:  System Double
     The real value of the custom data. If the data is not a real type the value will be parsed according to the fabrication confifuration rules.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The custom data does not exist on the part. |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### UpperRange Property

---

|  |
| --- |
| ProgressChangedEventArgs Class   See Also |

Upper part of progress bar range - will be any non-zero number

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public int UpperRange { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property UpperRange As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int UpperRange { 	int get (); } ``` |

# See Also

ProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### StringParameterValue Class

---

|  |
| --- |
| Members   See Also |

A class that holds a String value of a parameter element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public class StringParameterValue : ParameterValue ``` |

| Visual Basic |
| --- |
| ``` Public Class StringParameterValue _ 	Inherits ParameterValue ``` |

| Visual C++ |
| --- |
| ``` public ref class StringParameterValue : public ParameterValue ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ParameterValue
  Autodesk.Revit.DB StringParameterValue

# See Also

StringParameterValue Members

Autodesk.Revit.DB Namespace

#### DimLabel Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Label"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DimLabel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DimLabel As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DimLabel { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StairsInMultistoryExceedTopConstraint Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Stairs in MultistoryStairs after adjusting still exceed the top constraint.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId StairsInMultistoryExceedTopConstraint { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsInMultistoryExceedTopConstraint As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ StairsInMultistoryExceedTopConstraint { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### GetBoundingBox Method

---

|  |
| --- |
| GeometryElement Class   See Also |

Retrieves a box that encloses the geometry element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public BoundingBoxXYZ GetBoundingBox() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetBoundingBox As BoundingBoxXYZ ``` |

| Visual C++ |
| --- |
| ``` public: BoundingBoxXYZ^ GetBoundingBox() ``` |

#### Return Value

The bounding box.

# See Also

GeometryElement Class

Autodesk.Revit.DB Namespace

#### GetOuterContour Method

---

|  |
| --- |
| AnalyticalSurfaceBase Class   See Also |

Returns the Curve Loop that defines the geometry of the Analytical Surface element.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public CurveLoop GetOuterContour() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetOuterContour As CurveLoop ``` |

| Visual C++ |
| --- |
| ``` public: CurveLoop^ GetOuterContour() ``` |

#### Return Value

CurveLoop associated with Analytical Surface element.

# See Also

AnalyticalSurfaceBase Class

Autodesk.Revit.DB.Structure Namespace

#### ReleaseConditions Constructor (Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)

---

|  |
| --- |
| ReleaseConditions Class   See Also |

Creates a new instance of ReleaseConditions.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public ReleaseConditions( 	bool start, 	bool fx, 	bool fy, 	bool fz, 	bool mx, 	bool my, 	bool mz ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	start As Boolean, _ 	fx As Boolean, _ 	fy As Boolean, _ 	fz As Boolean, _ 	mx As Boolean, _ 	my As Boolean, _ 	mz As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ReleaseConditions( 	bool start,  	bool fx,  	bool fy,  	bool fz,  	bool mx,  	bool my,  	bool mz ) ``` |

#### Parameters

start
:   Type:  System Boolean
     The position on analytical element. True for start, false for end.

fx
:   Type:  System Boolean
     Fx of the release type.

fy
:   Type:  System Boolean
     Fy of the release type.

fz
:   Type:  System Boolean
     Fz of the release type.

mx
:   Type:  System Boolean
     Mx of the release type.

my
:   Type:  System Boolean
     My of the release type.

mz
:   Type:  System Boolean

# See Also

ReleaseConditions Class

ReleaseConditions Overload

Autodesk.Revit.DB.Structure Namespace

#### SurfaceDataSource Property

---

|  |
| --- |
| MassSurfaceData Class   See Also |

Indicates whether the MassSurfaceData properties are driven by the EnergyDataSettings of the Document or are overridden for the surface.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public MassSurfaceDataSource SurfaceDataSource { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SurfaceDataSource As MassSurfaceDataSource 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property MassSurfaceDataSource SurfaceDataSource { 	MassSurfaceDataSource get (); 	void set (MassSurfaceDataSource value); } ``` |

# Remarks

The Construction property is not governed by this setting and has a separate value to indicate if it is to be synchronized with EnergyDataSettings.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The surface data source does not fall within an appropriate range. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace

#### Parameter Property (BuiltInParameter)

---

|  |
| --- |
| Element Class   Example   See Also |

Retrieves a parameter from the element given a parameter id.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Parameter this[ 	BuiltInParameter parameterId ] { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Parameter ( _ 	parameterId As BuiltInParameter _ ) As Parameter 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Parameter^ Parameter[BuiltInParameter parameterId] { 	Parameter^ get (BuiltInParameter parameterId); } ``` |

#### Parameters

parameterId
:   Type:  Autodesk.Revit.DB BuiltInParameter
     The built in parameter id of the parameter to be retrieved.

# Remarks

Parameters are a generic form of data storage within elements. The parameters are visible through the Autodesk Revit user interface in the Element Properties dialog. This method uses a built in parameter id to access the parameter. Autodesk Revit has a large number of built in parameters that are available via an enumerated type.

# Examples

 Copy  C#

```
public Parameter FindWithBuiltinParameterID(Wall wall)
{
    //Use the WALL_BASE_OFFSET paramametId
    // to get the base offset parameter of the wall.
    BuiltInParameter paraIndex = BuiltInParameter.WALL_BASE_OFFSET;
    Parameter parameter = wall.get_Parameter(paraIndex);

    return parameter;
}
```

 Copy  VB.NET

```
Public Function FindWithBuiltinParameterID(wall As Wall) As Parameter
    'Use the WALL_BASE_OFFSET paramametId
    ' to get the base offset parameter of the wall.
    Dim paraIndex As BuiltInParameter = BuiltInParameter.WALL_BASE_OFFSET
    Dim parameter As Parameter = wall.Parameter(paraIndex)

    Return parameter
End Function
```

# See Also

Element Class

Parameter Overload

Autodesk.Revit.DB Namespace

#### IsPipingAnalysisEnabled Property

---

|  |
| --- |
| Application Class   See Also |

Checks whether or not piping analysis is enabled, and enable or disable it.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool IsPipingAnalysisEnabled { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsPipingAnalysisEnabled As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsPipingAnalysisEnabled { 	bool get (); 	void set (bool value); } ``` |

# Remarks

Enabling piping analysis will not take effect unless the piping discipline is also enabled.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled. |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### UnableToTransformElement Property

---

|  |
| --- |
| BuiltInFailures EditingFailures Class   See Also |

Attempted an invalid element rotate, mirror, or move.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId UnableToTransformElement { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property UnableToTransformElement As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ UnableToTransformElement { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EditingFailures Class

Autodesk.Revit.DB Namespace

#### MechanicalEquipmentSetBeingDeleted Property

---

|  |
| --- |
| BuiltInFailures MEPCalculationFailures Class   See Also |

The mechanical equipment set was deleted because it no longer contained any members.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId MechanicalEquipmentSetBeingDeleted { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MechanicalEquipmentSetBeingDeleted As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ MechanicalEquipmentSetBeingDeleted { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPCalculationFailures Class

Autodesk.Revit.DB Namespace

#### GetCurvesInView Method

---

|  |
| --- |
| DatumPlane Class   See Also |

Gets a collection of curves representing the DatumPlane element in the given view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public IList<Curve> GetCurvesInView( 	DatumExtentType extentMode, 	View view ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCurvesInView ( _ 	extentMode As DatumExtentType, _ 	view As View _ ) As IList(Of Curve) ``` |

| Visual C++ |
| --- |
| ``` public: IList<Curve^>^ GetCurvesInView( 	DatumExtentType extentMode,  	View^ view ) ``` |

#### Parameters

extentMode
:   Type:  Autodesk.Revit.DB DatumExtentType
     The extent type.

view
:   Type:  Autodesk.Revit.DB View
     The view.

#### Return Value

The curves.

# Remarks

Curves returned for Model extents can be different than curves returned for View-specific extents (2d extents) in the given view. In some cases, such as an arc grid in a section view, there will be two identical curves but offset from one another.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The datum plane cannot be visible in the view. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

DatumPlane Class

Autodesk.Revit.DB Namespace

#### UserCancelled Property

---

|  |
| --- |
| BuiltInFailures RegenFailures Class   See Also |

Operation is cancelled by the user.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId UserCancelled { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property UserCancelled As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ UserCancelled { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RegenFailures Class

Autodesk.Revit.DB Namespace

#### GetDefaultRepeatingReferenceSource Method

---

|  |
| --- |
| RepeatingReferenceSource Class   See Also |

Returns the default repeating reference source for a given element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static RepeatingReferenceSource GetDefaultRepeatingReferenceSource( 	Document document, 	ElementId elementId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetDefaultRepeatingReferenceSource ( _ 	document As Document, _ 	elementId As ElementId _ ) As RepeatingReferenceSource ``` |

| Visual C++ |
| --- |
| ``` public: static RepeatingReferenceSource^ GetDefaultRepeatingReferenceSource( 	Document^ document,  	ElementId^ elementId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document that contains the element.

elementId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the element.

#### Return Value

The default repeating reference source of the given element.

# Remarks

The element must support repeating references. Use HasRepeatingReferenceSource() to find out whether an element has any repeating references.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The element elementId does not exist in the document -or- The element does not have any repeating reference sources. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RepeatingReferenceSource Class

Autodesk.Revit.DB Namespace

#### OpenLoopError Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Lines must be in closed loops. The highlighted lines are open on one end.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId OpenLoopError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property OpenLoopError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ OpenLoopError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### ForceVector1 Property

---

|  |
| --- |
| AreaLoad Class   See Also |

The force vector applied to the 1st reference point of the area load, oriented according to OrientTo setting.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public XYZ ForceVector1 { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ForceVector1 As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ ForceVector1 { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Remarks

The default force unit is kN/m^2 for metric, and ksf for imperial. Use UnitUtils class methods to convert value from or to internal units.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

AreaLoad Class

Autodesk.Revit.DB.Structure Namespace

#### GetValues Method

---

|  |
| --- |
| ExportLayerTable Class   See Also |

Returns all the values stored in the map.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public IList<ExportLayerInfo> GetValues() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetValues As IList(Of ExportLayerInfo) ``` |

| Visual C++ |
| --- |
| ``` public: IList<ExportLayerInfo^>^ GetValues() ``` |

#### Return Value

Return the info array.

# See Also

ExportLayerTable Class

Autodesk.Revit.DB Namespace

#### IDuplicateTypeNamesHandler Interface

---

|  |
| --- |
| Members   See Also |

An interface for custom handlers of duplicate type names encountered during a paste operation. When the destination document contains types that have the same names as the types being copied, but different internals, a decision must be made on how to proceed - whether to cancel the operation or continue, but only copy types with unique names.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public interface IDuplicateTypeNamesHandler ``` |

| Visual Basic |
| --- |
| ``` Public Interface IDuplicateTypeNamesHandler ``` |

| Visual C++ |
| --- |
| ``` public interface class IDuplicateTypeNamesHandler ``` |

# See Also

IDuplicateTypeNamesHandler Members

Autodesk.Revit.DB Namespace

#### AddSeparator Method

---

|  |
| --- |
| RibbonPanel Class   See Also |

Adds a new Separator to the panel.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void AddSeparator() ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddSeparator ``` |

| Visual C++ |
| --- |
| ``` public: void AddSeparator() ``` |

# Remarks

The separator won't be shown if there are no items already added to the panel.

# See Also

RibbonPanel Class

Autodesk.Revit.UI Namespace

#### IsHVACSystemTypeId Method

---

|  |
| --- |
| FlexDuct Class   See Also |

Checks if given type is valid HVAC system type.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static bool IsHVACSystemTypeId( 	Document document, 	ElementId systemTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsHVACSystemTypeId ( _ 	document As Document, _ 	systemTypeId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsHVACSystemTypeId( 	Document^ document,  	ElementId^ systemTypeId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

systemTypeId
:   Type:  Autodesk.Revit.DB ElementId
     ElementId of the HVAC system type to check.

#### Return Value

True if the given systemTypeId is the HVAC system type, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FlexDuct Class

Autodesk.Revit.DB.Mechanical Namespace

#### ParentId Property

---

|  |
| --- |
| DisplacementElement Class   See Also |

The element id of the parent DisplacementElement. This DisplacementElement's relative transform will be concatenated with the absolute transform of its parent.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ElementId ParentId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ParentId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ ParentId { 	ElementId^ get (); } ``` |

# See Also

DisplacementElement Class

Autodesk.Revit.DB Namespace

#### IsCurveValidInView Method

---

|  |
| --- |
| DatumPlane Class   See Also |

Checks if the curve is valid to be as the extents for the datum plane in a view. The curve must be bound and coincident with the original one of the datum plane.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool IsCurveValidInView( 	DatumExtentType extentMode, 	View view, 	Curve curve ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsCurveValidInView ( _ 	extentMode As DatumExtentType, _ 	view As View, _ 	curve As Curve _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsCurveValidInView( 	DatumExtentType extentMode,  	View^ view,  	Curve^ curve ) ``` |

#### Parameters

extentMode
:   Type:  Autodesk.Revit.DB DatumExtentType
     The extent type.

view
:   Type:  Autodesk.Revit.DB View
     The view.

curve
:   Type:  Autodesk.Revit.DB Curve
     The curve.

#### Return Value

True if it is valid, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

DatumPlane Class

Autodesk.Revit.DB Namespace

#### UpdateMultiple Method (Document, IList(ElementId))

---

|  |
| --- |
| PathOfTravel Class   See Also |

Updates the specified paths of travel by recalculating each path using their original start and end points.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public static int UpdateMultiple( 	Document adoc, 	IList<ElementId> elementsToUpdate ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function UpdateMultiple ( _ 	adoc As Document, _ 	elementsToUpdate As IList(Of ElementId) _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: static int UpdateMultiple( 	Document^ adoc,  	IList<ElementId^>^ elementsToUpdate ) ``` |

#### Parameters

adoc
:   Type:  Autodesk.Revit.DB Document
     Document of elements to be updated.

elementsToUpdate
:   Type:  System.Collections.Generic IList   ElementId
     The list of  ElementId  of the paths to update.

#### Return Value

number of successfully updated elements

# Remarks

For unsuccessfully updated elements, Revit will post warnings.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | This functionality is not available in Revit LT. |

# See Also

PathOfTravel Class

UpdateMultiple Overload

Autodesk.Revit.DB.Analysis Namespace

#### CannotPasteModelPlusViewSpecificElementsIntoView Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Cannot paste view-specific model plus into view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotPasteModelPlusViewSpecificElementsIntoView { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotPasteModelPlusViewSpecificElementsIntoView As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotPasteModelPlusViewSpecificElementsIntoView { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### ModelUpdatesStatus Enumeration

---

|  |
| --- |
| See Also |

Indicates whether an element in the current model has additional user changes in the central model.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum ModelUpdatesStatus ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ModelUpdatesStatus ``` |

| Visual C++ |
| --- |
| ``` public enum class ModelUpdatesStatus ``` |

# Members

| Member name | Description |
| --- | --- |
| CurrentWithCentral | The element has no additional changes in the central model. |
| NotYetInCentral | The element is new in the current model and has not been saved to the central model. Note that this status will apply to newly created elements even if they are created in the central model. |
| DeletedInCentral | The element has been deleted in the central model. |
| UpdatedInCentral | The element has additional user changes in the central model. A reload latest will be required before it can be modified in the current model. |

# Remarks

Note that this status only indicates that the element has user changes in the central model. A user change is typically an action specifically taken by a user. Making a user change to an element requires that the user making the change reload all other user changes made to the element in the central model. Making a user change also causes the element to be checked out to the current user so other users will not be able to make user changes to the same element.

Elements can also be modified by system changes. A system change is one which is done automatically by Revit to fully update the model after a user change occurs. Users may make changes to an element in their local model even if the element contains additional system changes in the central model.

Example: Suppose Alice and Bob are working on the same model. Alice moves a wall which contains windows. Then Alice synchronizes with the central file. The wall was explicitly changed by Alice and so it will report as "UpdatedInCentral" in Bob's model. Bob would have to reload latest before he could make user changes to that wall. In contrast, Revit automatically moved the windows with the wall, so the windows do not contain any user changes. The windows would therefore report "CurrentWithCentral" and Bob would be allowed to modify them in his local model without reloading latest.

# See Also

Autodesk.Revit.DB Namespace

#### PrimaryUnits Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Primary Units"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PrimaryUnits { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PrimaryUnits As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PrimaryUnits { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### Ksf Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol ksf, indicating unit Kips per square foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Ksf { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Ksf As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Ksf { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### FaceWallComplexType Property

---

|  |
| --- |
| BuiltInFailures WallFailures Class   See Also |

Vertically compound wall type features sweeps, reveals, or split layers are not supported on non-vertical face. Consider using a simplified type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FaceWallComplexType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FaceWallComplexType As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FaceWallComplexType { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures WallFailures Class

Autodesk.Revit.DB Namespace

#### GetConditionImage Method

---

|  |
| --- |
| FabricationServiceButton Class   See Also |

Gets the image for the specified fabrication service button condition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public virtual Bitmap GetConditionImage( 	int condition ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetConditionImage ( _ 	condition As Integer _ ) As Bitmap ``` |

| Visual C++ |
| --- |
| ``` public: virtual Bitmap^ GetConditionImage( 	int condition ) ``` |

#### Parameters

condition
:   Type:  System Int32
     The condition index.

#### Return Value

System.Drawing.Bitmap represents the fabrication service button image.    a null reference (  Nothing  in Visual Basic)  if there is no preview image.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | the index condition is not larger or equal to 0 and less than ConditionCount |

# See Also

FabricationServiceButton Class

Autodesk.Revit.DB Namespace

#### Tier Property

---

|  |
| --- |
| EnergyAnalysisDetailModel Class   See Also |

Level of computation for energy analysis model.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public EnergyAnalysisDetailModelTier Tier { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Tier As EnergyAnalysisDetailModelTier 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property EnergyAnalysisDetailModelTier Tier { 	EnergyAnalysisDetailModelTier get (); } ``` |

# See Also

EnergyAnalysisDetailModel Class

Autodesk.Revit.DB.Analysis Namespace

#### SaveAsCloudModel Method (Guid, Guid, String, String)

---

|  |
| --- |
| Document Class   See Also |

Saves current non-workshared or workshared model as a cloud model or workshared cloud model in BIM 360 Docs or Autodesk Docs.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public void SaveAsCloudModel( 	Guid accountId, 	Guid projectId, 	string folderId, 	string modelName ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SaveAsCloudModel ( _ 	accountId As Guid, _ 	projectId As Guid, _ 	folderId As String, _ 	modelName As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SaveAsCloudModel( 	Guid accountId,  	Guid projectId,  	String^ folderId,  	String^ modelName ) ``` |

#### Parameters

accountId
:   Type:  System Guid
     The BIM 360 Docs or Autodesk Docs account Id. You can use one of the following methods to get this Id:

    * If you get the hub Id with Forge Data Management API, remove the prefix "b." of the Id string and convert the rest to a Guid.
    * If you get the account Id with Forge BIM 360 Docs or Autodesk Docs API, just convert the Id string to a Guid.

projectId
:   Type:  System Guid
     The BIM 360 Docs or Autodesk Docs project Id. You can use one of the following methods to get this Id:

    * If you get the project Id with Forge Data Management API, remove the prefix "b." of the Id string and convert the rest to a Guid.
    * If you get the project Id with Forge BIM 360 Docs or Autodesk Docs API, just convert the Id string to a Guid.

folderId
:   Type:  System String
     Folder identity in BIM 360 Docs or Autodesk Docs to save the model. You can use one of the following methods to get this Id:

    * The folder Id string from Forge Data Management API.
    * The folder Id string from Forge BIM 360 Docs or Autodesk Docs API.

modelName
:   Type:  System String
     Model name in BIM 360 Docs or Autodesk Docs to save the model.

# Remarks

Assumes that user is currently signed in BIM 360 Docs or Autodesk Docs and has access to Autodesk cloud services. This operation will create a model on cloud and then create a local cache of the cloud model. This method cannot be used when current document is already in cloud.

You can use one of the following methods to save a local model as a workshared cloud model in BIM 360 Docs or Autodesk Docs.

* If the local model is a workshared model, then it will be a workshared cloud model after you use this method successfully.
* If the local model is a non-workshared model, you can enable the workset with  EnableWorksharing(String, String)  and then save as a workshared cloud model.
* If the local model is a non-workshared model, and you have already saved it as a non-workshared cloud model in BIM 360 Docs or Autodesk Docs, you can still enable the workset with  EnableCloudWorksharing  to convert it to a workshared cloud model.

You cannot save a local workshared model as a non-workshared cloud model in BIM 360 Docs or Autodesk Docs.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | folderId is an empty string. -or- modelName is an empty string. -or- The input file name "modelName" does not represent a valid file name. -or- Thrown when the input BIM 360 Docs or Autodesk Docs account Id or project Id is invalid or unmatched. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ForbiddenForDynamicUpdateException | SaveAs may not be called during dynamic update. |
| Autodesk.Revit.Exceptions InvalidOperationException | Saving is not allowed in the current application mode. -or- This Document is not a project document. -or- This Document is in an edit mode. -or- This Document is not a primary document, it is a linked document. -or- SaveAs is temporarily disabled. -or- This Document is a cloud model, cannot be saved as a cloud model. -or- There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method. |
| Autodesk.Revit.Exceptions RevitServerCommunicationException | Could be for any of the reasons related to network. |
| Autodesk.Revit.Exceptions RevitServerInternalException | Could be for any of the reasons that saveAs fails with RevitServerInternalException. |
| Autodesk.Revit.Exceptions RevitServerModelAlreadyExistsException | Failed due to there is a model with the same name already exists at the specified location. |
| Autodesk.Revit.Exceptions RevitServerModelNameBreaksConventionException | Failed due to the model name is breaking project naming convention. |
| Autodesk.Revit.Exceptions RevitServerUnauthenticatedUserException | User is not signed in with Autodesk id. |
| Autodesk.Revit.Exceptions RevitServerUnauthorizedException | You don't have the entitlement to perform the operation to this this Document. -or- User is not authorized to access the specified cloud project. |

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### Contains Method

---

|  |
| --- |
| GeomCombinationSet Class   See Also |

Tests for the existence of an GeomCombination within the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool Contains( 	GeomCombination item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Contains ( _ 	item As GeomCombination _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Contains( 	GeomCombination^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB GeomCombination
     The element to be searched for.

#### Return Value

The Contains method returns True if the GeomCombination is within the set, otherwise False.

# See Also

GeomCombinationSet Class

Autodesk.Revit.DB Namespace

#### StairsRailingHeightShiftVal Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Landing Height Adjustment"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsRailingHeightShiftVal { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsRailingHeightShiftVal As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsRailingHeightShiftVal { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Create Method (XYZ, XYZ, Curve, Double, Double)

---

|  |
| --- |
| RevolvedSurface Class   See Also |

Creates a Surface object coincident with the surface of revolution defined by an axis, a profile curve, and start and end angles of revolution.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static Surface Create( 	XYZ axisBasePoint, 	XYZ axisDirection, 	Curve profileCurve, 	double startAngle, 	double endAngle ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	axisBasePoint As XYZ, _ 	axisDirection As XYZ, _ 	profileCurve As Curve, _ 	startAngle As Double, _ 	endAngle As Double _ ) As Surface ``` |

| Visual C++ |
| --- |
| ``` public: static Surface^ Create( 	XYZ^ axisBasePoint,  	XYZ^ axisDirection,  	Curve^ profileCurve,  	double startAngle,  	double endAngle ) ``` |

#### Parameters

axisBasePoint
:   Type:  Autodesk.Revit.DB XYZ
     The base point of the axis of revolution. Expected to lie within the Revit design limits  IsWithinLengthLimits(XYZ)  .

axisDirection
:   Type:  Autodesk.Revit.DB XYZ
     The direction of the axis.

profileCurve
:   Type:  Autodesk.Revit.DB Curve
     The profile curve, which should satisfy the following conditions:

    * It is bounded and non-degenerate.
    * It is co-planar with the axis of revolution.
    * It lies on only one side of the axis.
    * Only the end points of the profile curve can touch the axis.

startAngle
:   Type:  System Double
     Start angle of rotation. The angles are measured around the axis of revolution, using the right-hand rule. The profile curve is at the zero angle.

endAngle
:   Type:  System Double
     End angle of rotation. Start angle must be less than end angle and their difference must be less than or equal to two times PI.

#### Return Value

The created surface. Note that this surface may not be of type RevolvedSurface.

# Remarks

The returned surface may not be of type RevolvedSurface - this function will create a surface of the simplest possible type (Plane, Cylinder, etc.) that can be used to represent the required surface of revolution. Given that the surface may be simplified, this function does not guarantee any particular parameterization of the surface.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input point lies outside of Revit design limits. -or- The input profile curve is not valid to create a surface revolution around the given axis. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | axisDirection has zero length. |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | Start angle must be less than end angle and their difference must be less than or equal to two times PI. |

# See Also

RevolvedSurface Class

Create Overload

Autodesk.Revit.DB Namespace

#### ConstantHeightNotParallel Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Constant-height-defining lines must be parallel.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ConstantHeightNotParallel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ConstantHeightNotParallel As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ConstantHeightNotParallel { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### ErrorInFamilyResolved Property

---

|  |
| --- |
| BuiltInFailures GeneralFailures Class   See Also |

An error occurred in family "[Name]" and was automatically resolved. Please review changes made to the family.\nError Information:\n"[Text]"\nError Resolution: [Resolution]

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ErrorInFamilyResolved { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ErrorInFamilyResolved As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ErrorInFamilyResolved { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GeneralFailures Class

Autodesk.Revit.DB Namespace

#### WorksetConfigurationOption Enumeration

---

|  |
| --- |
| See Also |

A collection of options used to initialize a WorksetConfiguration.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public enum WorksetConfigurationOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WorksetConfigurationOption ``` |

| Visual C++ |
| --- |
| ``` public enum class WorksetConfigurationOption ``` |

# Members

| Member name | Description |
| --- | --- |
| OpenAllWorksets | Open all user-created worksets by default. Additional open requests will be ignored for this type of configuration. |
| CloseAllWorksets | Close all user-created worksets by default. Additional close requests will be ignored for this type of configuration. |
| OpenLastViewed | Close all user-created worksets by default, but open last viewed worksets. |

# See Also

Autodesk.Revit.DB Namespace

#### GetCellFormatOptions Method (Int32, Int32, Document)

---

|  |
| --- |
| TableSectionData Class   See Also |

Returns a cell's FormatOptions and if no FormatOptions exists for this cell, it would come from the column, or the row, or the section.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public FormatOptions GetCellFormatOptions( 	int nRow, 	int nCol, 	Document ccda ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCellFormatOptions ( _ 	nRow As Integer, _ 	nCol As Integer, _ 	ccda As Document _ ) As FormatOptions ``` |

| Visual C++ |
| --- |
| ``` public: FormatOptions^ GetCellFormatOptions( 	int nRow,  	int nCol,  	Document^ ccda ) ``` |

#### Parameters

nRow
:   Type:  System Int32

nCol
:   Type:  System Int32

ccda
:   Type:  Autodesk.Revit.DB Document

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given row number nRow is invalid. -or- The given column number nCol is invalid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

TableSectionData Class

GetCellFormatOptions Overload

Autodesk.Revit.DB Namespace

#### SetPointElementReference Method

---

|  |
| --- |
| ReferencePoint Class   See Also |

Change the rule for computing the location of the ReferencePoint relative to other elements in the document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetPointElementReference( 	PointElementReference pointElementReference ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetPointElementReference ( _ 	pointElementReference As PointElementReference _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetPointElementReference( 	PointElementReference^ pointElementReference ) ``` |

#### Parameters

pointElementReference
:   Type:  Autodesk.Revit.DB PointElementReference
     An object specifying a rule for the location and orientation of a ReferencePoint. (Note: The ReferencePoint object does not store the pointElementReference object after this call.)

# Remarks

pointElementReference may be    a null reference (  Nothing  in Visual Basic)  , in which case the ReferencePoint does not follow any other element. When Reference is changed from    a null reference (  Nothing  in Visual Basic)  to a non-null value, the point moves and rotates to the prescribed location and orientation. Where the coordinate system has some freedom, it will remain as close to the old orientation as possible. When the reference is set to    a null reference (  Nothing  in Visual Basic)  , the point does not move or rotate.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when Reference is set to a non-null object, and the ReferencePoint is unable to move to the new reference. |

# See Also

ReferencePoint Class

Autodesk.Revit.DB Namespace

#### FilterStringGreaterOrEqual Constructor

---

|  |
| --- |
| FilterStringGreaterOrEqual Class   See Also |

Constructs an instance of FilterStringGreaterOrEqual.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FilterStringGreaterOrEqual() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: FilterStringGreaterOrEqual() ``` |

# See Also

FilterStringGreaterOrEqual Class

Autodesk.Revit.DB Namespace

#### Length Property

---

|  |
| --- |
| FabricationAncillaryUsage Class   See Also |

Length of required ancillaries.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public double Length { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Length As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double Length { 	double get (); } ``` |

# See Also

FabricationAncillaryUsage Class

Autodesk.Revit.DB Namespace

#### SetFromRebarShape Method

---

|  |
| --- |
| RebarContainerItem Class   See Also |

Set an instance of a RebarContainerItem element, as an instance of a RebarShape. The instance will have the default shape parameters from the RebarShape, and its location is based on the bounding box of the shape in the shape definition. Hooks are removed from the shape before computing its bounding box. If appropriate hooks can be found in the document, they will be assigned arbitrarily.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void SetFromRebarShape( 	RebarShape rebarShape, 	RebarBarType barType, 	XYZ origin, 	XYZ xVec, 	XYZ yVec ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetFromRebarShape ( _ 	rebarShape As RebarShape, _ 	barType As RebarBarType, _ 	origin As XYZ, _ 	xVec As XYZ, _ 	yVec As XYZ _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetFromRebarShape( 	RebarShape^ rebarShape,  	RebarBarType^ barType,  	XYZ^ origin,  	XYZ^ xVec,  	XYZ^ yVec ) ``` |

#### Parameters

rebarShape
:   Type:  Autodesk.Revit.DB.Structure RebarShape
     A RebarShape element that defines the shape of the rebar.

barType
:   Type:  Autodesk.Revit.DB.Structure RebarBarType
     A RebarBarType element that defines bar diameter, bend radius and material of the rebar.

origin
:   Type:  Autodesk.Revit.DB XYZ
     The lower-left corner of the shape's bounding box will be placed at this point in the project.

xVec
:   Type:  Autodesk.Revit.DB XYZ
     The x-axis in the shape definition will be mapped to this direction in the project.

yVec
:   Type:  Autodesk.Revit.DB XYZ
     The y-axis in the shape definition will be mapped to this direction in the project.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The rebarShape has End Treatments |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | xVec has zero length. -or- yVec has zero length. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace

#### ExtensionUtility Property

---

|  |
| --- |
| FamilyInstance Class   See Also |

Property to check whether the instance can be extended and return the interface for extension operation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public IExtension ExtensionUtility { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ExtensionUtility As IExtension 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property IExtension^ ExtensionUtility { 	IExtension^ get (); } ``` |

# Remarks

If the family instance can not support extension operation, it returns    a null reference (  Nothing  in Visual Basic)

# See Also

FamilyInstance Class

Autodesk.Revit.DB Namespace

#### MultiReferenceAnnotationOptions Constructor

---

|  |
| --- |
| MultiReferenceAnnotationOptions Class   See Also |

Create an instance of Multi-Reference Annotation Options set with default values.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public MultiReferenceAnnotationOptions( 	MultiReferenceAnnotationType multiReferenceAnnotationType ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	multiReferenceAnnotationType As MultiReferenceAnnotationType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: MultiReferenceAnnotationOptions( 	MultiReferenceAnnotationType^ multiReferenceAnnotationType ) ``` |

#### Parameters

multiReferenceAnnotationType
:   Type:  Autodesk.Revit.DB MultiReferenceAnnotationType
     The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MultiReferenceAnnotationOptions Class

Autodesk.Revit.DB Namespace

#### CentralModelAlreadyExistsException Class

---

|  |
| --- |
| Members   See Also |

Exception is thrown when the central model already exists at the specified location.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` [SerializableAttribute] public class CentralModelAlreadyExistsException : CentralModelException ``` |

| Visual Basic |
| --- |
| ``` <SerializableAttribute> _ Public Class CentralModelAlreadyExistsException _ 	Inherits CentralModelException ``` |

| Visual C++ |
| --- |
| ``` [SerializableAttribute] public ref class CentralModelAlreadyExistsException : public CentralModelException ``` |

# Inheritance Hierarchy

System Object
  System Exception
  Autodesk.Revit.Exceptions ApplicationException
  Autodesk.Revit.Exceptions CentralModelException
  Autodesk.Revit.Exceptions CentralModelAlreadyExistsException

# See Also

CentralModelAlreadyExistsException Members

Autodesk.Revit.Exceptions Namespace

#### PlasticvinylBumpMap Property

---

|  |
| --- |
| PlasticVinyl Class   See Also |

The property labeled "Image" from the "PlasticVinyl" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string PlasticvinylBumpMap { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PlasticvinylBumpMap As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ PlasticvinylBumpMap { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

# See Also

PlasticVinyl Class

Autodesk.Revit.DB.Visual Namespace

#### TopographyLinkPath Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Saved Path"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TopographyLinkPath { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TopographyLinkPath As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TopographyLinkPath { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CloudPoint Constructor

---

|  |
| --- |
| CloudPoint Structure   See Also |

Creates a new cloud point.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CloudPoint( 	float x, 	float y, 	float z, 	int color ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	x As Single, _ 	y As Single, _ 	z As Single, _ 	color As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: CloudPoint( 	float x,  	float y,  	float z,  	int color ) ``` |

#### Parameters

x
:   Type:  System Single
     The X coordinate.

y
:   Type:  System Single
     The Y coordinate.

z
:   Type:  System Single
     The Z coordinate.

color
:   Type:  System Int32
     The color.

# See Also

CloudPoint Structure

Autodesk.Revit.DB.PointClouds Namespace

#### StructuralSectionLProfileWithLips Class

---

|  |
| --- |
| Members   See Also |

Defines parameters for L Profile with lips structural section.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public class StructuralSectionLProfileWithLips : StructuralSectionGeneralLA ``` |

| Visual Basic |
| --- |
| ``` Public Class StructuralSectionLProfileWithLips _ 	Inherits StructuralSectionGeneralLA ``` |

| Visual C++ |
| --- |
| ``` public ref class StructuralSectionLProfileWithLips : public StructuralSectionGeneralLA ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSection
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionRectangular
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionColdFormed
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionGeneralLA
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionLProfileWithLips

# See Also

StructuralSectionLProfileWithLips Members

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### TooManyElementsToCheckout Property

---

|  |
| --- |
| BuiltInFailures EditingFailures Class   See Also |

Too many elements were attempted to be marked as editable, prompt user to mark workset(s) editable instead

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId TooManyElementsToCheckout { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TooManyElementsToCheckout As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ TooManyElementsToCheckout { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EditingFailures Class

Autodesk.Revit.DB Namespace

#### VoltageIsOutOfRange Property

---

|  |
| --- |
| BuiltInFailures ElectricalFailures Class   See Also |

Cannot assign or add [Element] to Circuit. The Voltage ([Voltage Value]) for the Circuit is out of range for the Line to Ground Voltage for [Element] (The Line to Ground Voltage is specified in the assigned Distribution System)."

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId VoltageIsOutOfRange { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property VoltageIsOutOfRange As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ VoltageIsOutOfRange { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElectricalFailures Class

Autodesk.Revit.DB Namespace

#### GetSingleConnectedAsset Method

---

|  |
| --- |
| AssetProperty Class   Example   See Also |

Gets the single connected asset attached to this asset property, if it exists.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public Asset GetSingleConnectedAsset() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSingleConnectedAsset As Asset ``` |

| Visual C++ |
| --- |
| ``` public: Asset^ GetSingleConnectedAsset() ``` |

#### Return Value

The connected asset, or    a null reference (  Nothing  in Visual Basic)  if there is no connected asset.

# Remarks

Throws if there is more than one connected asset.

# Examples

 Copy  C#

```
private void SetBumpmapBitmap(Material material, String bumpmapImageFilepath)
{
   ElementId appearanceAssetId = material.AppearanceAssetId;

   AppearanceAssetElement assetElem = material.Document.GetElement(appearanceAssetId) as AppearanceAssetElement;

   using (Transaction t = new Transaction(material.Document, "Change material bumpmap bitmap"))
   {
      t.Start();

      using (AppearanceAssetEditScope editScope = new AppearanceAssetEditScope(assetElem.Document))
      {
         Asset editableAsset = editScope.Start(assetElem.Id);   // returns an editable copy of the appearance asset

         AssetProperty bumpMapProperty = editableAsset.FindByName("generic_bump_map");

         // Find the connected asset (with a shortcut to get the only one)

         Asset connectedAsset = bumpMapProperty.GetSingleConnectedAsset();

         if (connectedAsset == null)
         {
            // Add a new default connected asset
            bumpMapProperty.AddConnectedAsset("UnifiedBitmap");

            connectedAsset = bumpMapProperty.GetSingleConnectedAsset();
         }

         if (connectedAsset != null)
         {
            // Find the target asset property
            AssetPropertyString bumpmapBitmapProperty = connectedAsset.FindByName("unifiedbitmap_Bitmap") as AssetPropertyString;

            if (bumpmapBitmapProperty.IsValidValue(bumpmapImageFilepath))

               bumpmapBitmapProperty.Value = bumpmapImageFilepath;
         }

         editScope.Commit(true);
      }

      t.Commit();
   }
}
```

 Copy  VB.NET

```
Private Sub SetBumpmapBitmap(material As Material, bumpmapImageFilepath As [String])
    Dim appearanceAssetId As ElementId = material.AppearanceAssetId

    Dim assetElem As AppearanceAssetElement = TryCast(material.Document.GetElement(appearanceAssetId), AppearanceAssetElement)

    Using t As New Transaction(material.Document, "Change material bumpmap bitmap")
        t.Start()

        Using editScope As New AppearanceAssetEditScope(assetElem.Document)
            Dim editableAsset As Asset = editScope.Start(assetElem.Id)
       ' returns an editable copy of the appearance asset
       Dim bumpMapProperty As AssetProperty = editableAsset.FindByName("generic_bump_map")

       ' Find the connected asset (with a shortcut to get the only one)

       Dim connectedAsset As Asset = bumpMapProperty.GetSingleConnectedAsset()

            If connectedAsset Is Nothing Then
                ' Add a new default connected asset
                bumpMapProperty.AddConnectedAsset("UnifiedBitmap")

                connectedAsset = bumpMapProperty.GetSingleConnectedAsset()
            End If

            If connectedAsset IsNot Nothing Then
          ' Find the target asset property
          Dim bumpmapBitmapProperty As AssetPropertyString = TryCast(connectedAsset.FindByName("unifiedbitmap_Bitmap"), AssetPropertyString)

          If bumpmapBitmapProperty.IsValidValue(bumpmapImageFilepath) Then

                    bumpmapBitmapProperty.Value = bumpmapImageFilepath
                End If
            End If

            editScope.Commit(True)
        End Using

        t.Commit()
    End Using
End Sub
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Asset is connected to more than one asset. |

# See Also

AssetProperty Class

Autodesk.Revit.DB.Visual Namespace

#### GetJoinedElements Method

---

|  |
| --- |
| JoinGeometryUtils Class   See Also |

Returns all elements joined to given element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static ICollection<ElementId> GetJoinedElements( 	Document document, 	Element element ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetJoinedElements ( _ 	document As Document, _ 	element As Element _ ) As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ICollection<ElementId^>^ GetJoinedElements( 	Document^ document,  	Element^ element ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document containing the element.

element
:   Type:  Autodesk.Revit.DB Element
     The element.

#### Return Value

The set of elements that are joined to the given element.

# Remarks

This functionality is not available for family documents.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | document is not a project document. -or- The element element was not found in the given document. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

JoinGeometryUtils Class

Autodesk.Revit.DB Namespace

#### SurfaceRotation Property

---

|  |
| --- |
| AdvancedTransparent Class   See Also |

The property labeled "Rotation" from the "AdvancedTransparent" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string SurfaceRotation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SurfaceRotation As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ SurfaceRotation { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble". This property allows a connected asset.

# See Also

AdvancedTransparent Class

Autodesk.Revit.DB.Visual Namespace

#### BoundingBoxIntersectsFilter Constructor (Outline)

---

|  |
| --- |
| BoundingBoxIntersectsFilter Class   See Also |

Constructs a new instance of a filter to match elements with a bounding box that intersects the given Outline.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public BoundingBoxIntersectsFilter( 	Outline outline ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	outline As Outline _ ) ``` |

| Visual C++ |
| --- |
| ``` public: BoundingBoxIntersectsFilter( 	Outline^ outline ) ``` |

#### Parameters

outline
:   Type:  Autodesk.Revit.DB Outline
     The Outline used to find elements with a bounding box that intersect it.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | outline is an empty Outline. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

BoundingBoxIntersectsFilter Class

BoundingBoxIntersectsFilter Overload

Autodesk.Revit.DB Namespace

#### ContinuousFootingStructuralUsage Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Structural Usage"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ContinuousFootingStructuralUsage { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ContinuousFootingStructuralUsage As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ContinuousFootingStructuralUsage { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CreateHanger Method (Document, FabricationServiceButton, Int32, ElementId, Connector, Double, Boolean)

---

|  |
| --- |
| FabricationPart Class   See Also |

Creates a hanger on the fabrication part.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static FabricationPart CreateHanger( 	Document document, 	FabricationServiceButton button, 	int condition, 	ElementId hostId, 	Connector hostConnector, 	double distance, 	bool attachToStructure ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateHanger ( _ 	document As Document, _ 	button As FabricationServiceButton, _ 	condition As Integer, _ 	hostId As ElementId, _ 	hostConnector As Connector, _ 	distance As Double, _ 	attachToStructure As Boolean _ ) As FabricationPart ``` |

| Visual C++ |
| --- |
| ``` public: static FabricationPart^ CreateHanger( 	Document^ document,  	FabricationServiceButton^ button,  	int condition,  	ElementId^ hostId,  	Connector^ hostConnector,  	double distance,  	bool attachToStructure ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

button
:   Type:  Autodesk.Revit.DB FabricationServiceButton
     The fabrication service button to use.

condition
:   Type:  System Int32
     The condition index. If the button has multiple conditions.

hostId
:   Type:  Autodesk.Revit.DB ElementId
     The host part id. The host should be one horizontal straight part.

hostConnector
:   Type:  Autodesk.Revit.DB Connector
     The connector of the host.

distance
:   Type:  System Double
     The distance from the input connector of the host part. Units are in feet (ft).

attachToStructure
:   Type:  System Boolean
     Attach to the nearest structural element. The structural element might be one of Floor/Roof/Stair/Structural Framing.

#### Return Value

The newly-created fabrication hanger.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Hangers may only be placed on straight horizontal fabrication segments and some kind of fittings. -or- Invalid fabrication service button. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | the index condition is not larger or equal to 0 and less than ConditionCount |
| Autodesk.Revit.Exceptions InvalidOperationException | the distance is out of range. -or- cannot find suitable fabrication part for the host. -or- cannot place hanger on the host. |

# See Also

FabricationPart Class

CreateHanger Overload

Autodesk.Revit.DB Namespace

#### Style Property

---

|  |
| --- |
| RebarHookType Class   See Also |

The hook may only be applied to shapes of the specified style.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public RebarStyle Style { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Style As RebarStyle 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property RebarStyle Style { 	RebarStyle get (); 	void set (RebarStyle value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

RebarHookType Class

Autodesk.Revit.DB.Structure Namespace

#### DimensionCount Property

---

|  |
| --- |
| RepeatingReferenceSource Class   See Also |

The dimension count of the repeating reference array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public int DimensionCount { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property DimensionCount As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int DimensionCount { 	int get (); } ``` |

# See Also

RepeatingReferenceSource Class

Autodesk.Revit.DB Namespace

#### GetActiveServerId Method

---

|  |
| --- |
| SingleServerService Class   See Also |

Returns the Id of the currently active application-level server of the service.

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public Guid GetActiveServerId() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetActiveServerId As Guid ``` |

| Visual C++ |
| --- |
| ``` public: Guid GetActiveServerId() ``` |

#### Return Value

The GUID of the active server, or an invalid GUID if there is no active server assigned.

# See Also

SingleServerService Class

GetActiveServerId Overload

Autodesk.Revit.DB.ExternalService Namespace

#### GetBoundingElementFace Method

---

|  |
| --- |
| SpatialElementBoundarySubface Class   See Also |

Returns the face of the bounding element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public Face GetBoundingElementFace() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetBoundingElementFace As Face ``` |

| Visual C++ |
| --- |
| ``` public: Face^ GetBoundingElementFace() ``` |

#### Return Value

The face of the bounding element.

# Remarks

Applies only if the options chosen for the extraction of the element's geometry is Finish. Faces do not contain voids in room-bounding elements (such the voids in walls created by doors and windows).

# See Also

SpatialElementBoundarySubface Class

Autodesk.Revit.DB Namespace

#### GetItalicStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

Returns whether  All  ,  None  or a  Mixed  of characters in the entire text are italic.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public FormatStatus GetItalicStatus() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetItalicStatus As FormatStatus ``` |

| Visual C++ |
| --- |
| ``` public: FormatStatus GetItalicStatus() ``` |

#### Return Value

The format status of italic on characters  FormatStatus  .

# Remarks

This function only returns  All  or  None  if the entire text contains one character.

# See Also

FormattedText Class

GetItalicStatus Overload

Autodesk.Revit.DB Namespace

#### HasElbow Property

---

|  |
| --- |
| SpatialElementTag Class   See Also |

Identifies if the tag's leader has an elbow point or not.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public bool HasElbow { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HasElbow As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool HasElbow { 	bool get (); } ``` |

# Remarks

Straight leaders do not have elbow points. Use  LeaderElbow  to get or set elbow point.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | There is no leader for this tag. |

# See Also

SpatialElementTag Class

Autodesk.Revit.DB Namespace

#### Append Method

---

|  |
| --- |
| SymbolicCurveArray Class   See Also |

Add the model curve to the end of the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Append( 	SymbolicCurve item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Append ( _ 	item As SymbolicCurve _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Append( 	SymbolicCurve^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB SymbolicCurve
     The model curve to be added.

# See Also

SymbolicCurveArray Class

Autodesk.Revit.DB Namespace

#### CreateEqualsRule Method (ElementId, Int32)

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

Creates a filter rule that determines whether integer values from the document equal a certain value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static FilterRule CreateEqualsRule( 	ElementId parameter, 	int value ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateEqualsRule ( _ 	parameter As ElementId, _ 	value As Integer _ ) As FilterRule ``` |

| Visual C++ |
| --- |
| ``` public: static FilterRule^ CreateEqualsRule( 	ElementId^ parameter,  	int value ) ``` |

#### Parameters

parameter
:   Type:  Autodesk.Revit.DB ElementId
     An integer-typed parameter used to get values from the document for a given element.

value
:   Type:  System Int32
     The user-supplied value against which values from the document will be compared.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterFilterRuleFactory Class

CreateEqualsRule Overload

Autodesk.Revit.DB Namespace

#### MaterialParamShininess Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Shininess"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MaterialParamShininess { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MaterialParamShininess As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MaterialParamShininess { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### UserAssignability Property

---

|  |
| --- |
| DirectShapeType Class   See Also |

An option controlling the ability of DirectShapes to assign this DirectShapeType as its type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public DirectShapeTypeUserAssignability UserAssignability { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property UserAssignability As DirectShapeTypeUserAssignability 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property DirectShapeTypeUserAssignability UserAssignability { 	DirectShapeTypeUserAssignability get (); 	void set (DirectShapeTypeUserAssignability value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

DirectShapeType Class

Autodesk.Revit.DB Namespace

#### CanBeDuplicated Method

---

|  |
| --- |
| ViewSheet Class   See Also |

Identifies if this sheet can be duplicated.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public bool CanBeDuplicated( 	SheetDuplicateOption duplicateOption ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CanBeDuplicated ( _ 	duplicateOption As SheetDuplicateOption _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanBeDuplicated( 	SheetDuplicateOption duplicateOption ) ``` |

#### Parameters

duplicateOption
:   Type:  Autodesk.Revit.DB SheetDuplicateOption
     The option to use when duplicating the sheet.

#### Return Value

True if the sheet can be duplicated, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ViewSheet Class

Autodesk.Revit.DB Namespace

#### Position Property

---

|  |
| --- |
| ProgressChangedEventArgs Class   See Also |

Progress bar position - value is always between zero and upperRange and is incremented by one with each event of stage "PositionChanged"

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public int Position { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Position As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int Position { 	int get (); } ``` |

# See Also

ProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### KNPerMSup3 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol kN/mÂ³, indicating unit Kilonewtons per cubic meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KNPerMSup3 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KNPerMSup3 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KNPerMSup3 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### FolderPath Property

---

|  |
| --- |
| ExternalResourceBrowserData Class   See Also |

The current folder path to which the new resources and subfolder belong.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public string FolderPath { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property FolderPath As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ FolderPath { 	String^ get (); } ``` |

# See Also

ExternalResourceBrowserData Class

Autodesk.Revit.DB Namespace

#### ModelText Class

---

|  |
| --- |
| Members   See Also |

A model text element in an Autodesk Revit family document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class ModelText : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class ModelText _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class ModelText : public Element ``` |

# Remarks

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ModelText

# See Also

ModelText Members

Autodesk.Revit.DB Namespace

#### AnalyzeAs Enumeration

---

|  |
| --- |
| See Also |

Analyze As has various functions within the Analytical Model, and is Element-dependent. "Not for Analysis" usually means that there will not be an Analytical Model generated. The others indicate how the Analytical Model behavior will treat the Element in question. For instance "Hanger" columns have different support expectations than "Gravity" columns.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum AnalyzeAs ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AnalyzeAs ``` |

| Visual C++ |
| --- |
| ``` public enum class AnalyzeAs ``` |

# Members

| Member name | Description |
| --- | --- |
| Hanger | A hanging Element. |
| Gravity | Interpreted as Gravity (support going down). |
| Lateral | Interpreted as Lateral (support going across). |
| SlabOneWay | Floor interpreted as Slab One-Way. |
| Mat | Floor interpreted as Mat Foundation, or general foundation. |
| SlabOnGrade | Floor interpreted as Slab on a Grade. |
| NotForAnalysis | Element is not for Analysis. |
| NotApplicable | Analyze As is not applicable. |
| SlabTwoWay | Floor interpreted as Slab Two-Way. |
| GravityLateral | Wall interpreted as Gravity and Lateral |

# See Also

Autodesk.Revit.DB.Structure Namespace

#### CannotSplitOldMullions Property

---

|  |
| --- |
| BuiltInFailures CurtainWallFailures Class   See Also |

Split does not work on curtain walls containing mullions created in Revit prior to version 4.0. You may delete the mullions, place them again, and then proceed with splitting the wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotSplitOldMullions { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotSplitOldMullions As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotSplitOldMullions { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainWallFailures Class

Autodesk.Revit.DB Namespace

#### OverallLegend Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Overall Legend"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId OverallLegend { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property OverallLegend As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ OverallLegend { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### HookAngleMatchesRebarShapeDefinition Method

---

|  |
| --- |
| Rebar Class   See Also |

Checks that the hook angle of the specified RebarHookType matches the hook angle used in the Rebar's RebarShape at the specified end of the bar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool HookAngleMatchesRebarShapeDefinition( 	int iEnd, 	ElementId proposedHookId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function HookAngleMatchesRebarShapeDefinition ( _ 	iEnd As Integer, _ 	proposedHookId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool HookAngleMatchesRebarShapeDefinition( 	int iEnd,  	ElementId^ proposedHookId ) ``` |

#### Parameters

iEnd
:   Type:  System Int32
     0 for the start hook, 1 for the end hook.

proposedHookId
:   Type:  Autodesk.Revit.DB ElementId
     The Id of the RebarHookType

#### Return Value

Returns true if the hook angle of the RebarHookType matches the angle used in the RebarShape at the specified end of the bar.

# Remarks

Also checks that the specified id is a valid RebarHookType. If RebarShapeDefinesHooks property of ReinforcementSettings is false (European shapes), every valid hook angle matches RebarShape definition. If RebarShapeDefinesHooks property of ReinforcementSettings is true (non-European shapes), hook angle matches RebarShape definition if it is null or equal RebarShape default hook angle.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | iEnd must be 0 or 1. |

# See Also

Rebar Class

Autodesk.Revit.DB.Structure Namespace

#### SpacingNumDivisionsn2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Number"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpacingNumDivisionsn2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpacingNumDivisionsn2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpacingNumDivisionsn2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LevelDataVolume Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Floor Volume"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LevelDataVolume { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LevelDataVolume As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LevelDataVolume { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetFailedViewElementIds Method

---

|  |
| --- |
| DocumentPrintedEventArgs Class   See Also |

Returns ElementIds of the views that that failed to print (if any).

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public IList<ElementId> GetFailedViewElementIds() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFailedViewElementIds As IList(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: IList<ElementId^>^ GetFailedViewElementIds() ``` |

#### Return Value

ElementIds of the views that that failed to print (if any).

# See Also

DocumentPrintedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### ThermalProperties Property

---

|  |
| --- |
| BuildingPadType Class   See Also |

The calculated and settable thermal properties of the BuildingPadType

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ThermalProperties ThermalProperties { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ThermalProperties As ThermalProperties 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ThermalProperties^ ThermalProperties { 	ThermalProperties^ get (); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | the building pad does not have thermal properties. |

# See Also

BuildingPadType Class

Autodesk.Revit.DB Namespace

#### GroundPlane Property

---

|  |
| --- |
| EnergyDataSettings Class   See Also |

Id of level which represents ground level.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ElementId GroundPlane { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property GroundPlane As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ GroundPlane { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Remarks

The ground plane defines what is above and below ground for Conceptual Energy Analysis. The ground plane can optionally used for the rendering cast shadows.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The input element is not a level or invalidElementId. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### ResetToposurfacePhaseCreated Property

---

|  |
| --- |
| BuiltInFailures SiteFailures Class   See Also |

The parameter Phase Created of the Toposurface is not set to the first Phase. No pre-existing toposurface were detected. The parameter will be reset to the first Phase unless Keep Phase Created option is picked.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ResetToposurfacePhaseCreated { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ResetToposurfacePhaseCreated As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ResetToposurfacePhaseCreated { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SiteFailures Class

Autodesk.Revit.DB Namespace

#### StructuralSectionCProfile Constructor

---

|  |
| --- |
| StructuralSectionCProfile Class   See Also |

Creates a new instance of Structural Section C Profile shape with the associated set of parameters, used to attach to structural element.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public StructuralSectionCProfile( 	double width, 	double height, 	double wallNominalThickness, 	double wallDesignThickness, 	double innerFillet, 	double centroidHorizontal, 	double centroidVertical, 	double principalAxesAngle, 	double sectionArea, 	double perimeter, 	double nominalWeight, 	double momentOfInertiaStrongAxis, 	double momentOfInertiaWeakAxis, 	double elasticModulusStrongAxis, 	double elasticModulusWeakAxis, 	double plasticModulusStrongAxis, 	double plasticModulusWeakAxis, 	double torsionalMomentOfInertia, 	double torsionalModulus, 	double warpingConstant, 	double shearAreaStrongAxis, 	double shearAreaWeakAxis ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	width As Double, _ 	height As Double, _ 	wallNominalThickness As Double, _ 	wallDesignThickness As Double, _ 	innerFillet As Double, _ 	centroidHorizontal As Double, _ 	centroidVertical As Double, _ 	principalAxesAngle As Double, _ 	sectionArea As Double, _ 	perimeter As Double, _ 	nominalWeight As Double, _ 	momentOfInertiaStrongAxis As Double, _ 	momentOfInertiaWeakAxis As Double, _ 	elasticModulusStrongAxis As Double, _ 	elasticModulusWeakAxis As Double, _ 	plasticModulusStrongAxis As Double, _ 	plasticModulusWeakAxis As Double, _ 	torsionalMomentOfInertia As Double, _ 	torsionalModulus As Double, _ 	warpingConstant As Double, _ 	shearAreaStrongAxis As Double, _ 	shearAreaWeakAxis As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: StructuralSectionCProfile( 	double width,  	double height,  	double wallNominalThickness,  	double wallDesignThickness,  	double innerFillet,  	double centroidHorizontal,  	double centroidVertical,  	double principalAxesAngle,  	double sectionArea,  	double perimeter,  	double nominalWeight,  	double momentOfInertiaStrongAxis,  	double momentOfInertiaWeakAxis,  	double elasticModulusStrongAxis,  	double elasticModulusWeakAxis,  	double plasticModulusStrongAxis,  	double plasticModulusWeakAxis,  	double torsionalMomentOfInertia,  	double torsionalModulus,  	double warpingConstant,  	double shearAreaStrongAxis,  	double shearAreaWeakAxis ) ``` |

#### Parameters

width
:   Type:  System Double
     Section width.

height
:   Type:  System Double
     Section height, depth.

wallNominalThickness
:   Type:  System Double
     Represents wall nominal thickness of rectangle.

wallDesignThickness
:   Type:  System Double
     Represents wall design thickness of rectangle.

innerFillet
:   Type:  System Double
     Inner Fillet - Corner fillet inner radius.

centroidHorizontal
:   Type:  System Double
     Distance from centroid to the left extremites along horizontal axis.

centroidVertical
:   Type:  System Double
     Distance from centroid to the upper extremites along vertical axis.

principalAxesAngle
:   Type:  System Double
     Rotation angle between the principal axes and cross section reference planes.

sectionArea
:   Type:  System Double
     Cross section area.

perimeter
:   Type:  System Double
     Painting surface of the unit length.

nominalWeight
:   Type:  System Double
     Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.

momentOfInertiaStrongAxis
:   Type:  System Double
     Moment of Inertia about main strong axis (I).

momentOfInertiaWeakAxis
:   Type:  System Double
     Moment of Inertia about main weak axis (I).

elasticModulusStrongAxis
:   Type:  System Double
     Elastic section modulus about main strong axis for calculation of bending stresses.

elasticModulusWeakAxis
:   Type:  System Double
     Elastic section modulus about main weak axis for calculation of bending stresses.

plasticModulusStrongAxis
:   Type:  System Double
     Plastic section modulus in bending about main strong axis (Z, Wpl)

plasticModulusWeakAxis
:   Type:  System Double
     Plastic section modulus in bending about main weak axis.

torsionalMomentOfInertia
:   Type:  System Double
     Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation

torsionalModulus
:   Type:  System Double
     Section modulus for calculations of torsion stresses (Ct)

warpingConstant
:   Type:  System Double
     Warping constant (Cw, Iomega, H)

shearAreaStrongAxis
:   Type:  System Double
     Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).

shearAreaWeakAxis
:   Type:  System Double
     Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).

# See Also

StructuralSectionCProfile Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### NewCombinableElementArray Method

---

|  |
| --- |
| Application Class   See Also |

Returns an array that can hold combinable element objects.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CombinableElementArray NewCombinableElementArray() ``` |

| Visual Basic |
| --- |
| ``` Public Function NewCombinableElementArray As CombinableElementArray ``` |

| Visual C++ |
| --- |
| ``` public: CombinableElementArray^ NewCombinableElementArray() ``` |

#### Return Value

An empty array that can contain any CombinableElement derived objects.

# See Also

Application Class

Autodesk.Revit.Creation Namespace

#### GetPlainText Method (TextRange)

---

|  |
| --- |
| FormattedText Class   See Also |

Returns a substring of the text in a plain text form. The start and end of the substring is identified by a given  TextRange  .

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public string GetPlainText( 	TextRange textRange ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPlainText ( _ 	textRange As TextRange _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetPlainText( 	TextRange^ textRange ) ``` |

#### Parameters

textRange
:   Type:  Autodesk.Revit.DB TextRange
     The given  TextRange  .

#### Return Value

The substring of the text in a plain text form.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This start index of this text range is not within the text range identifying the entire text. -or- The end of this text range is not within the text range identifying the entire text. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FormattedText Class

GetPlainText Overload

Autodesk.Revit.DB Namespace

#### CreateGreaterRule Method (ElementId, String)

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

Creates a filter rule that determines whether strings from the document are greater than a certain value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public static FilterRule CreateGreaterRule( 	ElementId parameter, 	string value ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateGreaterRule ( _ 	parameter As ElementId, _ 	value As String _ ) As FilterRule ``` |

| Visual C++ |
| --- |
| ``` public: static FilterRule^ CreateGreaterRule( 	ElementId^ parameter,  	String^ value ) ``` |

#### Parameters

parameter
:   Type:  Autodesk.Revit.DB ElementId
     A string-typed parameter used to get values from the document for a given element.

value
:   Type:  System String
     The user-supplied string value against which values from the document will be compared.

#### Return Value

Created filter rule object.

# Remarks

For strings, a value is "greater" than another if it would appear after the other in an alphabetically-sorted list.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterFilterRuleFactory Class

CreateGreaterRule Overload

Autodesk.Revit.DB Namespace

#### RbsFamilyContentSecondaryDistribsys Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Secondary Distribution System"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsFamilyContentSecondaryDistribsys { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsFamilyContentSecondaryDistribsys As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsFamilyContentSecondaryDistribsys { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### WireTypeSetIterator Class

---

|  |
| --- |
| Members   See Also |

An iterator to a wire type set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public abstract class WireTypeSetIterator : APIObject,  	IEnumerator ``` |

| Visual Basic |
| --- |
| ``` Public MustInherit Class WireTypeSetIterator _ 	Inherits APIObject _ 	Implements IEnumerator ``` |

| Visual C++ |
| --- |
| ``` public ref class WireTypeSetIterator abstract : public APIObject,  	IEnumerator ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB.Electrical WireTypeSetIterator

# See Also

WireTypeSetIterator Members

Autodesk.Revit.DB.Electrical Namespace

#### Dispose Method

---

|  |
| --- |
| FabricationAncillaryUsage Class   See Also |

Releases all resources used by the  FabricationAncillaryUsage

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

FabricationAncillaryUsage Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.SpanDirectionSymbolFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about SpanDirectionSymbol.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class SpanDirectionSymbolFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class SpanDirectionSymbolFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class SpanDirectionSymbolFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures SpanDirectionSymbolFailures

# See Also

BuiltInFailures SpanDirectionSymbolFailures Members

Autodesk.Revit.DB Namespace

#### FbxLightSurfaceLoss Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Surface Depreciation Loss"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FbxLightSurfaceLoss { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FbxLightSurfaceLoss As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FbxLightSurfaceLoss { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotKeepJoined Property

---

|  |
| --- |
| BuiltInFailures JoinElementsFailures Class   See Also |

Can't keep elements joined.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotKeepJoined { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotKeepJoined As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotKeepJoined { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures JoinElementsFailures Class

Autodesk.Revit.DB Namespace

#### SetLayer Method

---

|  |
| --- |
| CompoundStructure Class   See Also |

Sets a single layer for this CompoundStructure.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetLayer( 	int layerIdx, 	CompoundStructureLayer layer ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetLayer ( _ 	layerIdx As Integer, _ 	layer As CompoundStructureLayer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetLayer( 	int layerIdx,  	CompoundStructureLayer^ layer ) ``` |

#### Parameters

layerIdx
:   Type:  System Int32
     The index of a layer. This should range from 0 to the number of layers - 1.

layer
:   Type:  Autodesk.Revit.DB CompoundStructureLayer
     The layer to be set.

# Remarks

This function does not support addition of new layers, use SetLayers() to change the number of layers.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The layer is not valid for this operation. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The layer index is out of range. |
| Autodesk.Revit.Exceptions InvalidOperationException | This operation is valid only for non-vertically compound structures. |

# See Also

CompoundStructure Class

Autodesk.Revit.DB Namespace

#### ExportScope Property

---

|  |
| --- |
| NavisworksExportOptions Class   See Also |

Options which specifies the export scope of Navisworks Exporter. Default value is Model.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public NavisworksExportScope ExportScope { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ExportScope As NavisworksExportScope 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property NavisworksExportScope ExportScope { 	NavisworksExportScope get (); 	void set (NavisworksExportScope value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

NavisworksExportOptions Class

Autodesk.Revit.DB Namespace

#### PointLightShape Constructor (PointLightShape)

---

|  |
| --- |
| PointLightShape Class   See Also |

Creates a copy of the given point light shape

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public PointLightShape( 	PointLightShape other ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	other As PointLightShape _ ) ``` |

| Visual C++ |
| --- |
| ``` public: PointLightShape( 	PointLightShape^ other ) ``` |

#### Parameters

other
:   Type:  Autodesk.Revit.DB.Lighting PointLightShape

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PointLightShape Class

PointLightShape Overload

Autodesk.Revit.DB.Lighting Namespace

#### Cities Property

---

|  |
| --- |
| ControlledApplication Class   See Also |

Returns a set of all the known city locations within Revit.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public CitySet Cities { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Cities As CitySet 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property CitySet^ Cities { 	CitySet^ get (); } ``` |

# Remarks

Each city has information about longitude, latitude etc.

# See Also

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace

#### ForwardIterator Method

---

|  |
| --- |
| GroundConductorSizeSet Class   See Also |

Retrieve a forward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual GroundConductorSizeSetIterator ForwardIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ForwardIterator As GroundConductorSizeSetIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual GroundConductorSizeSetIterator^ ForwardIterator() ``` |

#### Return Value

Returns a forward moving iterator to the set.

# See Also

GroundConductorSizeSet Class

Autodesk.Revit.DB.Electrical Namespace

#### ProjectAuthor Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Author"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ProjectAuthor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ProjectAuthor As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ProjectAuthor { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IFCAggregateIterator Class

---

|  |
| --- |
| Members   See Also |

A class used to iterate individual objects in an IFCAggregate.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class IFCAggregateIterator : IEnumerator<IFCData> ``` |

| Visual Basic |
| --- |
| ``` Public Class IFCAggregateIterator _ 	Implements IEnumerator(Of IFCData) ``` |

| Visual C++ |
| --- |
| ``` public ref class IFCAggregateIterator : IEnumerator<IFCData^> ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.IFC IFCAggregateIterator

# See Also

IFCAggregateIterator Members

Autodesk.Revit.DB.IFC Namespace

#### PanelType Class

---

|  |
| --- |
| Members   See Also |

An object that represents a curtain panel type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class PanelType : FamilySymbol ``` |

| Visual Basic |
| --- |
| ``` Public Class PanelType _ 	Inherits FamilySymbol ``` |

| Visual C++ |
| --- |
| ``` public ref class PanelType : public FamilySymbol ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB InsertableObject
  Autodesk.Revit.DB FamilySymbol
  Autodesk.Revit.DB PanelType

# See Also

PanelType Members

Autodesk.Revit.DB Namespace

#### ExternallyTaggedNonBRep Constructor

---

|  |
| --- |
| ExternallyTaggedNonBRep Class   See Also |

Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with a particular GeometryObject.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public ExternallyTaggedNonBRep( 	ExternalGeometryId externalId, 	GeometryObject geometry ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	externalId As ExternalGeometryId, _ 	geometry As GeometryObject _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ExternallyTaggedNonBRep( 	ExternalGeometryId^ externalId,  	GeometryObject^ geometry ) ``` |

#### Parameters

externalId
:   Type:  Autodesk.Revit.DB ExternalGeometryId
     The Id of the input geometry object.

geometry
:   Type:  Autodesk.Revit.DB GeometryObject
     The externally tagged geometry object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | geometry cannot be used with an ExternallyTaggedGeometry. -or- geometry must not be a Solid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExternallyTaggedNonBRep Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| IFCLegacyStairOrRamp Class   See Also |

Releases all resources used by the  IFCLegacyStairOrRamp

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

IFCLegacyStairOrRamp Class

Autodesk.Revit.DB.IFC Namespace

#### Import Method (String, STLImportOptions, View)

---

|  |
| --- |
| Document Class   See Also |

Imports an STL file into the document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022.1

# Syntax

| C# |
| --- |
| ``` public ElementId Import( 	string file, 	STLImportOptions options, 	View pDBView ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Import ( _ 	file As String, _ 	options As STLImportOptions, _ 	pDBView As View _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ Import( 	String^ file,  	STLImportOptions^ options,  	View^ pDBView ) ``` |

#### Parameters

file
:   Type:  System String
     Full path of the file to import. File must exist and must be a valid STL file.

options
:   Type:  Autodesk.Revit.DB STLImportOptions
     Various import options applicable to the STL format. If    a null reference (  Nothing  in Visual Basic)  , all options will be set to their respective default values.

pDBView
:   Type:  Autodesk.Revit.DB View
     View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported file. If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.

#### Return Value

Returns the element Id of the imported instance.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Not a valid file for STL import (.stl files are valid). -or- ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view. -or- The provided view is not valid for the options provided. -or- One or more strings describing layer selection is invalid or empty. -or- The scale is not valid as a CustomScale for use during import. -or- NullOrEmpty -or- The view is not printable. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions FileArgumentNotFoundException | The given file does not exist. |
| Autodesk.Revit.Exceptions InvalidOperationException | Import is temporarily disabled. |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |
| Autodesk.Revit.Exceptions OptionalFunctionalityNotAvailableException | The STL Import/Link module is not available in the installed Revit. |

# See Also

Document Class

Import Overload

Autodesk.Revit.DB Namespace

#### RbsDuctRoutingPreferenceParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Routing Preferences"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsDuctRoutingPreferenceParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsDuctRoutingPreferenceParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsDuctRoutingPreferenceParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PointElementDriven Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Driven by Host"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PointElementDriven { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PointElementDriven As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PointElementDriven { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Size Property

---

|  |
| --- |
| DimensionSegmentArray Class   See Also |

Returns the number of objects that are in the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

DimensionSegmentArray Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| DirectContext3DHandleSettings Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

DirectContext3DHandleSettings Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### IFCExtrusionCalculatorOptions Class

---

|  |
| --- |
| Members   See Also |

This class contains the options used to calculate extrusions from Revit geometry.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class IFCExtrusionCalculatorOptions : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class IFCExtrusionCalculatorOptions _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class IFCExtrusionCalculatorOptions : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.IFC IFCExtrusionCalculatorOptions

# See Also

IFCExtrusionCalculatorOptions Members

Autodesk.Revit.DB.IFC Namespace

#### PlanViewNorth Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Orientation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PlanViewNorth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PlanViewNorth As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PlanViewNorth { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SectionDimension Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Section Dimension, in discipline Structural.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SectionDimension { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SectionDimension As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SectionDimension { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### GetCoincidentEnergyAnalyticalModelFaceReference Method

---

|  |
| --- |
| MassEnergyAnalyticalModel Class   See Also |

Returns a Reference to a Face from the same or a different MassEnergyAnalyticalModel that is coincident with the input Face.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static Reference GetCoincidentEnergyAnalyticalModelFaceReference( 	Document document, 	Reference referenceToFace ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetCoincidentEnergyAnalyticalModelFaceReference ( _ 	document As Document, _ 	referenceToFace As Reference _ ) As Reference ``` |

| Visual C++ |
| --- |
| ``` public: static Reference^ GetCoincidentEnergyAnalyticalModelFaceReference( 	Document^ document,  	Reference^ referenceToFace ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The Document.

referenceToFace
:   Type:  Autodesk.Revit.DB Reference
     A Reference to a Face of a MassEnergyAnalyticalModel.

# Remarks

The result is always a Reference to a Face. The Reference Type should report as REFERENCE\_TYPE\_SURFACE. Currently Revit improperly reports it as REFERENCE\_TYPE\_NONE.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The Reference is not a Face of a MassEnergyAnalyticalModel. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MassEnergyAnalyticalModel Class

Autodesk.Revit.DB.Analysis Namespace

#### IsEqual Method

---

|  |
| --- |
| AnalysisDisplayDiagramSettings Class   See Also |

Compares two diagram settings objects.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool IsEqual( 	AnalysisDisplayDiagramSettings other ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsEqual ( _ 	other As AnalysisDisplayDiagramSettings _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsEqual( 	AnalysisDisplayDiagramSettings^ other ) ``` |

#### Parameters

other
:   Type:  Autodesk.Revit.DB.Analysis AnalysisDisplayDiagramSettings
     Diagram settings object to compare with.

#### Return Value

True if objects are equal, false otherwise.

# See Also

AnalysisDisplayDiagramSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### GetPlaneOrigins Method

---

|  |
| --- |
| RoofComponents Class   See Also |

The plane origins of roof slabs.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public IList<XYZ> GetPlaneOrigins() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPlaneOrigins As IList(Of XYZ) ``` |

| Visual C++ |
| --- |
| ``` public: IList<XYZ^>^ GetPlaneOrigins() ``` |

#### Return Value

The origins.

# See Also

RoofComponents Class

Autodesk.Revit.DB.IFC Namespace

#### StringerCurveTooShort Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

A piece of boundary is too short to create stringer on it.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId StringerCurveTooShort { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StringerCurveTooShort As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ StringerCurveTooShort { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### CutFailureReason Enumeration

---

|  |
| --- |
| See Also |

The reason why a solid-solid cut cannot be created.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum CutFailureReason ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration CutFailureReason ``` |

| Visual C++ |
| --- |
| ``` public enum class CutFailureReason ``` |

# Members

| Member name | Description |
| --- | --- |
| CutAllowed | Yes, the cutting element can add a cut to the target element. |
| CutAlreadyExists | The cutting element has already cut the target element. |
| OppositeCutExists | The target element has already cut the cutting element. |
| CutNotAppropriateForElements | The cut is not appropriate for the two elements. |

# See Also

Autodesk.Revit.DB Namespace

#### InCanvasControlData Constructor (String)

---

|  |
| --- |
| InCanvasControlData Class   See Also |

Constructs an InCanvasControlData with specific values assigned.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public InCanvasControlData( 	string imagePath ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	imagePath As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: InCanvasControlData( 	String^ imagePath ) ``` |

#### Parameters

imagePath
:   Type:  System String
     File path with the image to be used. This must be an absolute path to a location on disk.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The file format specified by imagePath is an unsupported format - only \*.bmp files are supported. -or- The file path specified by imagePath is not absolute. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions FileArgumentNotFoundException | The file specified by imagePath doesn't exist. |

# See Also

InCanvasControlData Class

InCanvasControlData Overload

Autodesk.Revit.DB Namespace

#### GetRibbonPanels Method

---

|  |
| --- |
| ApplicationEntryPoint Class   See Also |

**Namespace:**   Autodesk.Revit.UI.Macros
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override List<RibbonPanel> GetRibbonPanels() ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Function GetRibbonPanels As List(Of RibbonPanel) ``` |

| Visual C++ |
| --- |
| ``` public: virtual List<RibbonPanel^>^ GetRibbonPanels() override ``` |

# See Also

ApplicationEntryPoint Class

GetRibbonPanels Overload

Autodesk.Revit.UI.Macros Namespace

#### CutMarkSymbolSize Property

---

|  |
| --- |
| CutMarkType Class   See Also |

The size of the cut mark symbol.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double CutMarkSymbolSize { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CutMarkSymbolSize As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double CutMarkSymbolSize { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for cutMarkSymbolSize must be greater than 0 and no more than 30000 feet. |

# See Also

CutMarkType Class

Autodesk.Revit.DB.Architecture Namespace

#### PickObjects Method (ObjectType, ISelectionFilter)

---

|  |
| --- |
| Selection Class   See Also |

Prompts the user to select multiple objects which pass a customer filter.

**Namespace:**   Autodesk.Revit.UI.Selection
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public IList<Reference> PickObjects( 	ObjectType objectType, 	ISelectionFilter selectionFilter ) ``` |

| Visual Basic |
| --- |
| ``` Public Function PickObjects ( _ 	objectType As ObjectType, _ 	selectionFilter As ISelectionFilter _ ) As IList(Of Reference) ``` |

| Visual C++ |
| --- |
| ``` public: IList<Reference^>^ PickObjects( 	ObjectType objectType,  	ISelectionFilter^ selectionFilter ) ``` |

#### Parameters

objectType
:   Type:  Autodesk.Revit.UI.Selection ObjectType
     Specifies the type of object to be selected.

selectionFilter
:   Type:  Autodesk.Revit.UI.Selection ISelectionFilter
     The selection filter.

#### Return Value

A collection of references selected by the user.

Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

# Remarks

The user will be shown "Finish" and "Cancel" buttons on the dialog bar to complete the selection operation. Uncheck the "Multiple" check-box to select single object and it will return the selected object directly.

Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view), but will not be permitted to click other items in the Revit user interface. Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.

The selection will not be automatically added to the active selection buffer.

Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | Thrown when the objectType is not a recognized value. |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the selectionFilter is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions OperationCanceledException | Thrown when the Revit user cancelled this operation. Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode. |
| Autodesk.Revit.Exceptions ForbiddenForDynamicUpdateException | Thrown if this method is called during dynamic update. |

# See Also

Selection Class

PickObjects Overload

Autodesk.Revit.UI.Selection Namespace

#### FloorAttrDefaultHeightParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Default Height above level"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FloorAttrDefaultHeightParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FloorAttrDefaultHeightParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FloorAttrDefaultHeightParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetInitialIntensity Method

---

|  |
| --- |
| LightType Class   See Also |

Return a copy of an object derived from InitialIntensity

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public InitialIntensity GetInitialIntensity() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetInitialIntensity As InitialIntensity ``` |

| Visual C++ |
| --- |
| ``` public: InitialIntensity^ GetInitialIntensity() ``` |

# See Also

LightType Class

Autodesk.Revit.DB.Lighting Namespace

#### AddParameter Method (String, ForgeTypeId, ForgeTypeId, Boolean)

---

|  |
| --- |
| FamilyManager Class   See Also |

Add a new family parameter with a given name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public FamilyParameter AddParameter( 	string parameterName, 	ForgeTypeId groupTypeId, 	ForgeTypeId specTypeId, 	bool isInstance ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AddParameter ( _ 	parameterName As String, _ 	groupTypeId As ForgeTypeId, _ 	specTypeId As ForgeTypeId, _ 	isInstance As Boolean _ ) As FamilyParameter ``` |

| Visual C++ |
| --- |
| ``` public: FamilyParameter^ AddParameter( 	String^ parameterName,  	ForgeTypeId^ groupTypeId,  	ForgeTypeId^ specTypeId,  	bool isInstance ) ``` |

#### Parameters

parameterName
:   Type:  System String
     The name of the new family parameter.

groupTypeId
:   Type:  Autodesk.Revit.DB ForgeTypeId
     The identifier of the new family parameter's parameter group.

specTypeId
:   Type:  Autodesk.Revit.DB ForgeTypeId
     The type of new family parameter.

isInstance
:   Type:  System Boolean
     Indicates if the new family parameter is instance or type.

#### Return Value

If creation was successful the new parameter is returned, otherwise an exception with failure information will be thrown.

# Remarks

This method can work even without any family type, but it cannot be assigned the value via FamilyManager.Set methods when there is no current type. To add a parameter of family type use the AddParameter overload that accepts a category instead.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input argument-"parameterName"-is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the input argument-"parameterName"-is already in use, or when the input argument -"specTypeId" is an invalid type, or the input parameter group cannot be assigned to the new parameter. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the family parameter creation failed. Or trying to add an instance parameter of image type. |

# See Also

FamilyManager Class

AddParameter Overload

Autodesk.Revit.DB Namespace

#### ElementId Constructor (Int32)

---

|  |
| --- |
| ElementId Class   See Also |

Create an ElementId handle with the given integer id.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ElementId( 	int id ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	id As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ElementId( 	int id ) ``` |

#### Parameters

id
:   Type:  System Int32
     The id.

# See Also

ElementId Class

ElementId Overload

Autodesk.Revit.DB Namespace

#### GetAllMeasurableSpecs Method

---

|  |
| --- |
| UnitUtils Class   See Also |

Gets the identifiers of all available measurable specs.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static IList<ForgeTypeId> GetAllMeasurableSpecs() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetAllMeasurableSpecs As IList(Of ForgeTypeId) ``` |

| Visual C++ |
| --- |
| ``` public: static IList<ForgeTypeId^>^ GetAllMeasurableSpecs() ``` |

#### Return Value

The spec identifiers.

# See Also

UnitUtils Class

Autodesk.Revit.DB Namespace

#### Print Method (ViewSet)

---

|  |
| --- |
| Document Class   See Also |

Prints a set of views with default view template and default print settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Print( 	ViewSet views ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Print ( _ 	views As ViewSet _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void Print( 	ViewSet^ views ) ``` |

#### Parameters

views
:   Type:  Autodesk.Revit.DB ViewSet
     The set of views which need to be printed.

# Remarks

If one view in the set can not be printed successfully then an exception will be thrown.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when printing is not allowed in the current application mode. Or when at least one view from the view set is not a printable view. |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the view set to be printed is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the view set contains a    a null reference (  Nothing  in Visual Basic)  element. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when at least one view from the view set could not be printed. |
| Autodesk.Revit.Exceptions OperationCanceledException | Thrown when print is cancelled by event handler. |

# See Also

Document Class

Print Overload

Autodesk.Revit.DB Namespace

#### ViewDisplayDepthCueing Class

---

|  |
| --- |
| Members   Example   See Also |

Represents the settings for depth cueing.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public class ViewDisplayDepthCueing : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ViewDisplayDepthCueing _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ViewDisplayDepthCueing : IDisposable ``` |

# Examples

 Copy  C#

```
private void AdjustDepthCueing(View view)
{
    if (view.CanUseDepthCueing())
    {
        using (Transaction t = new Transaction(view.Document, "Change depth cueing"))
        {
            t.Start();
            ViewDisplayDepthCueing depthCueing = view.GetDepthCueing();
            depthCueing.EnableDepthCueing = true;
            depthCueing.FadeTo = 50;    // set fade to percent
            depthCueing.SetStartEndPercentages(0, 75);
            view.SetDepthCueing(depthCueing);
            t.Commit();
        }
    }
}
```

 Copy  VB.NET

```
Private Sub AdjustDepthCueing(view As View)
    If view.CanUseDepthCueing() Then
        Using t As New Transaction(view.Document, "Change depth cueing")
            t.Start()
            Dim depthCueing As ViewDisplayDepthCueing = view.GetDepthCueing()
            depthCueing.EnableDepthCueing = True
            depthCueing.FadeTo = 50
            ' set fade to percent
            depthCueing.SetStartEndPercentages(0, 75)
            view.SetDepthCueing(depthCueing)
            t.Commit()
        End Using
    End If
End Sub
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ViewDisplayDepthCueing

# See Also

ViewDisplayDepthCueing Members

Autodesk.Revit.DB Namespace

#### BasisY Property

---

|  |
| --- |
| XYZ Class   See Also |

The basis of the Y axis.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static XYZ BasisY { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BasisY As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property XYZ^ BasisY { 	XYZ^ get (); } ``` |

# Remarks

The basis of the Y axis is the vector (0,1,0), the unit vector on the Y axis.

# See Also

XYZ Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| KeyBasedTreeEntryError Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

KeyBasedTreeEntryError Class

Autodesk.Revit.DB Namespace

#### GetSuperscriptStatus Method (TextRange)

---

|  |
| --- |
| FormattedText Class   See Also |

Returns whether  All  ,  None  or a  Mixed  set of characters in a given text range are superscripted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public FormatStatus GetSuperscriptStatus( 	TextRange textRange ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSuperscriptStatus ( _ 	textRange As TextRange _ ) As FormatStatus ``` |

| Visual C++ |
| --- |
| ``` public: FormatStatus GetSuperscriptStatus( 	TextRange^ textRange ) ``` |

#### Parameters

textRange
:   Type:  Autodesk.Revit.DB TextRange
     The given text range.

#### Return Value

The format status of superscript on characters  FormatStatus  .

# Remarks

This function only returns  All  or  None  if the text contains one character. The given text range should not be empty.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This text range is empty. -or- This start index of this text range is not within the text range identifying the entire text. -or- The end of this text range is not within the text range identifying the entire text. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FormattedText Class

GetSuperscriptStatus Overload

Autodesk.Revit.DB Namespace

#### SteelElemAnchorAssembly Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Assembly"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SteelElemAnchorAssembly { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElemAnchorAssembly As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SteelElemAnchorAssembly { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PointOnEdgeFaceIntersection Class

---

|  |
| --- |
| Members   See Also |

Define a ReferencePoint at the intersection of a referenceable edge or curve and a referenceable face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class PointOnEdgeFaceIntersection : PointElementReference ``` |

| Visual Basic |
| --- |
| ``` Public Class PointOnEdgeFaceIntersection _ 	Inherits PointElementReference ``` |

| Visual C++ |
| --- |
| ``` public ref class PointOnEdgeFaceIntersection : public PointElementReference ``` |

# Remarks

The ReferencePoint's orientation is partially constrained either to the edge (in the manner of PointOnEdge) or to the face (in the manner of PointOnFace).

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB PointElementReference
  Autodesk.Revit.DB PointOnEdgeFaceIntersection

# See Also

PointOnEdgeFaceIntersection Members

Autodesk.Revit.DB Namespace

#### RbsVelocity Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Velocity"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsVelocity { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsVelocity As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsVelocity { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### OrthogonalProjectionWidth Property

---

|  |
| --- |
| HomeCamera Class   See Also |

The width of orthogonal projection view volume.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public double OrthogonalProjectionWidth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property OrthogonalProjectionWidth As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double OrthogonalProjectionWidth { 	double get (); } ``` |

# See Also

HomeCamera Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| MacroModule Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

MacroModule Class

Autodesk.Revit.DB.Macros Namespace

#### DirectContext3DHandleSettings Constructor

---

|  |
| --- |
| DirectContext3DHandleSettings Class   See Also |

Constructs an instance of settings with default values.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public DirectContext3DHandleSettings() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: DirectContext3DHandleSettings() ``` |

# See Also

DirectContext3DHandleSettings Class

DirectContext3DHandleSettings Overload

Autodesk.Revit.DB.DirectContext3D Namespace

#### SurfaceAnisotropy Property

---

|  |
| --- |
| AdvancedMetal Class   See Also |

The property labeled "Anisotropy" from the "AdvancedMetal" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string SurfaceAnisotropy { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SurfaceAnisotropy As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ SurfaceAnisotropy { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble". This property allows a connected asset.

# See Also

AdvancedMetal Class

Autodesk.Revit.DB.Visual Namespace

#### KilogramForceMeters Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Kilogram force meters.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KilogramForceMeters { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KilogramForceMeters As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KilogramForceMeters { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### SetHookOrientation Method

---

|  |
| --- |
| RebarContainerItem Class   See Also |

Defines the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void SetHookOrientation( 	int iEnd, 	RebarHookOrientation hookOrientation ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetHookOrientation ( _ 	iEnd As Integer, _ 	hookOrientation As RebarHookOrientation _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetHookOrientation( 	int iEnd,  	RebarHookOrientation hookOrientation ) ``` |

#### Parameters

iEnd
:   Type:  System Int32
     0 for the start hook, 1 for the end hook.

hookOrientation
:   Type:  Autodesk.Revit.DB.Structure RebarHookOrientation
     Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."

# Remarks

If RebarShapeDefinesHooks property of ReinforcementSettings is true (non-European shapes), setHookOrientation method does nothing.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | iEnd must be 0 or 1. -or- A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace

#### UISaveAsOptions Class

---

|  |
| --- |
| Members   See Also |

This class contains UI options available for saving a document to disk with a new filename.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public class UISaveAsOptions : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class UISaveAsOptions _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class UISaveAsOptions : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.UI UISaveAsOptions

# See Also

UISaveAsOptions Members

Autodesk.Revit.UI Namespace

#### Definitions Constructor

---

|  |
| --- |
| Definitions Class   See Also |

Constructs an empty set of parameter definitions.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Definitions() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: Definitions() ``` |

# See Also

Definitions Class

Autodesk.Revit.DB Namespace

#### GetPartMakerMethodToDivideVolumeFW Method

---

|  |
| --- |
| PartUtils Class   See Also |

Obtains the object allowing access to the divided volume properties of the PartMaker.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static PartMakerMethodToDivideVolumes GetPartMakerMethodToDivideVolumeFW( 	PartMaker partMaker ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetPartMakerMethodToDivideVolumeFW ( _ 	partMaker As PartMaker _ ) As PartMakerMethodToDivideVolumes ``` |

| Visual C++ |
| --- |
| ``` public: static PartMakerMethodToDivideVolumes^ GetPartMakerMethodToDivideVolumeFW( 	PartMaker^ partMaker ) ``` |

#### Parameters

partMaker
:   Type:  Autodesk.Revit.DB PartMaker
     The PartMaker.

#### Return Value

The object handle. Returns    a null reference (  Nothing  in Visual Basic)  if the PartMaker does not represent divided volumes.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PartUtils Class

Autodesk.Revit.DB Namespace

#### AddRule Method (RoutingPreferenceRuleGroupType, RoutingPreferenceRule)

---

|  |
| --- |
| RoutingPreferenceManager Class   See Also |

Adds a new routing preference rule to the rule group.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void AddRule( 	RoutingPreferenceRuleGroupType groupType, 	RoutingPreferenceRule rule ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddRule ( _ 	groupType As RoutingPreferenceRuleGroupType, _ 	rule As RoutingPreferenceRule _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddRule( 	RoutingPreferenceRuleGroupType groupType,  	RoutingPreferenceRule^ rule ) ``` |

#### Parameters

groupType
:   Type:  Autodesk.Revit.DB RoutingPreferenceRuleGroupType
     The routing preference group in which the rule should be added.

rule
:   Type:  Autodesk.Revit.DB RoutingPreferenceRule
     The new rule to be added.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The rule cannot be added to the groupType. -or- Thrown if the index is out of bounds, or the rule is not valid for this group (e.g. an elbow may not be added to the junction group). |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also

RoutingPreferenceManager Class

AddRule Overload

Autodesk.Revit.DB Namespace

#### AlphanumericRevisionSettings Constructor

---

|  |
| --- |
| AlphanumericRevisionSettings Class   See Also |

Constructs an AlphanumericRevisionSettings with a simple, default sequence.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public AlphanumericRevisionSettings() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: AlphanumericRevisionSettings() ``` |

# Remarks

The default sequence contains each letter of the alphabet (may differ based on language settings).

# See Also

AlphanumericRevisionSettings Class

AlphanumericRevisionSettings Overload

Autodesk.Revit.DB Namespace

#### ClosestPointsPairBetweenTwoCurves Class

---

|  |
| --- |
| Members   See Also |

This class captures results of computation of closest points between two generic curves.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public class ClosestPointsPairBetweenTwoCurves : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ClosestPointsPairBetweenTwoCurves _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ClosestPointsPairBetweenTwoCurves : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ClosestPointsPairBetweenTwoCurves

# See Also

ClosestPointsPairBetweenTwoCurves Members

Autodesk.Revit.DB Namespace

#### AreaCreationData Class

---

|  |
| --- |
| Members   See Also |

A class which wraps the arguments of Area for batch creation

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class AreaCreationData ``` |

| Visual Basic |
| --- |
| ``` Public Class AreaCreationData ``` |

| Visual C++ |
| --- |
| ``` public ref class AreaCreationData ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.Creation AreaCreationData

# See Also

AreaCreationData Members

Autodesk.Revit.Creation Namespace

#### CapWasAddedWarning Property

---

|  |
| --- |
| BuiltInFailures GenericMEPFailures Class   See Also |

1 cap was added.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CapWasAddedWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CapWasAddedWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CapWasAddedWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GenericMEPFailures Class

Autodesk.Revit.DB Namespace

#### NewFamilyInstance Method (Face, XYZ, XYZ, FamilySymbol)

---

|  |
| --- |
| ItemFactoryBase Class   Example   See Also |

Inserts a new instance of a family onto a face of an existing element, using a location, reference direction, and a type/symbol.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FamilyInstance NewFamilyInstance( 	Face face, 	XYZ location, 	XYZ referenceDirection, 	FamilySymbol symbol ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewFamilyInstance ( _ 	face As Face, _ 	location As XYZ, _ 	referenceDirection As XYZ, _ 	symbol As FamilySymbol _ ) As FamilyInstance ``` |

| Visual C++ |
| --- |
| ``` public: FamilyInstance^ NewFamilyInstance( 	Face^ face,  	XYZ^ location,  	XYZ^ referenceDirection,  	FamilySymbol^ symbol ) ``` |

#### Parameters

face
:   Type:  Autodesk.Revit.DB Face
     A face of a geometry object.

location
:   Type:  Autodesk.Revit.DB XYZ
     Point on the face where the instance is to be placed.

referenceDirection
:   Type:  Autodesk.Revit.DB XYZ
     A vector that defines the direction of the family instance. Note that this direction defines the rotation of the instance on the face, and thus cannot be parallel to the face normal.

symbol
:   Type:  Autodesk.Revit.DB FamilySymbol
     A FamilySymbol object that represents the type of the instance that is to be inserted. Note that this symbol must represent a family whose  FamilyPlacementType  is WorkPlaneBased.

#### Return Value

An instance of the new object if creation was successful, otherwise    a null reference (  Nothing  in Visual Basic)  .

# Remarks

Use this method to insert one family instance on a face of another element, using a point on the face and a vector to define the position and direction of the new symbol.

The type/symbol that is used must be loaded into the document before this method is called. Families and their symbols can be loaded using the Document.LoadFamily or Document.LoadFamilySymbol methods.

The host object must support insertion of instances, otherwise this method will fail. If the instances fails to be created an exception may be thrown.

Some Families, such as Beams, have more than one endpoint and are inserted in the same manner as single point instances. Once inserted, these linear family instances can have their endpoints changed by using the instance's Element.Location property.

Note: if the created family instance includes nested instances, the API framework will automatically regenerate the document during this method call.

# Examples

 Copy  C#

```
void CreateLightFixtureOnWall(Autodesk.Revit.DB.Document document, Wall wall)
{
    FilteredElementCollector collector = new FilteredElementCollector(document);
    collector.OfClass(typeof(FamilySymbol)).OfCategory(BuiltInCategory.OST_LightingFixtures);
    FamilySymbol symbol = collector.FirstElement() as FamilySymbol;

    // The only way to get a Face to use with this NewFamilyInstance overload
    // is from Element.Geometry with ComputeReferences turned on
    Face face = null;
    Options geomOptions = new Options();
    geomOptions.ComputeReferences = true;
    GeometryElement wallGeom = wall.get_Geometry(geomOptions);
    foreach (GeometryObject geomObj in wallGeom)
    {
        Solid geomSolid = geomObj as Solid;
        if (null != geomSolid)
        {
            foreach (Face geomFace in geomSolid.Faces)
            {
                face = geomFace;
                break;
            }
            break;
        }
    }

    // Get the center of the wall
    BoundingBoxUV bboxUV = face.GetBoundingBox();
    UV center = (bboxUV.Max + bboxUV.Min) / 2.0;
    XYZ location = face.Evaluate(center);
    XYZ normal = face.ComputeNormal(center);
    XYZ refDir = normal.CrossProduct(XYZ.BasisZ);

    FamilyInstance instance = document.Create.NewFamilyInstance(face, location, refDir, symbol);
}
```

 Copy  VB.NET

```
Private Sub CreateLightFixtureOnWall(document As Autodesk.Revit.DB.Document, wall As Wall)
    Dim collector As New FilteredElementCollector(document)
    collector.OfClass(GetType(FamilySymbol)).OfCategory(BuiltInCategory.OST_LightingFixtures)
    Dim symbol As FamilySymbol = TryCast(collector.FirstElement(), FamilySymbol)

    ' The only way to get a Face to use with this NewFamilyInstance overload
    ' is from Element.Geometry with ComputeReferences turned on
    Dim face As Face = Nothing
    Dim geomOptions As New Options()
    geomOptions.ComputeReferences = True
    Dim wallGeom As GeometryElement = wall.Geometry(geomOptions)
    For Each geomObj As GeometryObject In wallGeom
        Dim geomSolid As Solid = TryCast(geomObj, Solid)
        If geomSolid IsNot Nothing Then
            For Each geomFace As Face In geomSolid.Faces
                face = geomFace
                Exit For
            Next
            Exit For
        End If
    Next

    ' Get the center of the wall
    Dim bboxUV As BoundingBoxUV = face.GetBoundingBox()
    Dim center As UV = (bboxUV.Max + bboxUV.Min) / 2.0
    Dim location As XYZ = face.Evaluate(center)
    Dim normal As XYZ = face.ComputeNormal(center)
    Dim refDir As XYZ = normal.CrossProduct(XYZ.BasisZ)

    Dim instance As FamilyInstance = document.Create.NewFamilyInstance(face, location, refDir, symbol)
End Sub
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when a non-optional argument was null. |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the function cannot get the Reference from the face, or, when the Family cannot be placed as line-based on an input face reference, because its FamilyPlacementType is not WorkPlaneBased |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | Thrown when reference direction is parallel to face normal at insertion point. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when Revit is unable to place the family instance. |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if The symbol is not active. |

# See Also

ItemFactoryBase Class

NewFamilyInstance Overload

Autodesk.Revit.Creation Namespace

#### ExpandedContent Property

---

|  |
| --- |
| TaskDialog Class   See Also |

ExpandedContent is hidden by default and will display at the bottom of the task dialog when the "Show details" button is pressed.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public string ExpandedContent { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ExpandedContent As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ ExpandedContent { 	String^ get (); 	void set (String^ value); } ``` |

# Remarks

If added to a dialog, a Show/Hide toggle button displays at the bottom of the task dialog. The Expanded Content is hidden by default. This area is used when even more information needs to be relayed to the user than space allows. It is rarely used, but can be used for showing technical information passed through in a variable, for example back-end error information, lists of files, etc. Variable information should always be introduced with a lead-in sentence.

# See Also

TaskDialog Class

Autodesk.Revit.UI Namespace

#### Current Property

---

|  |
| --- |
| GeomCombinationSetIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

GeomCombinationSetIterator Class

Autodesk.Revit.DB Namespace

#### FrameworkElement Property

---

|  |
| --- |
| DockablePaneProviderData Class   See Also |

The Windows Presentation Framework object containing the pane's user interface.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public FrameworkElement FrameworkElement { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FrameworkElement As FrameworkElement 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property FrameworkElement^ FrameworkElement { 	FrameworkElement^ get (); 	void set (FrameworkElement^ value); } ``` |

# Remarks

Using a System.Windows.Controls.Page is recommended. This can be null, in which case it is assumed an IFrameworkElementCreator is provided to create the element on demand.

# See Also

DockablePaneProviderData Class

Autodesk.Revit.UI Namespace

#### WallTypeDefaultTaperedInteriorInwardAngle Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Default Interior Angle"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WallTypeDefaultTaperedInteriorInwardAngle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WallTypeDefaultTaperedInteriorInwardAngle As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WallTypeDefaultTaperedInteriorInwardAngle { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### VoltageLineToLine Property

---

|  |
| --- |
| DistributionSysType Class   See Also |

Get or set line to line voltage type of distribution system type.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public VoltageType VoltageLineToLine { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property VoltageLineToLine As VoltageType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property VoltageType^ VoltageLineToLine { 	VoltageType^ get (); 	void set (VoltageType^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The voltage retrieved here is read only and actions to modify its properties it will throw an System.InvalidOperationException. |

# See Also

DistributionSysType Class

Autodesk.Revit.DB.Electrical Namespace

#### HomeCamera Constructor

---

|  |
| --- |
| HomeCamera Class   See Also |

Constructs a new copy of the input HomeCamera object.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public HomeCamera( 	HomeCamera other ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	other As HomeCamera _ ) ``` |

| Visual C++ |
| --- |
| ``` public: HomeCamera( 	HomeCamera^ other ) ``` |

#### Parameters

other
:   Type:  Autodesk.Revit.DB HomeCamera

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

HomeCamera Class

Autodesk.Revit.DB Namespace

#### ApparentLoad Property

---

|  |
| --- |
| ElectricalSystem Class   See Also |

The ApparentLoad value of the Electrical System.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public double ApparentLoad { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ApparentLoad As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double ApparentLoad { 	double get (); } ``` |

# Remarks

This property is used to retrieve the ApparentLoad value of the Electrical System.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This property only available when System Type is Power! |

# See Also

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace

#### FabricationHangerSizeNotMatch Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

The hanger size does not match the size of the host, so it can not be connected.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricationHangerSizeNotMatch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationHangerSizeNotMatch As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricationHangerSizeNotMatch { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace

#### GetEnumerator Method

---

|  |
| --- |
| VertexIndexPairArray Class   See Also |

Retrieve a forward moving iterator to the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator^ GetEnumerator() ``` |

#### Return Value

Returns a forward moving iterator to the array.

#### Implements

 IEnumerable GetEnumerator

# See Also

VertexIndexPairArray Class

Autodesk.Revit.DB Namespace

#### InvalidSlantedColumnOffsetsInNestedFamily Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

Instance of family [Family Name] can't be updated because in nested family the column's base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InvalidSlantedColumnOffsetsInNestedFamily { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InvalidSlantedColumnOffsetsInNestedFamily As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InvalidSlantedColumnOffsetsInNestedFamily { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace

#### RoomPhaseId Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Phase Id"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoomPhaseId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomPhaseId As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoomPhaseId { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IndexLine Class

---

|  |
| --- |
| Members   See Also |

A line segment primitive consisting of two indices.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public class IndexLine : IndexPrimitive ``` |

| Visual Basic |
| --- |
| ``` Public Class IndexLine _ 	Inherits IndexPrimitive ``` |

| Visual C++ |
| --- |
| ``` public ref class IndexLine : public IndexPrimitive ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.DirectContext3D IndexPrimitive
  Autodesk.Revit.DB.DirectContext3D IndexLine

# See Also

IndexLine Members

Autodesk.Revit.DB.DirectContext3D Namespace

#### RotationAngle Property

---

|  |
| --- |
| IndependentTag Class   See Also |

The rotation angle of the tag relative to its view

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public double RotationAngle { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property RotationAngle As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double RotationAngle { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: Angle can only be changed for AnyModelDirection orientation |

# See Also

IndependentTag Class

Autodesk.Revit.DB Namespace

#### PathReinEndSpanhookPrim Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"End Hook Angle Primary"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PathReinEndSpanhookPrim { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PathReinEndSpanhookPrim As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PathReinEndSpanhookPrim { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ViewActivatingEventArgs Class

---

|  |
| --- |
| Members   See Also |

The event arguments used by the ViewActivating event.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public class ViewActivatingEventArgs : RevitAPIPreDocEventArgs ``` |

| Visual Basic |
| --- |
| ``` Public Class ViewActivatingEventArgs _ 	Inherits RevitAPIPreDocEventArgs ``` |

| Visual C++ |
| --- |
| ``` public ref class ViewActivatingEventArgs : public RevitAPIPreDocEventArgs ``` |

# Inheritance Hierarchy

System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPIPreEventArgs
  Autodesk.Revit.DB.Events RevitAPIPreDocEventArgs
  Autodesk.Revit.UI.Events ViewActivatingEventArgs

# See Also

ViewActivatingEventArgs Members

Autodesk.Revit.UI.Events Namespace

#### PinnedFabricationPartNotChangeExtension Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

Failed to change extension of part.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId PinnedFabricationPartNotChangeExtension { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PinnedFabricationPartNotChangeExtension As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ PinnedFabricationPartNotChangeExtension { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace

#### CantCopyFrom2dTo3dFam Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Can't copy 2D element(s) into a 3D family.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CantCopyFrom2dTo3dFam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CantCopyFrom2dTo3dFam As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CantCopyFrom2dTo3dFam { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### UnableToMakeConnectionInDirection Property

---

|  |
| --- |
| BuiltInFailures AutoRouteFailures Class   See Also |

The application is unable to make a connection in that direction. If the connectors are pointing up, make sure that the elevations of the segments (ducts and pipes) are above them. If the connectors are pointing down, make sure that the elevations of the segments (ducts and pipes) are below them.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId UnableToMakeConnectionInDirection { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property UnableToMakeConnectionInDirection As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ UnableToMakeConnectionInDirection { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AutoRouteFailures Class

Autodesk.Revit.DB Namespace

#### IsStackedWallMember Property

---

|  |
| --- |
| Wall Class   See Also |

Identifies if the wall is a member of a stacked wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool IsStackedWallMember { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsStackedWallMember As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsStackedWallMember { 	bool get (); } ``` |

# See Also

Wall Class

Autodesk.Revit.DB Namespace

#### OpenAndActivateDocument Method (String)

---

|  |
| --- |
| UIApplication Class   See Also |

Opens and activates a Revit document.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public UIDocument OpenAndActivateDocument( 	string fileName ) ``` |

| Visual Basic |
| --- |
| ``` Public Function OpenAndActivateDocument ( _ 	fileName As String _ ) As UIDocument ``` |

| Visual C++ |
| --- |
| ``` public: UIDocument^ OpenAndActivateDocument( 	String^ fileName ) ``` |

#### Parameters

fileName
:   Type:  System String
     A full path to a revit file to be opened. The file can be either a Revit project, template, or family document.

#### Return Value

The opened document.

# Remarks

This method, if successful, changes the active document. It is not allowed to have an open transaction in the active document when calling this method. Additionally, this method may not be called from inside an event handler.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given 'fileName' is not a Revit file (a project, template, or family document). |
| Autodesk.Revit.Exceptions ArgumentNullException | If    a null reference (  Nothing  in Visual Basic)  is passed as 'fileName'. -or- A non-optional argument was null |
| Autodesk.Revit.Exceptions FileArgumentNotFoundException | The file specified by 'fileName' cannot be found. |
| Autodesk.Revit.Exceptions InvalidOperationException | * If the active document is currently modifiable. * If an API event handler is currently being executed. |
| Autodesk.Revit.Exceptions RevitServerCommunicationException | If there is any server internal error. |

# See Also

UIApplication Class

OpenAndActivateDocument Overload

Autodesk.Revit.UI Namespace

#### LayeredFraction Property

---

|  |
| --- |
| AdvancedLayered Class   See Also |

The property labeled "Fraction" from the "AdvancedLayered" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string LayeredFraction { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LayeredFraction As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ LayeredFraction { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble". This property allows a connected asset.

# See Also

AdvancedLayered Class

Autodesk.Revit.DB.Visual Namespace

#### FabricAreaLapSplicesIncorrect Property

---

|  |
| --- |
| BuiltInFailures FabricAreaFailures Class   See Also |

Fabric Area lap splice is incorrect.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricAreaLapSplicesIncorrect { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricAreaLapSplicesIncorrect As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricAreaLapSplicesIncorrect { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FabricAreaFailures Class

Autodesk.Revit.DB Namespace

#### TileLineShift Property

---

|  |
| --- |
| Tile Class   See Also |

The property labeled "Line Shift" from the "Tile" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TileLineShift { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TileLineShift As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TileLineShift { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 100".

# See Also

Tile Class

Autodesk.Revit.DB.Visual Namespace

#### AnalyticalModelBaseAlignmentMethod Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Base Alignment Method"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AnalyticalModelBaseAlignmentMethod { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticalModelBaseAlignmentMethod As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AnalyticalModelBaseAlignmentMethod { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| RoutingConditions Class   See Also |

Releases all resources used by the  RoutingConditions

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

RoutingConditions Class

Autodesk.Revit.DB Namespace

#### ForwardIterator Method

---

|  |
| --- |
| MEPBuildingConstructionSet Class   See Also |

Retrieve a forward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual MEPBuildingConstructionSetIterator ForwardIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ForwardIterator As MEPBuildingConstructionSetIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual MEPBuildingConstructionSetIterator^ ForwardIterator() ``` |

#### Return Value

Returns a forward moving iterator to the set.

# See Also

MEPBuildingConstructionSet Class

Autodesk.Revit.DB.Mechanical Namespace

#### MetalFinish Property

---

|  |
| --- |
| Metal Class   See Also |

The property labeled "Finish" from the "Metal" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string MetalFinish { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MetalFinish As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ MetalFinish { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalFinishType".

# See Also

Metal Class

Autodesk.Revit.DB.Visual Namespace

#### CustomDataExists Method

---

|  |
| --- |
| FabricationConfiguration Class   See Also |

Checks to see if the specified custom data exists.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public bool CustomDataExists( 	int customDataId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CustomDataExists ( _ 	customDataId As Integer _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CustomDataExists( 	int customDataId ) ``` |

#### Parameters

customDataId
:   Type:  System Int32
     The custom data identifier.

#### Return Value

Returns true if the custom data exists.

# See Also

FabricationConfiguration Class

Autodesk.Revit.DB Namespace

#### DuctShape Enumeration

---

|  |
| --- |
| See Also |

Enumerated type listing possible shapes for ducts.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum DuctShape ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DuctShape ``` |

| Visual C++ |
| --- |
| ``` public enum class DuctShape ``` |

# Members

| Member name | Description |
| --- | --- |
| Round | Round duct shape. |
| Rectangular | Rectangular duct shape. |
| Oval | Oval duct shape. |

# See Also

Autodesk.Revit.DB.Mechanical Namespace

#### CurveBottomLevel Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bottom Level"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CurveBottomLevel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurveBottomLevel As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CurveBottomLevel { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StairsRailingRailHeight Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Rail Height"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsRailingRailHeight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsRailingRailHeight As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsRailingRailHeight { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Size Property

---

|  |
| --- |
| WireSet Class   See Also |

Returns the number of objects that are in the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

WireSet Class

Autodesk.Revit.DB.Electrical Namespace

#### DamperExists Method

---

|  |
| --- |
| FabricationConfiguration Class   See Also |

Checks to see if the specified damper exists.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public bool DamperExists( 	int damperId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function DamperExists ( _ 	damperId As Integer _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool DamperExists( 	int damperId ) ``` |

#### Parameters

damperId
:   Type:  System Int32
     The damper identifier to check.

#### Return Value

Returns true if the damper exists.

# See Also

FabricationConfiguration Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| FilteredElementIdIterator Class   See Also |

Releases all resources used by the  FilteredElementIdIterator

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

# See Also

FilteredElementIdIterator Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| FilteredWorksetIdIterator Class   See Also |

Releases all resources used by the  FilteredWorksetIdIterator

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

# See Also

FilteredWorksetIdIterator Class

Autodesk.Revit.DB Namespace

#### IsEmpty Property

---

|  |
| --- |
| TemperatureRatingTypeSet Class   See Also |

Test to see if the set is empty.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool IsEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property IsEmpty As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property bool IsEmpty { 	bool get (); } ``` |

# Remarks

If the set is empty then True will be returned, otherwise False.

# See Also

TemperatureRatingTypeSet Class

Autodesk.Revit.DB.Electrical Namespace

#### Build Method

---

|  |
| --- |
| TessellatedShapeBuilder Class   See Also |

Builds the designated geometrical objects from the stored face sets. Stores the result in this TessellatedShapeBuilder object.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void Build() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Build ``` |

| Visual C++ |
| --- |
| ``` public: void Build() ``` |

# Remarks

The behavior of this function is affected by Target, Fallback and GStyleId properties of this TessellatedShapeBuilder object. Currently only "Solid/Abort", "AnyGeometry/Mesh" and "Mesh/Salvage" target/fallback combinations are supported. Note that this function does not erase the face sets stored in the builder. If the same builder is used to construct geometrical objects for different collections of face sets, (  Clear  ) should be called while switching from one collection to another.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Throws if data in the stored face sets are so inconsistent, that they cannot be used in their entirety, or if an attempt is made to create unacceptable geometry with too many facets. |

# See Also

TessellatedShapeBuilder Class

Autodesk.Revit.DB Namespace

#### GetOffsetForIntersectingReference Method

---

|  |
| --- |
| PartMakerMethodToDivideVolumes Class   See Also |

Gets offset for the intersecting reference.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double GetOffsetForIntersectingReference( 	ElementId intersectingReference ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetOffsetForIntersectingReference ( _ 	intersectingReference As ElementId _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetOffsetForIntersectingReference( 	ElementId^ intersectingReference ) ``` |

#### Parameters

intersectingReference
:   Type:  Autodesk.Revit.DB ElementId
     The intersecting reference to obtain offset value from.

#### Return Value

The offset for the intersecting reference

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | PartMaker does not use the specified intersecting reference. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PartMakerMethodToDivideVolumes Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ExternalResourceSubFolder Class   See Also |

Releases all resources used by the  ExternalResourceSubFolder

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ExternalResourceSubFolder Class

Autodesk.Revit.DB Namespace

#### GetLinePatternElementByName Method

---

|  |
| --- |
| LinePatternElement Class   See Also |

Retrieves the LinePatternElement by its name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static LinePatternElement GetLinePatternElementByName( 	Document document, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetLinePatternElementByName ( _ 	document As Document, _ 	name As String _ ) As LinePatternElement ``` |

| Visual C++ |
| --- |
| ``` public: static LinePatternElement^ GetLinePatternElementByName( 	Document^ document,  	String^ name ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document in which to retrieve the LinePatternElement.

name
:   Type:  System String
     The name of the LinePatternElement.

#### Return Value

The LinePatternElement.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

LinePatternElement Class

Autodesk.Revit.DB Namespace

#### PercentageGlazing Property

---

|  |
| --- |
| EnergyDataSettings Class   See Also |

Used for the conceptual energy model. The approximate percentage of the building exterior wall surfaces which are covered by windows or other glazing.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public double PercentageGlazing { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PercentageGlazing As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double PercentageGlazing { 	double get (); 	void set (double value); } ``` |

# Remarks

This value is used to automatically model these glazed openings in massing instances for the Conceptual Energy Analytical Model.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The percentage glazing value is not between 0.00 and 0.95. |

# See Also

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### AddTab Method

---

|  |
| --- |
| DisplayingOptionsDialogEventArgs Class   See Also |

Add tab to option dialog with tab name and handler information.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void AddTab( 	string newTabName, 	TabbedDialogExtension tabbedDialogExtension ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddTab ( _ 	newTabName As String, _ 	tabbedDialogExtension As TabbedDialogExtension _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddTab( 	String^ newTabName,  	TabbedDialogExtension^ tabbedDialogExtension ) ``` |

#### Parameters

newTabName
:   Type:  System String
     The new tab page name.

tabbedDialogExtension
:   Type:  Autodesk.Revit.UI TabbedDialogExtension
     The handlers information for the new tab page.

# Remarks

There is a limit to the number of options page permitted in the dialog.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the limit of pages allowed in the Options dialog will be exceeded (99). |

# See Also

DisplayingOptionsDialogEventArgs Class

Autodesk.Revit.UI.Events Namespace

#### PlaceInstance Method

---

|  |
| --- |
| AssemblyInstance Class   See Also |

Places an assembly instance of a given assembly type at the specified location.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static AssemblyInstance PlaceInstance( 	Document document, 	ElementId assemblyTypeId, 	XYZ location ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function PlaceInstance ( _ 	document As Document, _ 	assemblyTypeId As ElementId, _ 	location As XYZ _ ) As AssemblyInstance ``` |

| Visual C++ |
| --- |
| ``` public: static AssemblyInstance^ PlaceInstance( 	Document^ document,  	ElementId^ assemblyTypeId,  	XYZ^ location ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document for the new assembly instance.

assemblyTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the assembly type to be used for the instance.

location
:   Type:  Autodesk.Revit.DB XYZ
     The placement location for the instance in project coordinates.

#### Return Value

The newly created assembly instance.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

AssemblyInstance Class

Autodesk.Revit.DB Namespace

#### ConvertFaceRegionsToFacesCrashed Property

---

|  |
| --- |
| BuiltInFailures GeometryFailures Class   See Also |

Failed to replace an instance face with its face regions.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ConvertFaceRegionsToFacesCrashed { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ConvertFaceRegionsToFacesCrashed As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ConvertFaceRegionsToFacesCrashed { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GeometryFailures Class

Autodesk.Revit.DB Namespace

#### ForceVector2 Property

---

|  |
| --- |
| LineLoad Class   See Also |

The force vector applied to the end point of the line load, oriented according to OrientTo setting.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public XYZ ForceVector2 { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ForceVector2 As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ ForceVector2 { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Remarks

The default force unit is kN/m for metric, and kip/ft for imperial. Use UnitUtils class methods to convert value from or to internal units.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

LineLoad Class

Autodesk.Revit.DB.Structure Namespace

#### ServerId Property

---

|  |
| --- |
| LinkConversionData Class   See Also |

The service responsible for converting the data into a Revit file.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public Guid ServerId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ServerId As Guid 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Guid ServerId { 	Guid get (); } ``` |

# See Also

LinkConversionData Class

Autodesk.Revit.DB Namespace

#### StopOnError Property

---

|  |
| --- |
| DWFExportOptions Class   See Also |

Whether export process should stop when a view fails to export.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool StopOnError { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property StopOnError As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool StopOnError { 	bool get (); 	void set (bool value); } ``` |

# Remarks

If set to false, the export would continue until all views are processed. This option has an effect only when a set of more than one view is specified.

# See Also

DWFExportOptions Class

Autodesk.Revit.DB Namespace

#### ElementLogicalFilter Class

---

|  |
| --- |
| Members   See Also |

A filter used to logically combine two or more filters.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class ElementLogicalFilter : ElementFilter ``` |

| Visual Basic |
| --- |
| ``` Public Class ElementLogicalFilter _ 	Inherits ElementFilter ``` |

| Visual C++ |
| --- |
| ``` public ref class ElementLogicalFilter : public ElementFilter ``` |

# Remarks

The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ElementFilter
  Autodesk.Revit.DB ElementLogicalFilter
  Autodesk.Revit.DB LogicalAndFilter
  Autodesk.Revit.DB LogicalOrFilter

# See Also

ElementLogicalFilter Members

Autodesk.Revit.DB Namespace

#### RebarInternalMultiplanarDuplicate Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"INTERNAL: Multiplanar Duplicate"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarInternalMultiplanarDuplicate { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarInternalMultiplanarDuplicate As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarInternalMultiplanarDuplicate { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FlowDirection Property

---

|  |
| --- |
| PipeFittingAndAccessoryConnectorData Class   See Also |

The flow direction of this connector, In or Out.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public FlowDirectionType FlowDirection { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property FlowDirection As FlowDirectionType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property FlowDirectionType FlowDirection { 	FlowDirectionType get (); } ``` |

# See Also

PipeFittingAndAccessoryConnectorData Class

Autodesk.Revit.DB.Plumbing Namespace

#### TrussShiftedReferences Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Truss top and bottom references (chains of one or more reference lines) must overlap at least partially in the vertical direction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId TrussShiftedReferences { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TrussShiftedReferences As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ TrussShiftedReferences { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### GetMassEnergyAnalyticalModelIdForMassInstance Method

---

|  |
| --- |
| MassEnergyAnalyticalModel Class   See Also |

Get the ElementId of the MassEnergyAnalyticalModel for a mass instance.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static ElementId GetMassEnergyAnalyticalModelIdForMassInstance( 	Document document, 	ElementId massInstanceId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetMassEnergyAnalyticalModelIdForMassInstance ( _ 	document As Document, _ 	massInstanceId As ElementId _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: static ElementId^ GetMassEnergyAnalyticalModelIdForMassInstance( 	Document^ document,  	ElementId^ massInstanceId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The Document.

massInstanceId
:   Type:  Autodesk.Revit.DB ElementId
     ElementId of a mass instance.

#### Return Value

ElementId of a MassEnergyAnalyticalModel.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The ElementId massInstanceId is not a mass instance. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MassEnergyAnalyticalModel Class

Autodesk.Revit.DB.Analysis Namespace

#### Dispose Method

---

|  |
| --- |
| VertexBuffer Class   See Also |

Releases all resources used by the  VertexBuffer

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

VertexBuffer Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### StairsAttrStairsBottom Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Underside of Winder"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsAttrStairsBottom { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsAttrStairsBottom As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsAttrStairsBottom { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FieldId Property

---

|  |
| --- |
| ScheduleSortGroupField Class   See Also |

The ID of the field that the schedule will be sorted or grouped by.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ScheduleFieldId FieldId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FieldId As ScheduleFieldId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ScheduleFieldId^ FieldId { 	ScheduleFieldId^ get (); 	void set (ScheduleFieldId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ScheduleSortGroupField Class

Autodesk.Revit.DB Namespace

#### IsValidSpecificFittingAngle Method

---

|  |
| --- |
| ElectricalSetting Class   See Also |

Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidSpecificFittingAngle( 	double angle ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidSpecificFittingAngle ( _ 	angle As Double _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidSpecificFittingAngle( 	double angle ) ``` |

#### Parameters

angle
:   Type:  System Double
     The angle value (in degree).

#### Return Value

True if the given value is a valid specific fitting angle.

# See Also

ElectricalSetting Class

Autodesk.Revit.DB.Electrical Namespace

#### Resolution Property

---

|  |
| --- |
| ConnectionValidationWarning Class   See Also |

Enumeration for resolution that was applied.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public ConnectionResolution Resolution { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Resolution As ConnectionResolution 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ConnectionResolution Resolution { 	ConnectionResolution get (); } ``` |

# See Also

ConnectionValidationWarning Class

Autodesk.Revit.DB Namespace

#### SetOffset Method

---

|  |
| --- |
| PlanViewRange Class   See Also |

Set the offset value associated with a View Depth plane

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetOffset( 	PlanViewPlane planViewPlane, 	double offset ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetOffset ( _ 	planViewPlane As PlanViewPlane, _ 	offset As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetOffset( 	PlanViewPlane planViewPlane,  	double offset ) ``` |

#### Parameters

planViewPlane
:   Type:  Autodesk.Revit.DB PlanViewPlane
     View Depth plane

offset
:   Type:  System Double
     Offset value

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

PlanViewRange Class

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| KeyBasedTreeEntriesIterator Class   See Also |

Gets the item at the current position of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public virtual KeyBasedTreeEntry Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As KeyBasedTreeEntry 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property KeyBasedTreeEntry^ Current { 	KeyBasedTreeEntry^ get (); } ``` |

#### Implements

 IEnumerator T Current

# Remarks

There is no current item if the iterator has not started yet or has been done.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | There is no current item in the iterator. |

# See Also

KeyBasedTreeEntriesIterator Class

Autodesk.Revit.DB Namespace

#### ProductSpecificationDescription Property

---

|  |
| --- |
| FabricationPart Class   See Also |

The product specification description of the fabrication part.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public string ProductSpecificationDescription { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ProductSpecificationDescription As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ ProductSpecificationDescription { 	String^ get (); } ``` |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### GetRegisteredResults Method

---

|  |
| --- |
| SpatialFieldManager Class   See Also |

Returns an array of indices of all registered results

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IList<int> GetRegisteredResults() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRegisteredResults As IList(Of Integer) ``` |

| Visual C++ |
| --- |
| ``` public: IList<int>^ GetRegisteredResults() ``` |

# See Also

SpatialFieldManager Class

Autodesk.Revit.DB.Analysis Namespace

#### PlanTopologySet Constructor

---

|  |
| --- |
| PlanTopologySet Class   See Also |

Initializes a new instance of the  PlanTopologySet  class

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public PlanTopologySet() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: PlanTopologySet() ``` |

# See Also

PlanTopologySet Class

Autodesk.Revit.DB Namespace

#### SetCutForegroundPatternId Method

---

|  |
| --- |
| OverrideGraphicSettings Class   See Also |

Sets the ElementId of the cut face foreground pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public OverrideGraphicSettings SetCutForegroundPatternId( 	ElementId fillPatternId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function SetCutForegroundPatternId ( _ 	fillPatternId As ElementId _ ) As OverrideGraphicSettings ``` |

| Visual C++ |
| --- |
| ``` public: OverrideGraphicSettings^ SetCutForegroundPatternId( 	ElementId^ fillPatternId ) ``` |

#### Parameters

fillPatternId
:   Type:  Autodesk.Revit.DB ElementId
     Value of the cut face foreground fill pattern override.

#### Return Value

Reference to the changed object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

OverrideGraphicSettings Class

Autodesk.Revit.DB Namespace

#### StairsRuntypeStructuralDepth Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Structural Depth": Structural Depth

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsRuntypeStructuralDepth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsRuntypeStructuralDepth As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsRuntypeStructuralDepth { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SharedParameterApplicableRule Constructor

---

|  |
| --- |
| SharedParameterApplicableRule Class   See Also |

Constructs an instance of SharedParameterApplicableRule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public SharedParameterApplicableRule( 	string parameterName ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	parameterName As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: SharedParameterApplicableRule( 	String^ parameterName ) ``` |

#### Parameters

parameterName
:   Type:  System String
     The name of the parameter that an element must support to pass this rule.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SharedParameterApplicableRule Class

Autodesk.Revit.DB Namespace

#### MoreThanOneAxis Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

More than one axes of revolution.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId MoreThanOneAxis { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MoreThanOneAxis As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ MoreThanOneAxis { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### SpacingJustificationn2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Justification"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpacingJustificationn2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpacingJustificationn2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpacingJustificationn2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LapSplicePosition Property

---

|  |
| --- |
| FabricArea Class   See Also |

The fabric lap splice position in the fabric distribution.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public FabricLapSplicePosition LapSplicePosition { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LapSplicePosition As FabricLapSplicePosition 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property FabricLapSplicePosition LapSplicePosition { 	FabricLapSplicePosition get (); 	void set (FabricLapSplicePosition value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also

FabricArea Class

Autodesk.Revit.DB.Structure Namespace

#### FabricParamCutByHost Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Cut by Host Cover": Single Fabric Sheet is cut or not cut by the Host Cover.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricParamCutByHost { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricParamCutByHost As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricParamCutByHost { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetRefPoint Method

---

|  |
| --- |
| AreaLoad Class   See Also |

Returns the physical location of the reference point.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public XYZ GetRefPoint( 	int index ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRefPoint ( _ 	index As Integer _ ) As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: XYZ^ GetRefPoint( 	int index ) ``` |

#### Parameters

index
:   Type:  System Int32
     The index of the point to return.

# Remarks

The index should be between 0 and less than NumRefPoints.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when index is out of range. |

# See Also

AreaLoad Class

Autodesk.Revit.DB.Structure Namespace

#### GetRibbonPanels Method (Tab)

---

|  |
| --- |
| ApplicationEntryPoint Class   See Also |

**Namespace:**   Autodesk.Revit.UI.Macros
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override List<RibbonPanel> GetRibbonPanels( 	Tab tab ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Function GetRibbonPanels ( _ 	tab As Tab _ ) As List(Of RibbonPanel) ``` |

| Visual C++ |
| --- |
| ``` public: virtual List<RibbonPanel^>^ GetRibbonPanels( 	Tab tab ) override ``` |

#### Parameters

tab
:   Type:  Autodesk.Revit.UI Tab

# See Also

ApplicationEntryPoint Class

GetRibbonPanels Overload

Autodesk.Revit.UI.Macros Namespace

#### HostElementId Property

---

|  |
| --- |
| InsulationLiningBase Class   See Also |

The id of the host element for the insulation or lining element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ElementId HostElementId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HostElementId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ HostElementId { 	ElementId^ get (); } ``` |

# See Also

InsulationLiningBase Class

Autodesk.Revit.DB Namespace

#### PathReinforcementType Class

---

|  |
| --- |
| Members   See Also |

An object that specifies the type of a Structural Path Reinforcement element in Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class PathReinforcementType : ElementType ``` |

| Visual Basic |
| --- |
| ``` Public Class PathReinforcementType _ 	Inherits ElementType ``` |

| Visual C++ |
| --- |
| ``` public ref class PathReinforcementType : public ElementType ``` |

# Remarks

The clear cover settings can be accessed via this object.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB.Structure PathReinforcementType

# See Also

PathReinforcementType Members

Autodesk.Revit.DB.Structure Namespace

#### Flow Property

---

|  |
| --- |
| PipePressureDropData Class   See Also |

The flow of the pipe. Units: (ftÂ³/s).

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double Flow { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Flow As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double Flow { 	double get (); } ``` |

# See Also

PipePressureDropData Class

Autodesk.Revit.DB.Plumbing Namespace

#### Transform1D Constructor (Double, Double)

---

|  |
| --- |
| Transform1D Class   See Also |

Constructs the transformation by specifying the scale and the translation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public Transform1D( 	double scale, 	double translation ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	scale As Double, _ 	translation As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: Transform1D( 	double scale,  	double translation ) ``` |

#### Parameters

scale
:   Type:  System Double
     The scale of the transformation.

translation
:   Type:  System Double
     The translational part of the transformation.

# Remarks

1D space is tranformed according to the following formula: t --> scale\*t + translation

# See Also

Transform1D Class

Transform1D Overload

Autodesk.Revit.DB Namespace

#### CreateGreaterOrEqualRule Method (ElementId, Double, Double)

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

Creates a filter rule that determines whether double-precision values from the document are greater than or equal to a certain value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static FilterRule CreateGreaterOrEqualRule( 	ElementId parameter, 	double value, 	double epsilon ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateGreaterOrEqualRule ( _ 	parameter As ElementId, _ 	value As Double, _ 	epsilon As Double _ ) As FilterRule ``` |

| Visual C++ |
| --- |
| ``` public: static FilterRule^ CreateGreaterOrEqualRule( 	ElementId^ parameter,  	double value,  	double epsilon ) ``` |

#### Parameters

parameter
:   Type:  Autodesk.Revit.DB ElementId
     A double-typed parameter used to get values from the document for a given element.

value
:   Type:  System Double
     The user-supplied value against which values from the document will be compared.

epsilon
:   Type:  System Double
     Defines the tolerance within which two values may be considered equal.

# Remarks

Values less than the user-supplied value but within  *epsilon*  are considered equal; therefore, such values satisfy the condition.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given value for value is not finite -or- The given value for value is not a number -or- The given value for epsilon is not finite -or- The given value for epsilon is not a number |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterFilterRuleFactory Class

CreateGreaterOrEqualRule Overload

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| RebarReinforcementData Class   See Also |

Creates a new instance of RebarReinforcementData, or    a null reference (  Nothing  in Visual Basic)  if the operation fails.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static RebarReinforcementData Create( 	ElementId rebarId, 	int iEnd ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	rebarId As ElementId, _ 	iEnd As Integer _ ) As RebarReinforcementData ``` |

| Visual C++ |
| --- |
| ``` public: static RebarReinforcementData^ Create( 	ElementId^ rebarId,  	int iEnd ) ``` |

#### Parameters

rebarId
:   Type:  Autodesk.Revit.DB ElementId
     the Id of the rebar

iEnd
:   Type:  System Int32
     The end of rebar where the coupler stays. This should be 0 or 1

#### Return Value

Creates a new instance of RebarReinforcementData

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarReinforcementData Class

Autodesk.Revit.DB.Structure Namespace

#### RailStructure Property

---

|  |
| --- |
| RailingType Class   See Also |

The NonContinuousRailStructure.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public NonContinuousRailStructure RailStructure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property RailStructure As NonContinuousRailStructure 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property NonContinuousRailStructure^ RailStructure { 	NonContinuousRailStructure^ get (); } ``` |

# See Also

RailingType Class

Autodesk.Revit.DB.Architecture Namespace

#### GetPredefinedOptions Method

---

|  |
| --- |
| DGNExportOptions Class   See Also |

Returns an instance DGNExportOptions containing settings from a predefined export setup.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static DGNExportOptions GetPredefinedOptions( 	Document document, 	string setup ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetPredefinedOptions ( _ 	document As Document, _ 	setup As String _ ) As DGNExportOptions ``` |

| Visual C++ |
| --- |
| ``` public: static DGNExportOptions^ GetPredefinedOptions( 	Document^ document,  	String^ setup ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     A Revit project document to retrieve the setup from.

setup
:   Type:  System String
     The name of a predefined export setup from the specified document.

#### Return Value

An instance of predefined DGNExportOptions, or    a null reference (  Nothing  in Visual Basic)  if the name was not found.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | document is not a project document. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DGNExportOptions Class

Autodesk.Revit.DB Namespace

#### Commit Method

---

|  |
| --- |
| SubTransaction Class   See Also |

Commits all changes made to the model made during the sub-transaction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public TransactionStatus Commit() ``` |

| Visual Basic |
| --- |
| ``` Public Function Commit As TransactionStatus ``` |

| Visual C++ |
| --- |
| ``` public: TransactionStatus Commit() ``` |

#### Return Value

If finished successfully, this method returns TransactionStatus.Committed

# Remarks

The changes are not permanently committed to the document yet. They will be committed only when the active transaction is committed. If the transaction is rolled back instead, the changes committed during this sub-transaction will be discarded.

Commit can be called only when all inner sub-transactions, if any, are already finished, i.e. they were either committed or rolled back. If there is still a sub-transaction open, an attempt to commit this outer sub-transaction will cause an exception.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | A sub-transaction can only be active inside an open Transaction. -or- The sub-transaction's current status is not TransactionStatus.Started, therefore it may not be committed or rolled back. |

# See Also

SubTransaction Class

Autodesk.Revit.DB Namespace

#### FileVersion Property

---

|  |
| --- |
| ACADExportOptions Class   See Also |

ACADVersion::Default Default value is ACADVersion.Default.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ACADVersion FileVersion { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FileVersion As ACADVersion 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ACADVersion FileVersion { 	ACADVersion get (); 	void set (ACADVersion value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ACADExportOptions Class

Autodesk.Revit.DB Namespace

#### Evaluate Method (Int32, Int32)

---

|  |
| --- |
| FilterNumericRuleEvaluator Class   See Also |

Derived classes should override this method to implement the desired test.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool Evaluate( 	int lhs, 	int rhs ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Evaluate ( _ 	lhs As Integer, _ 	rhs As Integer _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool Evaluate( 	int lhs,  	int rhs ) ``` |

#### Parameters

lhs
:   Type:  System Int32
     A value from an element in the document.

rhs
:   Type:  System Int32
     The user-supplied value against which values from the document are tested.

#### Return Value

True if  *lhs*  ,  *rhs*  satisfy the condition implemented by this evaluator.

# See Also

FilterNumericRuleEvaluator Class

Evaluate Overload

Autodesk.Revit.DB Namespace

#### AssetPropertyInt64 Class

---

|  |
| --- |
| Members   See Also |

Represents a property of Int64 value.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class AssetPropertyInt64 : AssetProperty ``` |

| Visual Basic |
| --- |
| ``` Public Class AssetPropertyInt64 _ 	Inherits AssetProperty ``` |

| Visual C++ |
| --- |
| ``` public ref class AssetPropertyInt64 : public AssetProperty ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Visual AssetProperty
  Autodesk.Revit.DB.Visual AssetPropertyInt64

# See Also

AssetPropertyInt64 Members

Autodesk.Revit.DB.Visual Namespace

#### Create Method (Document, IList(CurveLoop), IList(XYZ), IList(Int32), IList(Int32), AreaLoadType)

---

|  |
| --- |
| AreaLoad Class   See Also |

Creates a new non-hosted area load within the project.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static AreaLoad Create( 	Document aDoc, 	IList<CurveLoop> loops, 	IList<XYZ> forceVectors, 	IList<int> refPointCurveIndexes, 	IList<int> refPointCurveSelectors, 	AreaLoadType symbol ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	aDoc As Document, _ 	loops As IList(Of CurveLoop), _ 	forceVectors As IList(Of XYZ), _ 	refPointCurveIndexes As IList(Of Integer), _ 	refPointCurveSelectors As IList(Of Integer), _ 	symbol As AreaLoadType _ ) As AreaLoad ``` |

| Visual C++ |
| --- |
| ``` public: static AreaLoad^ Create( 	Document^ aDoc,  	IList<CurveLoop^>^ loops,  	IList<XYZ^>^ forceVectors,  	IList<int>^ refPointCurveIndexes,  	IList<int>^ refPointCurveSelectors,  	AreaLoadType^ symbol ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     Document to which new area load will be added.

loops
:   Type:  System.Collections.Generic IList   CurveLoop
     The loops that define geometry of the area load. The curve loop collection should contains a closed loops consisting of lines.

forceVectors
:   Type:  System.Collections.Generic IList   XYZ
     The array of force vectors applied to the maximum three reference point of the area load.

refPointCurveIndexes
:   Type:  System.Collections.Generic IList   Int32
     The array of maximum three curve indexes on which reference points should be placed on.

refPointCurveSelectors
:   Type:  System.Collections.Generic IList   Int32
     The array of maximum three curve selectors (start or end points) indicating where reference points should be placed on.

symbol
:   Type:  Autodesk.Revit.DB.Structure AreaLoadType
     The symbol of the AreaLoad. Set    a null reference (  Nothing  in Visual Basic)  to use default type.

#### Return Value

If successful, returns an object of the newly created AreaLoad.    a null reference (  Nothing  in Visual Basic)  is returned if the operation fails.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when force vector is equal zero. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if type could not be set for newly created line load. |

# See Also

AreaLoad Class

Create Overload

Autodesk.Revit.DB.Structure Namespace

#### SpaceReferenceLevelParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Reference Level"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpaceReferenceLevelParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpaceReferenceLevelParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpaceReferenceLevelParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LoadMomentMz1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Mz 1"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadMomentMz1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadMomentMz1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadMomentMz1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetHookOrientationAngle Method

---

|  |
| --- |
| RebarFreeFormAccessor Class   See Also |

Get the hook orientation angle at end.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public double GetHookOrientationAngle( 	int end ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetHookOrientationAngle ( _ 	end As Integer _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetHookOrientationAngle( 	int end ) ``` |

#### Parameters

end
:   Type:  System Int32
     The end of bar. Should be 0 for start or 1 for end.

#### Return Value

The hook orientation angle at end.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | Invalid end. |

# See Also

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace

#### StructuralSection Class

---

|  |
| --- |
| Members   See Also |

The base class for StructuralSection specific classes, designed to provide common parameters and ability to differentiate between different structural section shapes.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public class StructuralSection : IEnumerable,  	IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class StructuralSection _ 	Implements IEnumerable, IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class StructuralSection : IEnumerable,  	IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSection
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionRectangular
  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionRound

# See Also

StructuralSection Members

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### AnalysisDisplayColoredSurfaceSettings Constructor

---

|  |
| --- |
| AnalysisDisplayColoredSurfaceSettings Class   See Also |

Constructs a default instance of colored surface settings.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public AnalysisDisplayColoredSurfaceSettings() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: AnalysisDisplayColoredSurfaceSettings() ``` |

# See Also

AnalysisDisplayColoredSurfaceSettings Class

AnalysisDisplayColoredSurfaceSettings Overload

Autodesk.Revit.DB.Analysis Namespace

#### BasepointLongitudeParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Lon"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BasepointLongitudeParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BasepointLongitudeParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BasepointLongitudeParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CopingColumnBeamFailure Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

The support order for a beam/column connection has been changed. When a beam is supported by a column that same beam cannot be coped by the column. The existing coping has been removed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CopingColumnBeamFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CopingColumnBeamFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CopingColumnBeamFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### ArrayLength Property

---

|  |
| --- |
| RebarContainerItem Class   See Also |

Identifies the distribution path length of rebar set.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public double ArrayLength { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ArrayLength As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double ArrayLength { 	double get (); 	void set (double value); } ``` |

#### Field Value

The distribution path length of rebar set.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: the set length arrayLength isn't acceptable. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |

# See Also

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace

#### NumberOfNormals Property

---

|  |
| --- |
| Mesh Class   See Also |

The number of normals associated with the mesh.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public int NumberOfNormals { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property NumberOfNormals As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int NumberOfNormals { 	int get (); } ``` |

# Remarks

The number is always equal either to '1', or the number of facets, or the number of points. The DistributionOfNormals property indicates how normals are distributed along the polymesh. If there is only one normal available, it applies to the entire mesh. Curved surfaces have normal vectors associated with either every facet or every point/vertex of the tessellated polymesh.

# See Also

Mesh Class

Autodesk.Revit.DB Namespace

#### DPartReinfDeletedEditDivision Property

---

|  |
| --- |
| BuiltInFailures RebarSystemFailures Class   See Also |

Edits to the model will cause some Reinforcement hosted on Parts to be deleted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DPartReinfDeletedEditDivision { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DPartReinfDeletedEditDivision As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DPartReinfDeletedEditDivision { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarSystemFailures Class

Autodesk.Revit.DB Namespace

#### WallNominalThickness Property

---

|  |
| --- |
| StructuralSectionGeneralH Class   See Also |

Represents wall nominal thickness of rectangle.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public double WallNominalThickness { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property WallNominalThickness As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double WallNominalThickness { 	double get (); 	void set (double value); } ``` |

# Remarks

Nominal is measured real value of profile, should be thicker than designed.

# See Also

StructuralSectionGeneralH Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### Dispose Method

---

|  |
| --- |
| FabricationConnectorInfo Class   See Also |

Releases all resources used by the  FabricationConnectorInfo

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

FabricationConnectorInfo Class

Autodesk.Revit.DB Namespace

#### NurbSpline Class

---

|  |
| --- |
| Members   See Also |

A nurb spline.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class NurbSpline : Curve ``` |

| Visual Basic |
| --- |
| ``` Public Class NurbSpline _ 	Inherits Curve ``` |

| Visual C++ |
| --- |
| ``` public ref class NurbSpline : public Curve ``` |

# Remarks

The nurb spline lies in the plane defined by control point, weight,knots,degree.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB GeometryObject
  Autodesk.Revit.DB Curve
  Autodesk.Revit.DB NurbSpline

# See Also

NurbSpline Members

Autodesk.Revit.DB Namespace

#### TileVerticalCount Property

---

|  |
| --- |
| Tile Class   See Also |

The property labeled "tile\_VerticalCount" from the "Tile" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TileVerticalCount { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TileVerticalCount As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TileVerticalCount { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 100".

# See Also

Tile Class

Autodesk.Revit.DB.Visual Namespace

#### WallCrossSectionDefinition Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Cross-Section Definition"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WallCrossSectionDefinition { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WallCrossSectionDefinition As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WallCrossSectionDefinition { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### IsSolidInView Method

---

|  |
| --- |
| FabricSheet Class   See Also |

Checks if this fabric sheet is shown solidly in a 3D view.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` [ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The FabricSheet will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Fabric Reinforcement category.")] public bool IsSolidInView( 	View3D view ) ``` |

| Visual Basic |
| --- |
| ``` <ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The FabricSheet will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Fabric Reinforcement category.")> _ Public Function IsSolidInView ( _ 	view As View3D _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` [ObsoleteAttribute(L"This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The FabricSheet will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Fabric Reinforcement category.")] public: bool IsSolidInView( 	View3D^ view ) ``` |

#### Parameters

view
:   Type:  Autodesk.Revit.DB View3D
     The 3D view element

#### Return Value

True if fabric sheet is shown solidly, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InapplicableDataException | This fabric sheet doesn't have valid visibility data. |

# See Also

FabricSheet Class

Autodesk.Revit.DB.Structure Namespace

#### RbsElecPanelMcbRatingParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"MCB Rating"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecPanelMcbRatingParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecPanelMcbRatingParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecPanelMcbRatingParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SquareMetersPerSecond Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Square meters per second.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SquareMetersPerSecond { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SquareMetersPerSecond As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SquareMetersPerSecond { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### LandingType Property

---

|  |
| --- |
| StairsType Class   See Also |

The type for all landings in the stair element.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId LandingType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LandingType As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ LandingType { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The specified landingTypeId is not a valid landing type. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

StairsType Class

Autodesk.Revit.DB.Architecture Namespace

#### CannotMakeRoomsGeometry Property

---

|  |
| --- |
| BuiltInFailures RoomFailures Class   See Also |

Could not create geometry for [Room].

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotMakeRoomsGeometry { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotMakeRoomsGeometry As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotMakeRoomsGeometry { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RoomFailures Class

Autodesk.Revit.DB Namespace

#### TonOfRefrigeration Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol ton of refrigeration, indicating unit Tons of refrigeration.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TonOfRefrigeration { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TonOfRefrigeration As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TonOfRefrigeration { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### Prefix Property

---

|  |
| --- |
| DimensionEqualityLabelFormatting Class   See Also |

The prefix to include before the parameter value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public string Prefix { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Prefix As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Prefix { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

DimensionEqualityLabelFormatting Class

Autodesk.Revit.DB Namespace

#### CannotCopyDuplicates Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Can't paste duplicate types. Only non duplicate types will be pasted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCopyDuplicates { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCopyDuplicates As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCopyDuplicates { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### CwpReuseGridsSameName Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Reuse Grids with the same name"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CwpReuseGridsSameName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CwpReuseGridsSameName As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CwpReuseGridsSameName { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| UIMacroManager Class   See Also |

Releases all resources used by the  UIMacroManager

**Namespace:**   Autodesk.Revit.UI.Macros
  **Assembly:**   RevitAPIUIMacros  (in RevitAPIUIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

UIMacroManager Class

Autodesk.Revit.UI.Macros Namespace

#### ViewGraphSchedBottomLevel Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bottom Level"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewGraphSchedBottomLevel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewGraphSchedBottomLevel As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewGraphSchedBottomLevel { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PhyMaterialParamSpecies Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Species"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhyMaterialParamSpecies { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhyMaterialParamSpecies As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhyMaterialParamSpecies { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Point Property

---

|  |
| --- |
| PointLoad Class   See Also |

Returns the position of point load, measured in decimal feet.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ Point { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Point As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ Point { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Remarks

Loacation can be set only for non-hosted loads. To determine if load is hosted use  IsHosted  property.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

PointLoad Class

Autodesk.Revit.DB.Structure Namespace

#### StartTangent Property

---

|  |
| --- |
| FlexDuct Class   See Also |

Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public XYZ StartTangent { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property StartTangent As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ StartTangent { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

FlexDuct Class

Autodesk.Revit.DB.Mechanical Namespace

#### ContinuousrailBeginningTerminationAttachmentParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Extension Style"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ContinuousrailBeginningTerminationAttachmentParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ContinuousrailBeginningTerminationAttachmentParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ContinuousrailBeginningTerminationAttachmentParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### UnloadServices Method

---

|  |
| --- |
| FabricationConfiguration Class   See Also |

Unload the specified fabrication services from the project.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void UnloadServices( 	IList<int> serviceIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub UnloadServices ( _ 	serviceIds As IList(Of Integer) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void UnloadServices( 	IList<int>^ serviceIds ) ``` |

#### Parameters

serviceIds
:   Type:  System.Collections.Generic IList   Int32
     The ids of the fabrication services to unload.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Fabrication services can not be unloaded if they are in use currently. -or- Some services are not loaded yet. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The current fabrication configuration is not connected and updated to source configuration. Reload and try again. |

# See Also

FabricationConfiguration Class

Autodesk.Revit.DB Namespace

#### DoubleClickTarget Enumeration

---

|  |
| --- |
| See Also |

Elements that support double-click in Revit. Note that this is meant to cover cases where the element itself is a double-click target. Individual controls that are targets are handled separately.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public enum DoubleClickTarget ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DoubleClickTarget ``` |

| Visual C++ |
| --- |
| ``` public enum class DoubleClickTarget ``` |

# Members

| Member name | Description |
| --- | --- |
| Family | Family instances |
| SketchedElement | Sketch-based elements |
| ViewOnSheet | Views on sheets |
| Assembly | Assemblies |
| Group | Groups |
| ComponentStairs | Component-based stairs |
| OutsideViewOnSheet | Outside active view on sheet |

# See Also

Autodesk.Revit.UI Namespace

#### StructuralWallProjectionSurface Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Horizontal Projection"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralWallProjectionSurface { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralWallProjectionSurface As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralWallProjectionSurface { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Origin Property

---

|  |
| --- |
| Plane Class   See Also |

Plane origin.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public XYZ Origin { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Origin As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ Origin { 	XYZ^ get (); } ``` |

# See Also

Plane Class

Autodesk.Revit.DB Namespace

#### Combine Property

---

|  |
| --- |
| PDFExportOptions Class   See Also |

Whether export all views and sheets into one PDF file or multiple files.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public bool Combine { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Combine As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool Combine { 	bool get (); 	void set (bool value); } ``` |

# Remarks

If     true  (  True  in Visual Basic)  , all exported views and sheets will be exported into one PDF file, whose file name would be specified by  FileName  . If     false  (  False  in Visual Basic)  , each exported view and sheet will have its own PDF file created, whose file name would be generated with  [!:NamingRule]  .

# See Also

PDFExportOptions Class

Autodesk.Revit.DB Namespace

#### IsModifiable Property

---

|  |
| --- |
| Element Class   See Also |

Identifies if the element is modifiable.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public bool IsModifiable { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsModifiable As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsModifiable { 	bool get (); } ``` |

# Remarks

This is not a permanent state. The value depends on the document state. For example, active edit modes can make IsModifiable false for many elements.

# See Also

Element Class

Autodesk.Revit.DB Namespace

#### ConcreteFinish Property

---

|  |
| --- |
| Concrete Class   See Also |

The property labeled "Type" from the "Concrete" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string ConcreteFinish { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ConcreteFinish As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ ConcreteFinish { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteFinishType".

# See Also

Concrete Class

Autodesk.Revit.DB.Visual Namespace

#### ExtensionsOverlapWarning Property

---

|  |
| --- |
| BuiltInFailures RoomFailures Class   See Also |

Vertical Extensions on these Walls overlap. This can cause undesirable Joins. Try starting with no overlap and extend the Walls toward one another.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ExtensionsOverlapWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ExtensionsOverlapWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ExtensionsOverlapWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RoomFailures Class

Autodesk.Revit.DB Namespace

#### MicrometersPerMeterDegreeCelsius Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Micrometers per meter degree Celsius.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MicrometersPerMeterDegreeCelsius { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MicrometersPerMeterDegreeCelsius As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MicrometersPerMeterDegreeCelsius { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### ReverseIterator Method

---

|  |
| --- |
| MEPBuildingConstructionSet Class   See Also |

Retrieve a backward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual MEPBuildingConstructionSetIterator ReverseIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ReverseIterator As MEPBuildingConstructionSetIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual MEPBuildingConstructionSetIterator^ ReverseIterator() ``` |

#### Return Value

Returns a backward moving iterator to the set.

# See Also

MEPBuildingConstructionSet Class

Autodesk.Revit.DB.Mechanical Namespace

#### SATImportOptions Constructor (SATImportOptions)

---

|  |
| --- |
| SATImportOptions Class   See Also |

Constructs a new instance of SATImportOptions as a copy of the import options.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public SATImportOptions( 	SATImportOptions option ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	option As SATImportOptions _ ) ``` |

| Visual C++ |
| --- |
| ``` public: SATImportOptions( 	SATImportOptions^ option ) ``` |

#### Parameters

option
:   Type:  Autodesk.Revit.DB SATImportOptions
     The SAT options to be copied.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SATImportOptions Class

SATImportOptions Overload

Autodesk.Revit.DB Namespace

#### StartPost Property

---

|  |
| --- |
| PostPattern Class   See Also |

Accesses the object containing properties related to the start post.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public BalusterInfo StartPost { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property StartPost As BalusterInfo 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property BalusterInfo^ StartPost { 	BalusterInfo^ get (); } ``` |

# See Also

PostPattern Class

Autodesk.Revit.DB.Architecture Namespace

#### ShapeBuilder Class

---

|  |
| --- |
| Members   See Also |

The base class for geometry builder classes.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public class ShapeBuilder : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ShapeBuilder _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ShapeBuilder : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ShapeBuilder
  Autodesk.Revit.DB BRepBuilder
  Autodesk.Revit.DB TessellatedShapeBuilder
  Autodesk.Revit.DB ViewShapeBuilder
  Autodesk.Revit.DB WireframeBuilder

# See Also

ShapeBuilder Members

Autodesk.Revit.DB Namespace

#### IsElementValidIntersectingReference Method (ElementId)

---

|  |
| --- |
| PartMakerMethodToDivideVolumes Class   See Also |

Identifies if the provided member is valid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool IsElementValidIntersectingReference( 	ElementId elementId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsElementValidIntersectingReference ( _ 	elementId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsElementValidIntersectingReference( 	ElementId^ elementId ) ``` |

#### Parameters

elementId
:   Type:  Autodesk.Revit.DB ElementId
     Element ids to be tested for validity for intersecting references.

#### Return Value

True if the reference is valid, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PartMakerMethodToDivideVolumes Class

IsElementValidIntersectingReference Overload

Autodesk.Revit.DB Namespace

#### IsAXMImportLinkAvailable Method

---

|  |
| --- |
| OptionalFunctionalityUtils Class   See Also |

Checks whether the AXM Import/Link functionality is available in the installed Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022.1

# Syntax

| C# |
| --- |
| ``` public static bool IsAXMImportLinkAvailable() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsAXMImportLinkAvailable As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsAXMImportLinkAvailable() ``` |

#### Return Value

True if the AXM Import/Link functionality is available in the installed Revit.

# Remarks

AXM Import/Link is optional functionality that does not have to be part of the Revit installation.

# See Also

OptionalFunctionalityUtils Class

Autodesk.Revit.DB Namespace

#### BtuPerLbDegreeF Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol BTU/(lbÂ·Â°F), indicating unit British thermal units per pound degree Fahrenheit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BtuPerLbDegreeF { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BtuPerLbDegreeF As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BtuPerLbDegreeF { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### GetAllConnectorData Method

---

|  |
| --- |
| PipeFittingAndAccessoryData Class   See Also |

Gets the connector data of the pipe fitting or pipe accessory.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public IList<PipeFittingAndAccessoryConnectorData> GetAllConnectorData() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAllConnectorData As IList(Of PipeFittingAndAccessoryConnectorData) ``` |

| Visual C++ |
| --- |
| ``` public: IList<PipeFittingAndAccessoryConnectorData^>^ GetAllConnectorData() ``` |

#### Return Value

All connector data.

# Remarks

PipeFittingAndAccessoryConnectorData contains connector data which is needed to calculate coefficient. such as width, height, diameter and flow.

# See Also

PipeFittingAndAccessoryData Class

Autodesk.Revit.DB.Plumbing Namespace

#### PathName Property

---

|  |
| --- |
| DocumentSavingAsEventArgs Class   See Also |

Target path to which the document is to be saved.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public string PathName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property PathName As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ PathName { 	String^ get (); } ``` |

# See Also

DocumentSavingAsEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### Categories Property

---

|  |
| --- |
| Settings Class   See Also |

Retrieves an object that provides access to all the categories contained in the Autodesk Revit application and project.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Categories Categories { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Categories As Categories 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Categories^ Categories { 	Categories^ get (); } ``` |

# See Also

Settings Class

Autodesk.Revit.DB Namespace

#### ProjectRevisionRevisionIssuedTo Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Issued to"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ProjectRevisionRevisionIssuedTo { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ProjectRevisionRevisionIssuedTo As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ProjectRevisionRevisionIssuedTo { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IFCExtrusionCalculatorOptions Constructor

---

|  |
| --- |
| IFCExtrusionCalculatorOptions Class   See Also |

Constructs a new instance of a class used to calculate extrusions from Revit geometry.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IFCExtrusionCalculatorOptions( 	ExporterIFC exporterIFC, 	IFCExtrusionAxes extrusionAxes, 	XYZ customAxis, 	double scale ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	exporterIFC As ExporterIFC, _ 	extrusionAxes As IFCExtrusionAxes, _ 	customAxis As XYZ, _ 	scale As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: IFCExtrusionCalculatorOptions( 	ExporterIFC^ exporterIFC,  	IFCExtrusionAxes extrusionAxes,  	XYZ^ customAxis,  	double scale ) ``` |

#### Parameters

exporterIFC
:   Type:  Autodesk.Revit.DB.IFC ExporterIFC
     The exporter.

extrusionAxes
:   Type:  Autodesk.Revit.DB.IFC IFCExtrusionAxes
     The extrusion axes to try when doing the calculation.

customAxis
:   Type:  Autodesk.Revit.DB XYZ
     The custom axis to try (if extrusionAxes includes an option for a custom direction).

scale
:   Type:  System Double
     The scaling factor for length measurements from the default Revit units to the export units.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

IFCExtrusionCalculatorOptions Class

Autodesk.Revit.DB.IFC Namespace

#### ServerSupportsCADLinks Method

---

|  |
| --- |
| ExternalResourceServerUtils Class   See Also |

Checks that the server referenced by the given ExternalResourceReference supports CAD links.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static bool ServerSupportsCADLinks( 	ExternalResourceReference extRef ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ServerSupportsCADLinks ( _ 	extRef As ExternalResourceReference _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool ServerSupportsCADLinks( 	ExternalResourceReference^ extRef ) ``` |

#### Parameters

extRef
:   Type:  Autodesk.Revit.DB ExternalResourceReference
     The ExternalResourceReference to check.

#### Return Value

True if the ExternalResourceReference refers to a server that supports CAD links. False otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExternalResourceServerUtils Class

Autodesk.Revit.DB Namespace

#### CalculatingColor Property

---

|  |
| --- |
| ColorOptions Class   See Also |

The color used to render elements when some aspect of their properties is currently being recalculated.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public Color CalculatingColor { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CalculatingColor As Color 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Color^ CalculatingColor { 	Color^ get (); 	void set (Color^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ColorOptions Class

Autodesk.Revit.DB Namespace

#### GetRebarInSystemIds Method

---

|  |
| --- |
| PathReinforcement Class   See Also |

Returns the ids of the RebarInSystem elements owned by the PathReinforcement element.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public IList<ElementId> GetRebarInSystemIds() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRebarInSystemIds As IList(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: IList<ElementId^>^ GetRebarInSystemIds() ``` |

# Remarks

The RebarInSystem elements are only created if ReinforcementSettings.HostStructuralRebar is set to true. If that setting is false, this function returns an empty array.

# See Also

PathReinforcement Class

Autodesk.Revit.DB.Structure Namespace

#### IsValidObject Property

---

|  |
| --- |
| DirectContext3DHandleOverrides Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

DirectContext3DHandleOverrides Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### FaceEdgeNode Class

---

|  |
| --- |
| Members   See Also |

An output node that represents a Face edge.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public class FaceEdgeNode : FaceDetailNode ``` |

| Visual Basic |
| --- |
| ``` Public Class FaceEdgeNode _ 	Inherits FaceDetailNode ``` |

| Visual C++ |
| --- |
| ``` public ref class FaceEdgeNode : public FaceDetailNode ``` |

# Remarks

See also:  OnFaceEdge2D(FaceEdgeNode)  .

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB RenderNode
  Autodesk.Revit.DB FaceDetailNode
  Autodesk.Revit.DB FaceEdgeNode

# See Also

FaceEdgeNode Members

Autodesk.Revit.DB Namespace

#### TextStyleBold Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bold"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TextStyleBold { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextStyleBold As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TextStyleBold { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BackgroundStyle Property

---

|  |
| --- |
| RenderingSettings Class   See Also |

The enum value that controls the background style for rendering.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public BackgroundStyle BackgroundStyle { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BackgroundStyle As BackgroundStyle 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property BackgroundStyle BackgroundStyle { 	BackgroundStyle get (); 	void set (BackgroundStyle value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

RenderingSettings Class

Autodesk.Revit.DB Namespace

#### Grid1Offset Property

---

|  |
| --- |
| CurtainGrid Class   See Also |

The offset for the U grid line pattern of the curtain grid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double Grid1Offset { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Grid1Offset As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Grid1Offset { 	double get (); 	void set (double value); } ``` |

# See Also

CurtainGrid Class

Autodesk.Revit.DB Namespace

#### RemoveMacro Method

---

|  |
| --- |
| MacroModule Class   See Also |

Removes a macro from the module.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void RemoveMacro( 	Macro macro ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub RemoveMacro ( _ 	macro As Macro _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void RemoveMacro( 	Macro^ macro ) ``` |

#### Parameters

macro
:   Type:  Autodesk.Revit.DB.Macros Macro
     The macro will be removed from this module.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Cannot remove the Macro due to no permission. |

# See Also

MacroModule Class

Autodesk.Revit.DB.Macros Namespace

#### LineScaling Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing possible LineType scaling modes.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum LineScaling ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration LineScaling ``` |

| Visual C++ |
| --- |
| ``` public enum class LineScaling ``` |

# Members

| Member name | Description |
| --- | --- |
| ViewScale | Exporting lines as they were scaled by view scale. This option preserves visual fidelity. |
| ModelSpace | Modelspace scaling. LTSCALE is set to view scale and PSLTSCALE to 0. |
| PaperSpace | Paperspace scaling. Specifies the value 1 for both LTSCALE and PSLTSCALE. |

# Remarks

Whichever option is chosen, line type definitions are created so a dashed line always begins and ends with a dash. Using these options does change the default behavior of exported DWGs. Some lines expected to be dashed may appear solid or in a different scale.

# See Also

Autodesk.Revit.DB Namespace

#### AddModule Method

---

|  |
| --- |
| MacroManager Class   See Also |

Adds a MacroModule to the application or document.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public MacroModule AddModule( 	ModuleSettings moduleSettings ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AddModule ( _ 	moduleSettings As ModuleSettings _ ) As MacroModule ``` |

| Visual C++ |
| --- |
| ``` public: MacroModule^ AddModule( 	ModuleSettings^ moduleSettings ) ``` |

#### Parameters

moduleSettings
:   Type:  Autodesk.Revit.DB.Macros ModuleSettings
     The module settings.

#### Return Value

The new module.

# Remarks

Note: document-level modules will not be saved to the document until the document is saved. Thus this operation is not undoable and does not require an open transaction even for document-level modules.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the module name is duplicated with the existing one, or the name is too long, or the name contains invalid identifier(s), such as include "#", "%", ... and key words in C# or VB.NET. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MacroManager Class

Autodesk.Revit.DB.Macros Namespace

#### Reset Method

---

|  |
| --- |
| EdgeArrayIterator Class   See Also |

Bring the iterator back to the start of the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

#### Implements

 IEnumerator Reset

# Remarks

The Reset method will return the iterator back to the start of the array in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.

# See Also

EdgeArrayIterator Class

Autodesk.Revit.DB Namespace

#### flipFacing Method

---

|  |
| --- |
| FamilyInstance Class   See Also |

The orientation of family instance facing will be flipped. If it can not be flipped, return false, otherwise return true.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool flipFacing() ``` |

| Visual Basic |
| --- |
| ``` Public Function flipFacing As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool flipFacing() ``` |

# See Also

FamilyInstance Class

Autodesk.Revit.DB Namespace

#### GetStackedWallMemberIds Method

---

|  |
| --- |
| Wall Class   See Also |

Get the sub walls which belongs to the wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public IList<ElementId> GetStackedWallMemberIds() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetStackedWallMemberIds As IList(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: IList<ElementId^>^ GetStackedWallMemberIds() ``` |

#### Return Value

If the wall is a stacked wall, the Ids of the sub will be returned in bottom-top order.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This wall isn't a consistent stacked wall. |

# See Also

Wall Class

Autodesk.Revit.DB Namespace

#### AreCoordinatesInBounds Method

---

|  |
| --- |
| RepeaterBounds Class   See Also |

Determines whether given coordinates are within the bounds.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool AreCoordinatesInBounds( 	RepeaterCoordinates coordinates, 	bool treatCyclicalBoundsAsInfinite ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AreCoordinatesInBounds ( _ 	coordinates As RepeaterCoordinates, _ 	treatCyclicalBoundsAsInfinite As Boolean _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool AreCoordinatesInBounds( 	RepeaterCoordinates^ coordinates,  	bool treatCyclicalBoundsAsInfinite ) ``` |

#### Parameters

coordinates
:   Type:  Autodesk.Revit.DB RepeaterCoordinates
     The coordinates.

treatCyclicalBoundsAsInfinite
:   Type:  System Boolean
     True if cyclical directions should be treated as unbounded.

#### Return Value

True if the coordinates are within the bounds.

# Remarks

The coordinates must have the same number of dimensions as the bounds. This method does not apply to zero dimensional bounds.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The coordinates coordinates have incompatible number of dimensions. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The bounds must have at least one dimension. |

# See Also

RepeaterBounds Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, IList(ElementId), ElectricalSystemType)

---

|  |
| --- |
| ElectricalSystem Class   See Also |

Creates a new MEP Electrical System element from a set of electrical components.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static ElectricalSystem Create( 	Document document, 	IList<ElementId> electComponents, 	ElectricalSystemType elecSysType ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	electComponents As IList(Of ElementId), _ 	elecSysType As ElectricalSystemType _ ) As ElectricalSystem ``` |

| Visual C++ |
| --- |
| ``` public: static ElectricalSystem^ Create( 	Document^ document,  	IList<ElementId^>^ electComponents,  	ElectricalSystemType elecSysType ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The Document.

electComponents
:   Type:  System.Collections.Generic IList   ElementId
     The electrical components in this system.

elecSysType
:   Type:  Autodesk.Revit.DB.Electrical ElectricalSystemType
     The System Type of electrical system.

#### Return Value

If successful a new MEP Electrical System element within the project, otherwise    a null reference (  Nothing  in Visual Basic)  .

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | There should be at least one component that can create the specified circuit type |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also

ElectricalSystem Class

Create Overload

Autodesk.Revit.DB.Electrical Namespace

#### GetAnElement Method

---

|  |
| --- |
| IFCProductWrapper Class   See Also |

Gets the first element handle added to this wrapper.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public IFCAnyHandle GetAnElement() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAnElement As IFCAnyHandle ``` |

| Visual C++ |
| --- |
| ``` public: IFCAnyHandle^ GetAnElement() ``` |

#### Return Value

The handle.

# See Also

IFCProductWrapper Class

Autodesk.Revit.DB.IFC Namespace

#### CreateDuctConnector Method (Document, DuctSystemType, ConnectorProfileType, Reference, Edge)

---

|  |
| --- |
| ConnectorElement Class   See Also |

Create a new duct ConnectorElement.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static ConnectorElement CreateDuctConnector( 	Document document, 	DuctSystemType ductSystemType, 	ConnectorProfileType profileShape, 	Reference planarFace, 	Edge edge ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateDuctConnector ( _ 	document As Document, _ 	ductSystemType As DuctSystemType, _ 	profileShape As ConnectorProfileType, _ 	planarFace As Reference, _ 	edge As Edge _ ) As ConnectorElement ``` |

| Visual C++ |
| --- |
| ``` public: static ConnectorElement^ CreateDuctConnector( 	Document^ document,  	DuctSystemType ductSystemType,  	ConnectorProfileType profileShape,  	Reference^ planarFace,  	Edge^ edge ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document to add the connector to.

ductSystemType
:   Type:  Autodesk.Revit.DB.Mechanical DuctSystemType
     The DuctSystemType of the connector.

profileShape
:   Type:  Autodesk.Revit.DB ConnectorProfileType
     The profile shape of the duct.

planarFace
:   Type:  Autodesk.Revit.DB Reference
     The planar face to place the connector on.

edge
:   Type:  Autodesk.Revit.DB Edge
     One of the edges in the edge loop that defines the connector location on the planar face.

#### Return Value

The duct ConnectorElement.

# Remarks

Regenerates the document.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The reference is not a planar face. -or- document is not a family document. -or- Thrown when the edge does not belong to the face. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | Connector creation is not allowed in this family. |

# See Also

ConnectorElement Class

CreateDuctConnector Overload

Autodesk.Revit.DB Namespace

#### BadTreadRiserProfile Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Tread/Riser profile is invalid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BadTreadRiserProfile { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BadTreadRiserProfile As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BadTreadRiserProfile { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### PlaceOnHost Method

---

|  |
| --- |
| FabricationHostedInfo Class   See Also |

Places the part on the specified host.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void PlaceOnHost( 	ElementId hostId, 	Connector hostConnector, 	double distance ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub PlaceOnHost ( _ 	hostId As ElementId, _ 	hostConnector As Connector, _ 	distance As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void PlaceOnHost( 	ElementId^ hostId,  	Connector^ hostConnector,  	double distance ) ``` |

#### Parameters

hostId
:   Type:  Autodesk.Revit.DB ElementId
     Id of the host fabrication part.

hostConnector
:   Type:  Autodesk.Revit.DB Connector
     The connector of the host.

distance
:   Type:  System Double
     The distance from the connector to place the hosted part. Units are in feet (ft).

# Remarks

The document must be regenerated before the fabrication part can be used. Check  ValidationStatus  after regeneration to see if the part is valid for fabrication.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Invalid fabrication part host. The host should be a straight fabrication part. -or- Invalid connector of fabrication part host. -or- The distance is out of range. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FabricationHostedInfo Class

PlaceOnHost Overload

Autodesk.Revit.DB Namespace

#### SetTransactionFinalizer Method

---

|  |
| --- |
| FailureHandlingOptions Class   See Also |

Sets the callback to be executed after the transaction is completed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FailureHandlingOptions SetTransactionFinalizer( 	ITransactionFinalizer finalizer ) ``` |

| Visual Basic |
| --- |
| ``` Public Function SetTransactionFinalizer ( _ 	finalizer As ITransactionFinalizer _ ) As FailureHandlingOptions ``` |

| Visual C++ |
| --- |
| ``` public: FailureHandlingOptions^ SetTransactionFinalizer( 	ITransactionFinalizer^ finalizer ) ``` |

#### Parameters

finalizer
:   Type:  Autodesk.Revit.DB ITransactionFinalizer
     The callback to be executed after the transaction is completed.

#### Return Value

This FailureHandlingOptions object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FailureHandlingOptions Class

Autodesk.Revit.DB Namespace

#### HostForCutHasNoGeometry Property

---

|  |
| --- |
| BuiltInFailures OpeningFailures Class   See Also |

Host can't be cut because it has no geometry.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId HostForCutHasNoGeometry { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property HostForCutHasNoGeometry As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ HostForCutHasNoGeometry { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures OpeningFailures Class

Autodesk.Revit.DB Namespace

#### ApiDelayedUpdateFailed Property

---

|  |
| --- |
| BuiltInFailures DocumentFailures Class   See Also |

Delayed Updating Failed. Please contact the 3rd Party Application vendor.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ApiDelayedUpdateFailed { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ApiDelayedUpdateFailed As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ApiDelayedUpdateFailed { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DocumentFailures Class

Autodesk.Revit.DB Namespace

#### GetSchedulableFields Method

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

Gets a list of all non-calculated/non-combined fields that are eligible to be included in this schedule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public IList<SchedulableField> GetSchedulableFields() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSchedulableFields As IList(Of SchedulableField) ``` |

| Visual C++ |
| --- |
| ``` public: IList<SchedulableField^>^ GetSchedulableFields() ``` |

#### Return Value

A list of SchedulableField objects representing the non-calculated/non-combined fields that may be included in the schedule.

# See Also

ScheduleDefinition Class

Autodesk.Revit.DB Namespace

#### BraceParallelLineOffset Property

---

|  |
| --- |
| StructuralSettings Class   See Also |

The distance by which brace symbols in plan views will be offset.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public double BraceParallelLineOffset { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BraceParallelLineOffset As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double BraceParallelLineOffset { 	double get (); 	void set (double value); } ``` |

# Remarks

Applies only when BracePlanRepresentation is set to ParallelLine.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also

StructuralSettings Class

Autodesk.Revit.DB.Structure Namespace

#### NewSweep Method (Boolean, CurveArray, SketchPlane, SweepProfile, Int32, ProfilePlaneLocation)

---

|  |
| --- |
| FamilyItemFactory Class   Example   See Also |

Adds a new sweep form to the family document, using a path of curve elements.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Sweep NewSweep( 	bool isSolid, 	CurveArray path, 	SketchPlane pathPlane, 	SweepProfile profile, 	int profileLocationCurveIndex, 	ProfilePlaneLocation profilePlaneLocation ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewSweep ( _ 	isSolid As Boolean, _ 	path As CurveArray, _ 	pathPlane As SketchPlane, _ 	profile As SweepProfile, _ 	profileLocationCurveIndex As Integer, _ 	profilePlaneLocation As ProfilePlaneLocation _ ) As Sweep ``` |

| Visual C++ |
| --- |
| ``` public: Sweep^ NewSweep( 	bool isSolid,  	CurveArray^ path,  	SketchPlane^ pathPlane,  	SweepProfile^ profile,  	int profileLocationCurveIndex,  	ProfilePlaneLocation profilePlaneLocation ) ``` |

#### Parameters

isSolid
:   Type:  System Boolean
     Indicates if the Sweep is Solid or Void.

path
:   Type:  Autodesk.Revit.DB CurveArray
     The path of the sweep. The path should be 2D, where all input curves lie in one plane, and the curves are not required to reference existing geometry.

pathPlane
:   Type:  Autodesk.Revit.DB SketchPlane
     The sketch plane for the path. Use this when you want to create a 2D path that resides on an existing planar face. Optional, can be    a null reference (  Nothing  in Visual Basic)  for 3D paths or for 2D paths where the path should not reference an existing face.

profile
:   Type:  Autodesk.Revit.DB SweepProfile
     The profile of the newly created Sweep. This may contain more than one curve loop or a profile family. The profile must lie in the XY plane, and it will be transformed to the profile plane automatically. Each loop must be a fully closed curve loop and the loops must not intersect. The loop can be a unbound circle or ellipse, but its geometry will be split in two in order to satisfy requirements for sketches used in extrusions.

profileLocationCurveIndex
:   Type:  System Int32
     The index of the path curves. The curve upon which the profile plane will be determined.

profilePlaneLocation
:   Type:  Autodesk.Revit.DB ProfilePlaneLocation
     The location on the profileLocationCurve where the profile plane will be determined.

#### Return Value

If creation was successful the new Sweep is returned, otherwise an exception with failure information will be thrown.

# Remarks

This method creates a sweep in a family document. The sweep will trace the profile along the path.

# Examples

 Copy  C#

```
private Sweep CreateSweep(Autodesk.Revit.DB.Document document, SketchPlane sketchPlane)
{
    Sweep sweep = null;

    // make sure we have a family document
    if (true == document.IsFamilyDocument)
    {
        // Define a profile for the sweep
        CurveArrArray arrarr = new CurveArrArray();
        CurveArray arr = new CurveArray();

        // Create an ovoid profile
        XYZ pnt1 = new XYZ(0, 0, 0);
        XYZ pnt2 = new XYZ(2, 0, 0);
        XYZ pnt3 = new XYZ(1, 1, 0);
        arr.Append(Arc.Create(pnt2, 1.0d, 0.0d, 180.0d, XYZ.BasisX, XYZ.BasisY));
        arr.Append(Arc.Create(pnt1, pnt3, pnt2));
        arrarr.Append(arr);
        SweepProfile profile = document.Application.Create.NewCurveLoopsProfile(arrarr);

        // Create a path for the sweep
        XYZ pnt4 = new XYZ(10, 0, 0);
        XYZ pnt5 = new XYZ(0, 10, 0);
        Curve curve = Line.CreateBound(pnt4, pnt5);

        CurveArray curves = new CurveArray();
        curves.Append(curve);

        // create a solid ovoid sweep
        sweep = document.FamilyCreate.NewSweep(true, curves, sketchPlane, profile, 0, ProfilePlaneLocation.Start);

        if (null != sweep)
        {
            // move to proper place
            XYZ transPoint1 = new XYZ(11, 0, 0);
            ElementTransformUtils.MoveElement(document, sweep.Id, transPoint1);
        }
        else
        {
            throw new Exception("Failed to create a new Sweep.");
        }
    }
    else
    {
        throw new Exception("Please open a Family document before invoking this command.");
    }

    return sweep;
}
```

 Copy  VB.NET

```
Private Function CreateSweep(document As Autodesk.Revit.DB.Document, sketchPlane As SketchPlane) As Sweep
    Dim sweep As Sweep = Nothing

    ' make sure we have a family document
    If True = document.IsFamilyDocument Then
        ' Define a profile for the sweep
        Dim arrarr As New CurveArrArray()
        Dim arr As New CurveArray()

        ' Create an ovoid profile
        Dim pnt1 As New XYZ(0, 0, 0)
        Dim pnt2 As New XYZ(2, 0, 0)
        Dim pnt3 As New XYZ(1, 1, 0)
        arr.Append(Arc.Create(pnt2, 1.0, 0.0, 180.0, XYZ.BasisX, XYZ.BasisY))
        arr.Append(Arc.Create(pnt1, pnt3, pnt2))
        arrarr.Append(arr)
        Dim profile As SweepProfile = document.Application.Create.NewCurveLoopsProfile(arrarr)

        ' Create a path for the sweep
        Dim pnt4 As New XYZ(10, 0, 0)
        Dim pnt5 As New XYZ(0, 10, 0)
        Dim curve As Curve = Line.CreateBound(pnt4, pnt5)

        Dim curves As New CurveArray()
        curves.Append(curve)

        ' create a solid ovoid sweep
        sweep = document.FamilyCreate.NewSweep(True, curves, sketchPlane, profile, 0, ProfilePlaneLocation.Start)

        If sweep IsNot Nothing Then
            ' move to proper place
            Dim transPoint1 As New XYZ(11, 0, 0)
            ElementTransformUtils.MoveElement(document, sweep.Id, transPoint1)
        Else
            Throw New Exception("Failed to create a new Sweep.")
        End If
    Else
        Throw New Exception("Please open a Family document before invoking this command.")
    End If

    Return sweep
End Function
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the input argument-path-is    a null reference (  Nothing  in Visual Basic)  or empty. |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input argument-profile-is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | Thrown when the input argument-profileLocationCurveIndex-is out of index bounds. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | Thrown when the input argument-profilePlaneLocation-does not exist in the ProfilePlaneLocation enumeration. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when creation is attempted in Conceptual Mass, 2D, or other family where sweeps cannot be created. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the creation failed. |

# See Also

FamilyItemFactory Class

NewSweep Overload

Autodesk.Revit.Creation Namespace

#### VendorIdIsValid Method

---

|  |
| --- |
| SchemaBuilder Class   See Also |

Checks whether the given vendor ID string is valid. A valid vendor ID string: 1. Has a length of at least 4 characters and no more than 253 characters, and 2. Contains only letters, digits, or any of the following special characters: ! " # & \ ( ) + , . - : ; < = > ? \_ ` | ~

**Namespace:**   Autodesk.Revit.DB.ExtensibleStorage
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static bool VendorIdIsValid( 	string vendorId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function VendorIdIsValid ( _ 	vendorId As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool VendorIdIsValid( 	String^ vendorId ) ``` |

#### Parameters

vendorId
:   Type:  System String
     The vendor ID to check.

#### Return Value

True if the vendor ID is valid.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SchemaBuilder Class

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### CannotMoveElementWarn Property

---

|  |
| --- |
| BuiltInFailures EditingFailures Class   See Also |

Can't move element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotMoveElementWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotMoveElementWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotMoveElementWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EditingFailures Class

Autodesk.Revit.DB Namespace

#### AutoGlazingFailedError Property

---

|  |
| --- |
| BuiltInFailures MassFailures Class   See Also |

Failure in Auto-Glazing region computation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId AutoGlazingFailedError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AutoGlazingFailedError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ AutoGlazingFailedError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MassFailures Class

Autodesk.Revit.DB Namespace

#### ConnectionInputPointInfo Constructor

---

|  |
| --- |
| ConnectionInputPointInfo Class   See Also |

Construct a default input point.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public ConnectionInputPointInfo() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: ConnectionInputPointInfo() ``` |

# See Also

ConnectionInputPointInfo Class

ConnectionInputPointInfo Overload

Autodesk.Revit.DB.Structure Namespace

#### FormulaEditingEventArgs Class

---

|  |
| --- |
| Members   See Also |

The event arguments used by the DocumentSaving event.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public class FormulaEditingEventArgs : RevitAPIPreEventArgs ``` |

| Visual Basic |
| --- |
| ``` Public Class FormulaEditingEventArgs _ 	Inherits RevitAPIPreEventArgs ``` |

| Visual C++ |
| --- |
| ``` public ref class FormulaEditingEventArgs : public RevitAPIPreEventArgs ``` |

# Inheritance Hierarchy

System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPIPreEventArgs
  Autodesk.Revit.UI.Events FormulaEditingEventArgs

# See Also

FormulaEditingEventArgs Members

Autodesk.Revit.UI.Events Namespace

#### WidthInPixels Property

---

|  |
| --- |
| TableData Class   See Also |

Gets the width of the panel schedule in logical pixels

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public int WidthInPixels { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property WidthInPixels As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int WidthInPixels { 	int get (); } ``` |

# See Also

TableData Class

Autodesk.Revit.DB Namespace

#### GetSectionData Method

---

|  |
| --- |
| PanelScheduleView Class   See Also |

Gets section data that will be written to

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public TableSectionData GetSectionData( 	SectionType sectionType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSectionData ( _ 	sectionType As SectionType _ ) As TableSectionData ``` |

| Visual C++ |
| --- |
| ``` public: TableSectionData^ GetSectionData( 	SectionType sectionType ) ``` |

#### Parameters

sectionType
:   Type:  Autodesk.Revit.DB SectionType
     The section type

#### Return Value

The  TableSectionData

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

PanelScheduleView Class

Autodesk.Revit.DB.Electrical Namespace

#### Hub Class

---

|  |
| --- |
| Members   See Also |

Represents a connection between two or more Autodesk Revit Elements.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class Hub : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class Hub _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class Hub : public Element ``` |

# Remarks

* Elements connected via a Hub do not refer directly to each other - they each refer to the Hub that keeps all the connectivity information.
* Hubs connect only structural Analytical Model Elements.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB.Structure Hub

# See Also

Hub Members

Autodesk.Revit.DB.Structure Namespace

#### ViewTemplate Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"View Template"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewTemplate { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewTemplate As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewTemplate { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### HasAllChangesFromCentral Method

---

|  |
| --- |
| Document Class   Example   See Also |

Returns whether the model in the current session is up to date with central.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool HasAllChangesFromCentral() ``` |

| Visual Basic |
| --- |
| ``` Public Function HasAllChangesFromCentral As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool HasAllChangesFromCentral() ``` |

#### Return Value

True means up to date; false means out of date.

If central is locked but Revit can determine that the model in the current session is out of date without opening central, this method will return false instead of throwing CentralModelContentionException.

# Examples

 Copy  C#

```
void ReloadDocument(Document doc)
{
    ReloadLatestOptions reloadOpts = new ReloadLatestOptions();
    try
    {
        doc.ReloadLatest(reloadOpts);
        // Check to make sure no new changes were synced with Central during reload
        if (doc.HasAllChangesFromCentral() == false)
        {
            // If there are changes from central, reload again
            doc.ReloadLatest(reloadOpts);
        }
    }
    catch (Exception e)
    {
        TaskDialog.Show("Reload Failed", e.Message);
    }
}
```

 Copy  VB.NET

```
Private Sub ReloadDocument(doc As Document)
    Dim reloadOpts As New ReloadLatestOptions()
    Try
        doc.ReloadLatest(reloadOpts)
        ' Check to make sure no new changes were synced with Central during reload
        If doc.HasAllChangesFromCentral() = False Then
            ' If there are changes from central, reload again
            doc.ReloadLatest(reloadOpts)
        End If
    Catch e As Exception
        TaskDialog.Show("Reload Failed", e.Message)
    End Try
End Sub
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions CentralFileCommunicationException | The file-based central model could not be reached, because e.g. the network is down or the file server is down. |
| Autodesk.Revit.Exceptions CentralModelAccessDeniedException | Access to the central model was denied due to lack of access privileges. -or- Access to the central model was denied. A possible reason is because the model was under maintenance. |
| Autodesk.Revit.Exceptions CentralModelContentionException | The central model is locked by another client. |
| Autodesk.Revit.Exceptions CentralModelException | Username does not match the one used to create the local file. -or- The central model has been replaced by a local model. -or- Local incompatible because it was closed without saving after synchronizing with central. -or- The central model is missing. -or- The central model is incompatible. -or- The central model is corrupt or not an RVT file. -or- The central model was rolled back. -or- The central model's elements have been relinquished -or- The central model is overritten by other user. -or- An internal error happened on the central model, please contact the server administrator. |
| Autodesk.Revit.Exceptions FileNotFoundException | Cannot access the local file. |
| Autodesk.Revit.Exceptions InvalidOperationException | This Document is not a workshared document. -or- This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it. |
| Autodesk.Revit.Exceptions RevitServerCommunicationException | The server-based central model could not be accessed because of a network communication error. |
| Autodesk.Revit.Exceptions RevitServerInternalException | An internal error happened on the server, please contact the server administrator. |
| Autodesk.Revit.Exceptions RevitServerUnauthenticatedUserException | User is not signed in with Autodesk id. |
| Autodesk.Revit.Exceptions RevitServerUnauthorizedException | User is not authorized to access the specified A360 project. |

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### ElementsSketchTooLarge Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

The sketch defining the highlighted element is too large.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ElementsSketchTooLarge { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ElementsSketchTooLarge As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ElementsSketchTooLarge { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### GetFreeFormAccessor Method

---

|  |
| --- |
| Rebar Class   See Also |

Returns an interface providing access to free-form properties and methods for this Rebar element.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public RebarFreeFormAccessor GetFreeFormAccessor() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFreeFormAccessor As RebarFreeFormAccessor ``` |

| Visual C++ |
| --- |
| ``` public: RebarFreeFormAccessor^ GetFreeFormAccessor() ``` |

#### Return Value

The interface providing access to free-form properties and methods for this Rebar element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InvalidOperationException | This method applies only to free form rebar. |

# See Also

Rebar Class

Autodesk.Revit.DB.Structure Namespace

#### SurfaceNdfType Property

---

|  |
| --- |
| AdvancedOpaque Class   See Also |

The property labeled "NDF" from the "AdvancedOpaque" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string SurfaceNdfType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SurfaceNdfType As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ SurfaceNdfType { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".

# See Also

AdvancedOpaque Class

Autodesk.Revit.DB.Visual Namespace

#### FamilySymbolFilter Constructor

---

|  |
| --- |
| FamilySymbolFilter Class   See Also |

Constructs a new instance of a filter to find all family symbols of the given family.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FamilySymbolFilter( 	ElementId familyId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	familyId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: FamilySymbolFilter( 	ElementId^ familyId ) ``` |

#### Parameters

familyId
:   Type:  Autodesk.Revit.DB ElementId
     The family id.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The familyId is invalid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FamilySymbolFilter Class

Autodesk.Revit.DB Namespace

#### CreatePerspective Method

---

|  |
| --- |
| View3D Class   Example   See Also |

Returns a new perspective View3D.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static View3D CreatePerspective( 	Document document, 	ElementId viewFamilyTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreatePerspective ( _ 	document As Document, _ 	viewFamilyTypeId As ElementId _ ) As View3D ``` |

| Visual C++ |
| --- |
| ``` public: static View3D^ CreatePerspective( 	Document^ document,  	ElementId^ viewFamilyTypeId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document to which the new View3D will be added.

viewFamilyTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the ViewFamilyType which will be used by the new View3D. The type needs to be a ThreeDimensional ViewType.

#### Return Value

The new perspective View3D.

# Remarks

The new View3D will receive a unique view name. The view will be oriented in the same position as the default 3D view.

# Examples

 Copy  VB.NET

```
' Find a 3D view type
Dim collector1 As New FilteredElementCollector(document)
collector1 = collector1.OfClass(GetType(ViewFamilyType))
Dim viewFamilyTypes As IEnumerable(Of ViewFamilyType)

viewFamilyTypes = From elem In collector1 _
                  Let vftype = TryCast(elem, ViewFamilyType) _
                  Where vftype.ViewFamily = ViewFamily.ThreeDimensional _
                  Select vftype
' Create a new Perspective View3D
Dim view3D__1 As View3D = View3D.CreatePerspective(document, viewFamilyTypes.First().Id)
If view3D__1 IsNot Nothing Then
    ' By default, the 3D view uses a default orientation.
    ' Change the orientation by creating and setting a ViewOrientation3D
    Dim eye As New XYZ(0, -100, 10)
    Dim up As New XYZ(0, 0, 1)
    Dim forward As New XYZ(0, 1, 0)
    view3D__1.SetOrientation(New ViewOrientation3D(eye, up, forward))

    ' turn off the far clip plane with standard parameter API
    Dim farClip As Parameter = view3D__1.LookupParameter("Far Clip Active")
    farClip.Set
End If
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This View Family Type is not a ThreeDimensional view type. -or- 3D view creation is not allowed in this family. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

View3D Class

Autodesk.Revit.DB Namespace

#### ValueAtPointBase Class

---

|  |
| --- |
| Members   See Also |

A base class representing storage of values at a given point.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class ValueAtPointBase : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ValueAtPointBase _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ValueAtPointBase : IDisposable ``` |

# Remarks

This class stores a set of measurements and corresponding mapped flags. The flags are defined in the enumerated type ValueAtPointFlags.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ValueAtPointBase
  Autodesk.Revit.DB.Analysis ValueAtPoint
  Autodesk.Revit.DB.Analysis VectorAtPoint

# See Also

ValueAtPointBase Members

Autodesk.Revit.DB Namespace

#### BrOrgFilter Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Filter"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BrOrgFilter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BrOrgFilter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BrOrgFilter { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PhyMaterialParamShearMod3 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Shear modulus Z"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhyMaterialParamShearMod3 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhyMaterialParamShearMod3 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhyMaterialParamShearMod3 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SeekItemId Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Seek Item ID"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SeekItemId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SeekItemId As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SeekItemId { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsEndFace Method

---

|  |
| --- |
| Form Class   See Also |

Given a face, tell if it is an end cap face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsEndFace( 	Reference faceReference ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsEndFace ( _ 	faceReference As Reference _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsEndFace( 	Reference^ faceReference ) ``` |

#### Parameters

faceReference
:   Type:  Autodesk.Revit.DB Reference
     The reference of the face to be checked.

# See Also

Form Class

Autodesk.Revit.DB Namespace

#### FlexDuctType Property

---

|  |
| --- |
| FlexDuct Class   See Also |

The flex duct type of this flex duct.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FlexDuctType FlexDuctType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FlexDuctType As FlexDuctType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property FlexDuctType^ FlexDuctType { 	FlexDuctType^ get (); 	void set (FlexDuctType^ value); } ``` |

# See Also

FlexDuct Class

Autodesk.Revit.DB.Mechanical Namespace

#### SKPImportOptions Constructor (SKPImportOptions)

---

|  |
| --- |
| SKPImportOptions Class   See Also |

Constructs a new instance of SKPImportOptions as a copy of the import options.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public SKPImportOptions( 	SKPImportOptions option ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	option As SKPImportOptions _ ) ``` |

| Visual C++ |
| --- |
| ``` public: SKPImportOptions( 	SKPImportOptions^ option ) ``` |

#### Parameters

option
:   Type:  Autodesk.Revit.DB SKPImportOptions
     The SKP options to be copied.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SKPImportOptions Class

SKPImportOptions Overload

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| RebarShapeMultiplanarDefinition Class   See Also |

Releases all resources used by the  RebarShapeMultiplanarDefinition

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

RebarShapeMultiplanarDefinition Class

Autodesk.Revit.DB.Structure Namespace

#### Reset Method

---

|  |
| --- |
| KeyBasedTreeEntriesIterator Class   See Also |

Resets the iterator to the initial state.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

# See Also

KeyBasedTreeEntriesIterator Class

Autodesk.Revit.DB Namespace

#### MatchlineTopPlane Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top Constraint"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MatchlineTopPlane { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MatchlineTopPlane As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MatchlineTopPlane { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### MemberForcesServiceData Class

---

|  |
| --- |
| Members   See Also |

The data needed by member forces server to perform type definition.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public class MemberForcesServiceData : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class MemberForcesServiceData _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class MemberForcesServiceData : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Structure MemberForcesServiceData

# See Also

MemberForcesServiceData Members

Autodesk.Revit.DB.Structure Namespace

#### BackgroundDraftPatternIdParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Background Fill Pattern"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BackgroundDraftPatternIdParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BackgroundDraftPatternIdParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BackgroundDraftPatternIdParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BackgroundColor Property

---

|  |
| --- |
| TableCellStyle Class   See Also |

The background color of this cell in the grid view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public Color BackgroundColor { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BackgroundColor As Color 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Color^ BackgroundColor { 	Color^ get (); 	void set (Color^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

TableCellStyle Class

Autodesk.Revit.DB Namespace

#### CannotCreateSlantedWallWithSingularLayers Property

---

|  |
| --- |
| BuiltInFailures CreationFailures Class   See Also |

Cannot create wall - its layers would degenerate or intersect. Reduce the wall's height or slant.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCreateSlantedWallWithSingularLayers { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCreateSlantedWallWithSingularLayers As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCreateSlantedWallWithSingularLayers { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CreationFailures Class

Autodesk.Revit.DB Namespace

#### PathReinLengthn2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Alternating Bar - Length"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PathReinLengthn2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PathReinLengthn2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PathReinLengthn2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| LeaderArrayIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

LeaderArrayIterator Class

Autodesk.Revit.DB Namespace

#### KNDashM Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol kN-m, indicating unit Kilonewton meters.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KNDashM { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KNDashM As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KNDashM { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### GetExactLength Method

---

|  |
| --- |
| CurveLoop Class   See Also |

Returns the sum of exact lengths of all curves in the loop.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double GetExactLength() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetExactLength As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetExactLength() ``` |

#### Return Value

The total length of the curves in the loop.

# See Also

CurveLoop Class

Autodesk.Revit.DB Namespace

#### Spacing Property

---

|  |
| --- |
| LayoutRuleClearSpacing Class   See Also |

Get or set the spacing of the beam system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double Spacing { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Spacing As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Spacing { 	double get (); 	void set (double value); } ``` |

# Remarks

The value of spacing must be in [0, 30000), but in fact the spacing should not be too small or too great.

# See Also

LayoutRuleClearSpacing Class

Autodesk.Revit.DB Namespace

#### CurveLoop Property

---

|  |
| --- |
| Path3d Class   See Also |

Get the Curve Loop of Path3d via index.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public CurveArray this[ 	int index ] { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property CurveLoop ( _ 	index As Integer _ ) As CurveArray 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property CurveArray^ CurveLoop[int index] { 	CurveArray^ get (int index); } ``` |

#### Parameters

index
:   Type:  System Int32

# Remarks

Returns the index order Curve Loop of Path3d.

# See Also

Path3d Class

Autodesk.Revit.DB Namespace

#### ForwardIterator Method

---

|  |
| --- |
| ReferenceArray Class   See Also |

Retrieve a forward moving iterator to the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual ReferenceArrayIterator ForwardIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ForwardIterator As ReferenceArrayIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual ReferenceArrayIterator^ ForwardIterator() ``` |

#### Return Value

Returns a forward moving iterator to the array.

# See Also

ReferenceArray Class

Autodesk.Revit.DB Namespace

#### CanSuppressTrailingZeros Method (ForgeTypeId)

---

|  |
| --- |
| FormatOptions Class   See Also |

Checks whether trailing zeros can be suppressed for a given unit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static bool CanSuppressTrailingZeros( 	ForgeTypeId unitTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CanSuppressTrailingZeros ( _ 	unitTypeId As ForgeTypeId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool CanSuppressTrailingZeros( 	ForgeTypeId^ unitTypeId ) ``` |

#### Parameters

unitTypeId
:   Type:  Autodesk.Revit.DB ForgeTypeId
     Identifier of the unit.

#### Return Value

True if trailing zeros can be suppressed, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType). |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FormatOptions Class

CanSuppressTrailingZeros Overload

Autodesk.Revit.DB Namespace

#### IsValidServer Method

---

|  |
| --- |
| IExternalService Interface   See Also |

Implement this method to check if the given instance represents a valid server of this service.

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` bool IsValidServer( 	IExternalServer server ) ``` |

| Visual Basic |
| --- |
| ``` Function IsValidServer ( _ 	server As IExternalServer _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` bool IsValidServer( 	IExternalServer^ server ) ``` |

#### Parameters

server
:   Type:  Autodesk.Revit.DB.ExternalService IExternalServer
     An instance of a server that is to be validated.

#### Return Value

True if the server is valid, False otherwise

# Remarks

This method is invoked by the framework upon registration of a server for this service. The simplest implementation would be to test whether the type of the object is as expected, but a service may have other rules for validating its servers.

# See Also

IExternalService Interface

Autodesk.Revit.DB.ExternalService Namespace

#### ExposureValue Property

---

|  |
| --- |
| RenderingImageExposureSettings Class   See Also |

The value of rendering image exposure.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double ExposureValue { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ExposureValue As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double ExposureValue { 	double get (); 	void set (double value); } ``` |

# Remarks

Default exposure value based on Lighting Scheme.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The value of rendering image exposure is not valid. The valid range is 0 to 21. |

# See Also

RenderingImageExposureSettings Class

Autodesk.Revit.DB Namespace

#### gbXMLBuildingOperatingSchedule Enumeration

---

|  |
| --- |
| See Also |

Enumerations for gbXML (Green Building XML) format, used for energy analysis, schema version 0.34.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum gbXMLBuildingOperatingSchedule ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration gbXMLBuildingOperatingSchedule ``` |

| Visual C++ |
| --- |
| ``` public enum class gbXMLBuildingOperatingSchedule ``` |

# Members

| Member name | Description |
| --- | --- |
| DefaultOperatingSchedule |  |
| TwentyFourHourSevenDayFacility |  |
| TwentyFourHourHourSixDayFacility |  |
| TwentyFourHourHourFiveDayFacility |  |
| TwelveHourSevenDayFacility |  |
| TwelveHourSixDayFacility |  |
| TwelveHourFiveDayFacility |  |
| KindergartenThruTwelveGradeSchool |  |
| YearRoundSchool |  |
| TheaterPerformingArts |  |
| Worship |  |
| NoOfOperatingScheduleEnums |  |

# Remarks

This enumeration corresponds to the buildingType attribute in gbXML and is used to specify the building operating schedule.

# See Also

Autodesk.Revit.DB.Analysis Namespace

#### Shape Property

---

|  |
| --- |
| IConnector Interface   See Also |

The shape of the connector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` ConnectorProfileType Shape { get; } ``` |

| Visual Basic |
| --- |
| ``` ReadOnly Property Shape As ConnectorProfileType 	Get ``` |

| Visual C++ |
| --- |
| ``` property ConnectorProfileType Shape { 	ConnectorProfileType get (); } ``` |

# Remarks

This property is used to retrieve the shape of the connector.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Throw when this connector has no shape. |

# See Also

IConnector Interface

Autodesk.Revit.DB Namespace

#### SetUnderlayBaseLevel Method

---

|  |
| --- |
| ViewPlan Class   See Also |

Sets the level whose elevation will determine the bottom of the underlay range. The elevation of the next highest level will be used to determine the top of the underlay range.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void SetUnderlayBaseLevel( 	ElementId levelId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetUnderlayBaseLevel ( _ 	levelId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetUnderlayBaseLevel( 	ElementId^ levelId ) ``` |

#### Parameters

levelId
:   Type:  Autodesk.Revit.DB ElementId
     The element id of a level in the project or else InvalidElementId.

# Remarks

If the level specified is the highest level, the underlay range will be unbounded. The underlay range will consist of everything above the specified level.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The ElementId levelId does not correspond to a Level in the project. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ViewPlan Class

Autodesk.Revit.DB Namespace

#### GetSubFoldersData Method

---

|  |
| --- |
| ExternalResourceBrowserData Class   See Also |

Gets the subfolders data under the folder path of the browser data.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2019.1

# Syntax

| C# |
| --- |
| ``` public IList<ExternalResourceSubFolder> GetSubFoldersData() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSubFoldersData As IList(Of ExternalResourceSubFolder) ``` |

| Visual C++ |
| --- |
| ``` public: IList<ExternalResourceSubFolder^>^ GetSubFoldersData() ``` |

#### Return Value

The subfolders data under folder path of the browser data.

# See Also

ExternalResourceBrowserData Class

Autodesk.Revit.DB Namespace

#### PolygonSegmentTooShort Property

---

|  |
| --- |
| BuiltInFailures GeometryFailures Class   See Also |

Polygon segment too short

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId PolygonSegmentTooShort { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PolygonSegmentTooShort As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ PolygonSegmentTooShort { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GeometryFailures Class

Autodesk.Revit.DB Namespace

#### PanelScheduleType Enumeration

---

|  |
| --- |
| See Also |

This enum declares the panel schedule type.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum PanelScheduleType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PanelScheduleType ``` |

| Visual C++ |
| --- |
| ``` public enum class PanelScheduleType ``` |

# Members

| Member name | Description |
| --- | --- |
| Unknown | Unknown panel schedule |
| Branch | Branch panel schedule |
| Switchboard | Switchboard schedule |
| Data | Data panel schedule |

# See Also

Autodesk.Revit.DB.Electrical Namespace

#### Rounding Property

---

|  |
| --- |
| AnalysisDisplayDeformedShapeSettings Class   See Also |

Increment to which numeric values of analysis results are rounded in deformed shape.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double Rounding { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Rounding As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Rounding { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | When setting this property: rounding is not positive |

# See Also

AnalysisDisplayDeformedShapeSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### IsValidName Method

---

|  |
| --- |
| NamingUtils Class   See Also |

Identifies if the input string is valid for use as an object name in Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static bool IsValidName( 	string string ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidName ( _ 	string As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidName( 	String^ string ) ``` |

#### Parameters

string
:   Type:  System String
     The name to validate.

#### Return Value

True if the name is valid for use as a name in Revit, false if it contains prohibited characters and is invalid.

# Remarks

This routine checks only for prohibited characters in the string. When setting the name for an object there are other specific considerations which are checked (for example, the same name cannot be used twice for different elements of the same type). This routine does not check those conditions.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

NamingUtils Class

Autodesk.Revit.DB Namespace

#### LoadsMayBeNotUpToDate Property

---

|  |
| --- |
| BuiltInFailures AnalyticalModelFailures Class   See Also |

Reactions defined as Internal Load (Is Reaction) may no longer be valid since the analytical model has changed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId LoadsMayBeNotUpToDate { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadsMayBeNotUpToDate As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ LoadsMayBeNotUpToDate { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AnalyticalModelFailures Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| LabelUtils Class   See Also |

Releases all resources used by the  LabelUtils

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

LabelUtils Class

Autodesk.Revit.DB Namespace

#### InstanceVoidCutUtils Class

---

|  |
| --- |
| Members   See Also |

Utilities for cutting elements by unattached voids in family instances.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static class InstanceVoidCutUtils ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class InstanceVoidCutUtils ``` |

| Visual C++ |
| --- |
| ``` public ref class InstanceVoidCutUtils abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB InstanceVoidCutUtils

# See Also

InstanceVoidCutUtils Members

Autodesk.Revit.DB Namespace

#### ClineSubcategory Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Subcategory"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ClineSubcategory { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ClineSubcategory As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ClineSubcategory { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| RoutingCriterionBase Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

RoutingCriterionBase Class

Autodesk.Revit.DB Namespace

#### DuctSizeSettings Class

---

|  |
| --- |
| Members   See Also |

Duct sizes settings

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class DuctSizeSettings : Element,  	IEnumerable<KeyValuePair<DuctShape, DuctSizes>> ``` |

| Visual Basic |
| --- |
| ``` Public Class DuctSizeSettings _ 	Inherits Element _ 	Implements IEnumerable(Of KeyValuePair(Of DuctShape, DuctSizes)) ``` |

| Visual C++ |
| --- |
| ``` public ref class DuctSizeSettings : public Element,  	IEnumerable<KeyValuePair<DuctShape, DuctSizes^>> ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB.Mechanical DuctSizeSettings

# See Also

DuctSizeSettings Members

Autodesk.Revit.DB.Mechanical Namespace

#### CircuitRating Property

---

|  |
| --- |
| ElectricalSetting Class   See Also |

The default circuit rating for newly created circuit.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public double CircuitRating { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CircuitRating As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double CircuitRating { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The circuit rating should be non-negative. |

# See Also

ElectricalSetting Class

Autodesk.Revit.DB.Electrical Namespace

#### AirChangesPerHour Property

---

|  |
| --- |
| Space Class   See Also |

Get the Specified AirChangesPerHour of the Space.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public double AirChangesPerHour { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property AirChangesPerHour As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double AirChangesPerHour { 	double get (); } ``` |

# Remarks

This property is used to get the Specified AirChangesPerHour of the Space.

# See Also

Space Class

Autodesk.Revit.DB.Mechanical Namespace

#### RebarIncludeLastBar Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Include Last Bar"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarIncludeLastBar { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarIncludeLastBar As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarIncludeLastBar { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ScheduleTopLevelOffsetParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ScheduleTopLevelOffsetParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ScheduleTopLevelOffsetParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ScheduleTopLevelOffsetParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### NumberForScale Property

---

|  |
| --- |
| AnalysisDisplayLegendSettings Class   See Also |

A fixed value to display on the legend scale (0 by default; 0 means width of legend scale is calculated dynamically).

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double NumberForScale { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property NumberForScale As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double NumberForScale { 	double get (); 	void set (double value); } ``` |

# See Also

AnalysisDisplayLegendSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### HVACLoadLoadsReportType Enumeration

---

|  |
| --- |
| See Also |

Enumerated type listing possible types of reports generated for HVAC loads.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum HVACLoadLoadsReportType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration HVACLoadLoadsReportType ``` |

| Visual C++ |
| --- |
| ``` public enum class HVACLoadLoadsReportType ``` |

# Members

| Member name | Description |
| --- | --- |
| NoReport | No report |
| SimpleReport | A simple report with summaries |
| StandardReport | A standard report including zones and spaces |
| DetailedReport | A detailed report including orientation breakdowns |

# See Also

Autodesk.Revit.DB.Analysis Namespace

#### SetHostPointReference Method

---

|  |
| --- |
| PointRelativeToPoint Class   See Also |

Change the host point reference.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetHostPointReference( 	Reference hostPointReference ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetHostPointReference ( _ 	hostPointReference As Reference _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetHostPointReference( 	Reference^ hostPointReference ) ``` |

#### Parameters

hostPointReference
:   Type:  Autodesk.Revit.DB Reference

# Remarks

Allowed references are to another Autodesk.Revit.DB.ReferencePoint element or to an Autodesk.Revit.DB.Point.

# See Also

PointRelativeToPoint Class

Autodesk.Revit.DB Namespace

#### GetAssociatedZoneEquipment Method (Document, ISet(ElementId))

---

|  |
| --- |
| ZoneEquipment Class   See Also |

Gets the associated zone equipment of all specified analytical spaces.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public static ISet<ElementId> GetAssociatedZoneEquipment( 	Document document, 	ISet<ElementId> spaces ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetAssociatedZoneEquipment ( _ 	document As Document, _ 	spaces As ISet(Of ElementId) _ ) As ISet(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ISet<ElementId^>^ GetAssociatedZoneEquipment( 	Document^ document,  	ISet<ElementId^>^ spaces ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document where the analytical spaces and zone equipment exist.

spaces
:   Type:  System.Collections.Generic ISet   ElementId
     The specified analytical spaces.

#### Return Value

All associated zone equipment, either explicitly assigned or implicitly assigned via system-zone.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ZoneEquipment Class

GetAssociatedZoneEquipment Overload

Autodesk.Revit.DB.Mechanical Namespace

#### ComputeArea Method

---

|  |
| --- |
| Polyloop Class   See Also |

Gets the area for this polygon.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double ComputeArea() ``` |

| Visual Basic |
| --- |
| ``` Public Function ComputeArea As Double ``` |

| Visual C++ |
| --- |
| ``` public: double ComputeArea() ``` |

#### Return Value

The area for this polygon.

# Remarks

The area of the planar non-self-intersecting polygon computed as: A = 1/2 \* (X1 Y2) - (X2 Y1) + ... + (Xn Y1) - (X1 Yn)

# See Also

Polyloop Class

Autodesk.Revit.DB.Analysis Namespace

#### GetSavedOrientation Method

---

|  |
| --- |
| View3D Class   See Also |

Gets the saved orientation of the View3D.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ViewOrientation3D GetSavedOrientation() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSavedOrientation As ViewOrientation3D ``` |

| Visual C++ |
| --- |
| ``` public: ViewOrientation3D^ GetSavedOrientation() ``` |

#### Return Value

The saved orientation of the View3D.

# See Also

View3D Class

Autodesk.Revit.DB Namespace

#### RebarShapeFailureCustomError Property

---

|  |
| --- |
| BuiltInFailures RebarFailures Class   See Also |

'[ErrorMessage]'

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RebarShapeFailureCustomError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarShapeFailureCustomError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RebarShapeFailureCustomError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarFailures Class

Autodesk.Revit.DB Namespace

#### HostAreaComputed Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Area"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId HostAreaComputed { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property HostAreaComputed As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ HostAreaComputed { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ShowGraphicalWarningPipeDisconnects Property

---

|  |
| --- |
| Application Class   See Also |

Whether or not to show the graphical warnings for Pipe disconnects.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool ShowGraphicalWarningPipeDisconnects { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ShowGraphicalWarningPipeDisconnects As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ShowGraphicalWarningPipeDisconnects { 	bool get (); 	void set (bool value); } ``` |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### ScheduleSheetInstance Class

---

|  |
| --- |
| Members   See Also |

An element that represents a particular placement of a schedule on a sheet.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class ScheduleSheetInstance : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class ScheduleSheetInstance _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class ScheduleSheetInstance : public Element ``` |

# Remarks

Use ScheduleSheetInstance.OwnerViewId to find the sheet on which a schedule is placed.

When a schedule is set to filter by sheet and placed on a sheet, it will create a new schedule with elements visible in the Viewport(s) on that sheet. The instance created belongs to the newly created schedule.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ScheduleSheetInstance

# See Also

ScheduleSheetInstance Members

Autodesk.Revit.DB Namespace

#### FlowAndPressureCalculationMethodHasBeenImproved Property

---

|  |
| --- |
| BuiltInFailures MEPCalculationFailures Class   See Also |

During upgrade pressure drop calculations for hydronic piping systems using Simplified Colebrook or Custom Calculation methods have been recalculated using the Colebrook equation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FlowAndPressureCalculationMethodHasBeenImproved { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FlowAndPressureCalculationMethodHasBeenImproved As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FlowAndPressureCalculationMethodHasBeenImproved { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPCalculationFailures Class

Autodesk.Revit.DB Namespace

#### GetNumberOfShellLayers Method

---

|  |
| --- |
| CompoundStructure Class   See Also |

Retrieves the number of interior or exterior shell layers.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int GetNumberOfShellLayers( 	ShellLayerType shellLayerType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetNumberOfShellLayers ( _ 	shellLayerType As ShellLayerType _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int GetNumberOfShellLayers( 	ShellLayerType shellLayerType ) ``` |

#### Parameters

shellLayerType
:   Type:  Autodesk.Revit.DB ShellLayerType
     If ShellLayerType.Exterior return the number of exterior shell layers (or top shell layers for a roof, floor, or ceiling type). If ShellLayerType.Interior return the number of interior shell layers (or bottom shell layers for a roof, floor, or ceiling type).

#### Return Value

The number of shell layers in the interior or exterior shell, as specified by shellLayerType.

# Remarks

There will always be at least one core layer, i.e. one layer which is not a shell layer. You can change the shell/core layer boundary using  SetNumberOfShellLayers(ShellLayerType, Int32)  .

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

CompoundStructure Class

Autodesk.Revit.DB Namespace

#### IsSlab Property

---

|  |
| --- |
| MassSurfaceData Class   See Also |

Indicates if a floor is a slab.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool IsSlab { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsSlab As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsSlab { 	bool get (); } ``` |

# See Also

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace

#### OpaqueAlbedo Property

---

|  |
| --- |
| AdvancedOpaque Class   See Also |

The property labeled "Color" from the "AdvancedOpaque" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string OpaqueAlbedo { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property OpaqueAlbedo As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ OpaqueAlbedo { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

# See Also

AdvancedOpaque Class

Autodesk.Revit.DB.Visual Namespace

#### Axis Property

---

|  |
| --- |
| CylindricalFace Class   See Also |

Axis of the surface.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public XYZ Axis { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Axis As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ Axis { 	XYZ^ get (); } ``` |

# See Also

CylindricalFace Class

Autodesk.Revit.DB Namespace

#### RebarInternalMultiplanarArcConnector Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"INTERNAL: Multiplanar Arc Connector"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarInternalMultiplanarArcConnector { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarInternalMultiplanarArcConnector As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarInternalMultiplanarArcConnector { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### WallpaintFinish Property

---

|  |
| --- |
| WallPaint Class   See Also |

The property labeled "Finish" from the "WallPaint" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string WallpaintFinish { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WallpaintFinish As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ WallpaintFinish { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WallpaintFinishType".

# See Also

WallPaint Class

Autodesk.Revit.DB.Visual Namespace

#### Create Method

---

|  |
| --- |
| MEPAnalyticalConnection Class   See Also |

Creates a new analytical connection between two open connectors.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static MEPAnalyticalConnection Create( 	Document doc, 	ElementId typeId, 	Connector startConnector, 	Connector endConnector ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	doc As Document, _ 	typeId As ElementId, _ 	startConnector As Connector, _ 	endConnector As Connector _ ) As MEPAnalyticalConnection ``` |

| Visual C++ |
| --- |
| ``` public: static MEPAnalyticalConnection^ Create( 	Document^ doc,  	ElementId^ typeId,  	Connector^ startConnector,  	Connector^ endConnector ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     The document where the new element is created.

typeId
:   Type:  Autodesk.Revit.DB ElementId
     The type of new analytical connection.

startConnector
:   Type:  Autodesk.Revit.DB Connector
     The open connector on the equipment side, whose level is inherited by the analytical connection.

endConnector
:   Type:  Autodesk.Revit.DB Connector
     The open connector on the network.

#### Return Value

The newly created analytical connection element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Invalid connection type. -or- The connector does not support analytical connection. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MEPAnalyticalConnection Class

Autodesk.Revit.DB Namespace

#### ColorDepthType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all Color Depth types of Print Setting.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ColorDepthType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ColorDepthType ``` |

| Visual C++ |
| --- |
| ``` public enum class ColorDepthType ``` |

# Members

| Member name | Description |
| --- | --- |
| BlackLine | The type of Color Depth is Black Line. |
| GrayScale | The type of Color Depth is Gray Scale. |
| Color | The type of Color Depth is Color. |

# See Also

Autodesk.Revit.DB Namespace

#### Insert Method

---

|  |
| --- |
| WireTypeSet Class   See Also |

Insert the specified wire type into the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool Insert( 	WireType item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Insert ( _ 	item As WireType _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Insert( 	WireType^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB.Electrical WireType
     The wire type to be inserted into the set.

#### Return Value

Returns whether the wire type was inserted into the set.

# See Also

WireTypeSet Class

Autodesk.Revit.DB.Electrical Namespace

#### WoodDiffusePerlinScaleZ Property

---

|  |
| --- |
| AdvancedWood Class   See Also |

The property labeled "Anisotropic pos-z scale for diffuse albedo perlin" from the "AdvancedWood" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string WoodDiffusePerlinScaleZ { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WoodDiffusePerlinScaleZ As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ WoodDiffusePerlinScaleZ { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble".

# See Also

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace

#### ColumnsExceedSegment Property

---

|  |
| --- |
| BuiltInFailures ScheduleViewFailures Class   See Also |

Some columns in Graphical Column Schedule exceed the segment's upper/lower bounds. You can add levels or adjust the view parameters.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ColumnsExceedSegment { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ColumnsExceedSegment As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ColumnsExceedSegment { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ScheduleViewFailures Class

Autodesk.Revit.DB Namespace

#### CreateContainsRule Method (ElementId, String)

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

Creates a filter rule that determines whether strings from the document contain a certain string value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public static FilterRule CreateContainsRule( 	ElementId parameter, 	string value ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateContainsRule ( _ 	parameter As ElementId, _ 	value As String _ ) As FilterRule ``` |

| Visual C++ |
| --- |
| ``` public: static FilterRule^ CreateContainsRule( 	ElementId^ parameter,  	String^ value ) ``` |

#### Parameters

parameter
:   Type:  Autodesk.Revit.DB ElementId
     A string-typed parameter used to get values from the document for a given element.

value
:   Type:  System String
     The user-supplied string value for which values from the document will be searched.

#### Return Value

Created filter rule object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterFilterRuleFactory Class

CreateContainsRule Overload

Autodesk.Revit.DB Namespace

#### BoundaryRestraintRotY Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Y Spring Modulus"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BoundaryRestraintRotY { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BoundaryRestraintRotY As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BoundaryRestraintRotY { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### NodeType Property

---

|  |
| --- |
| ElectricalAnalyticalNode Class   See Also |

The type of electrical analytical node.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public ElectricalAnalyticalNodeType NodeType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property NodeType As ElectricalAnalyticalNodeType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElectricalAnalyticalNodeType NodeType { 	ElectricalAnalyticalNodeType get (); } ``` |

# See Also

ElectricalAnalyticalNode Class

Autodesk.Revit.DB.Electrical Namespace

#### IsValidExternalFileReference Method

---

|  |
| --- |
| ExternalFileReference Class   See Also |

Checks an ExternalFileReference to see if it is properly created.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static bool IsValidExternalFileReference( 	ExternalFileReference data ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidExternalFileReference ( _ 	data As ExternalFileReference _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidExternalFileReference( 	ExternalFileReference^ data ) ``` |

#### Parameters

data
:   Type:  Autodesk.Revit.DB ExternalFileReference
     The ExternalFileReference to be checked

# Remarks

The following restrictions exist:

* PathType.Server is only valid for ExternalFileReferences of type ExternalFileReferenceType.RevitLink
* PathType.Content is only valid for ExternalFileReferences of type ExternalFileReferenceType.KeynoteTable, ExternalFileReferenceType.AssemblyCodeTable or ExternalFileReferenceType.Decal
* Keynote tables, assembly code tables and Decals (ExternalFileReferenceType.KeynoteTable, ExternalFileReferenceType.AssemblyCodeTable and ExternalFileReferenceType.Decal) may only be LinkedFileStatus.Loaded or LinkedFileStatus.NotFound.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExternalFileReference Class

Autodesk.Revit.DB Namespace

#### CoverOffsetTooLong Property

---

|  |
| --- |
| BuiltInFailures FabricFailures Class   See Also |

Cover offset is greater than host thickness.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CoverOffsetTooLong { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CoverOffsetTooLong As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CoverOffsetTooLong { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FabricFailures Class

Autodesk.Revit.DB Namespace

#### DisplacedElementDisplacementZ Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Z Displacement"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DisplacedElementDisplacementZ { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DisplacedElementDisplacementZ As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DisplacedElementDisplacementZ { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotConvertInstWorkPlaneToHost Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

Can't convert Instance's Work Plane to Host. Try resetting Work Plane to a Level.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotConvertInstWorkPlaneToHost { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotConvertInstWorkPlaneToHost As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotConvertInstWorkPlaneToHost { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace

#### SpatialFieldMgrLegendTextType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Overall Legend Text"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpatialFieldMgrLegendTextType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpatialFieldMgrLegendTextType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpatialFieldMgrLegendTextType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ProjectRevisionRevisionNum Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Revision Number"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ProjectRevisionRevisionNum { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ProjectRevisionRevisionNum As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ProjectRevisionRevisionNum { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetBoundingBox Method

---

|  |
| --- |
| IDirectContext3DServer Interface   See Also |

Reports a bounding box of the geometry that this server submits for drawing.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` Outline GetBoundingBox( 	View dBView ) ``` |

| Visual Basic |
| --- |
| ``` Function GetBoundingBox ( _ 	dBView As View _ ) As Outline ``` |

| Visual C++ |
| --- |
| ``` Outline^ GetBoundingBox( 	View^ dBView ) ``` |

#### Parameters

dBView
:   Type:  Autodesk.Revit.DB View
     The view where rendering will occur. If this argument is    a null reference (  Nothing  in Visual Basic)  , a view-independent bounding box should be reported.

#### Return Value

The bounding box as an Outline.

# Remarks

Revit uses the bounding box when navigating views, e.g., when a Zoom to Fit command is issued. The reported bounding box does not have to be tight. However, there may be unintended side-effects if the box is inconsistent with the submitted geometry.

# See Also

IDirectContext3DServer Interface

Autodesk.Revit.DB.DirectContext3D Namespace

#### HasBadLevel Method

---

|  |
| --- |
| ClassificationEntry Class   See Also |

Checks if the level is an integer in range between 1 and 5 inclusive.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool HasBadLevel() ``` |

| Visual Basic |
| --- |
| ``` Public Function HasBadLevel As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool HasBadLevel() ``` |

#### Return Value

True if the level is not an integer from 1 to 5 inclusive. False otherwise.

# See Also

ClassificationEntry Class

Autodesk.Revit.DB Namespace

#### StructuralElementDefinitionData Constructor

---

|  |
| --- |
| StructuralElementDefinitionData Class   See Also |

Creates empty StructuralElementDefinitionData object.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public StructuralElementDefinitionData() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: StructuralElementDefinitionData() ``` |

# See Also

StructuralElementDefinitionData Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### CoverTypeLength Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Length"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CoverTypeLength { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CoverTypeLength As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CoverTypeLength { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StandardHookBendDiameterTooLarge Property

---

|  |
| --- |
| BuiltInFailures RebarFailures Class   See Also |

Rebar Standard Hook Bend Diameter is too large.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId StandardHookBendDiameterTooLarge { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StandardHookBendDiameterTooLarge As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ StandardHookBendDiameterTooLarge { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarFailures Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ExportFontInfo Class   See Also |

Releases all resources used by the  ExportFontInfo

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ExportFontInfo Class

Autodesk.Revit.DB Namespace

#### HasPlane Method

---

|  |
| --- |
| CurveLoop Class   See Also |

Identifies if the CurveLoop is planar.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool HasPlane() ``` |

| Visual Basic |
| --- |
| ``` Public Function HasPlane As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool HasPlane() ``` |

#### Return Value

True if the curve loop is planar, false otherwise.

# See Also

CurveLoop Class

Autodesk.Revit.DB Namespace

#### FunctionParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Function"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FunctionParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FunctionParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FunctionParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Reset Method

---

|  |
| --- |
| PointIterator Class   See Also |

Resets the iterator to the beginning of the collection.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

# See Also

PointIterator Class

Autodesk.Revit.DB.PointClouds Namespace

#### SetVisibility Method

---

|  |
| --- |
| TemporaryGraphicsManager Class   See Also |

Changes the visibility of temporary graphics object.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void SetVisibility( 	int index, 	bool visible ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetVisibility ( _ 	index As Integer, _ 	visible As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetVisibility( 	int index,  	bool visible ) ``` |

#### Parameters

index
:   Type:  System Int32
     Unique index of the temporary graphics object to be updated.

visible
:   Type:  System Boolean
     if true, it will make the temporary graphics object visible. if false, it will make the temporary graphics object invisible.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | index is out of range of TemporaryGraphicsManager managed objects, or the indexed object has been removed from the document. |

# See Also

TemporaryGraphicsManager Class

Autodesk.Revit.DB Namespace

#### SetTessellationSettings Method

---

|  |
| --- |
| OBJExportOptions Class   See Also |

Sets all the tessellation parameters to its predefined values for the given resolution type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public void SetTessellationSettings( 	ExportResolution resolutionType ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetTessellationSettings ( _ 	resolutionType As ExportResolution _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetTessellationSettings( 	ExportResolution resolutionType ) ``` |

#### Parameters

resolutionType
:   Type:  Autodesk.Revit.DB ExportResolution
     Type of exporting resolution.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

OBJExportOptions Class

Autodesk.Revit.DB Namespace

#### PushButtonData Constructor

---

|  |
| --- |
| PushButtonData Class   See Also |

Constructs a new instance of PushButtonData.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public PushButtonData( 	string name, 	string text, 	string assemblyName, 	string className ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	name As String, _ 	text As String, _ 	assemblyName As String, _ 	className As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: PushButtonData( 	String^ name,  	String^ text,  	String^ assemblyName,  	String^ className ) ``` |

#### Parameters

name
:   Type:  System String
     The internal name of the new button.

text
:   Type:  System String
     The user visible text seen on the new button.

assemblyName
:   Type:  System String
     The assembly path of the button.

className
:   Type:  System String
     The name of the class containing the implementation for the command.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when    a null reference (  Nothing  in Visual Basic)  is passed for one or more arguments. |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when an empty string is passed for one or more arguments. |

# See Also

PushButtonData Class

Autodesk.Revit.UI Namespace

#### BuiltInFailures.GroupFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures related to groups and their behavior.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class GroupFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class GroupFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class GroupFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures GroupFailures

# See Also

BuiltInFailures GroupFailures Members

Autodesk.Revit.DB Namespace

#### FeetOfWater39\_2DegreesFahrenheit Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Feet of water (39.2 Â°F).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FeetOfWater39_2DegreesFahrenheit { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FeetOfWater39_2DegreesFahrenheit As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FeetOfWater39_2DegreesFahrenheit { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### InfillCannotHaveDiffThickness Property

---

|  |
| --- |
| BuiltInFailures InfillFailures Class   See Also |

This infilling element must have the same thickness as its host.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InfillCannotHaveDiffThickness { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InfillCannotHaveDiffThickness As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InfillCannotHaveDiffThickness { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures InfillFailures Class

Autodesk.Revit.DB Namespace

#### LayoutRule Property

---

|  |
| --- |
| Rebar Class   See Also |

Identifies the layout rule of rebar set.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2009

# Syntax

| C# |
| --- |
| ``` public RebarLayoutRule LayoutRule { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property LayoutRule As RebarLayoutRule 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property RebarLayoutRule LayoutRule { 	RebarLayoutRule get (); } ``` |

# See Also

Rebar Class

Autodesk.Revit.DB.Structure Namespace

#### Glazing Class

---

|  |
| --- |
| Members   See Also |

A static class that provides access to the property names that appear in the Glazing visual asset schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static class Glazing ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class Glazing ``` |

| Visual C++ |
| --- |
| ``` public ref class Glazing abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Visual Glazing

# See Also

Glazing Members

Autodesk.Revit.DB.Visual Namespace

#### RoomTagType Class

---

|  |
| --- |
| Members   See Also |

An object that represents a Room Tag type.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class RoomTagType : FamilySymbol ``` |

| Visual Basic |
| --- |
| ``` Public Class RoomTagType _ 	Inherits FamilySymbol ``` |

| Visual C++ |
| --- |
| ``` public ref class RoomTagType : public FamilySymbol ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB InsertableObject
  Autodesk.Revit.DB FamilySymbol
  Autodesk.Revit.DB.Architecture RoomTagType

# See Also

RoomTagType Members

Autodesk.Revit.DB.Architecture Namespace

#### SegmentIndex Property

---

|  |
| --- |
| ScheduleSheetInstance Class   See Also |

The schedule segment index of this ScheduleSheetInstance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022.1

# Syntax

| C# |
| --- |
| ``` public int SegmentIndex { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SegmentIndex As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int SegmentIndex { 	int get (); 	void set (int value); } ``` |

# Remarks

This property represents which schedule segment is referred to by this ScheduleSheetInstance. It normally starts with 0 and is less than the total number of the schedule segments, but there're some speccial cases:

* The segment index value could be -1, which means referring to the whole schedule but not a specific segment.
* The segment index value 0 should be considered the same as -1 if the referenced schedule is not split in normal cases.
* The segment index value must be 0 if the schedule is a revision schedule and in a family.
* The segment index value can't be modified if the schedule is filter by sheet. (In fact, The segment is referenced to is belongs to an internal schedule that only valid in the current view in this case.)

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: segmentIndex is not a valid segment index. |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The schedule of this ScheduleSheetInstance is a titleblock revision schedule or a sheet specific schedule. |

# See Also

ScheduleSheetInstance Class

Autodesk.Revit.DB Namespace

#### ReverseIterator Method

---

|  |
| --- |
| DefinitionBindingMap Class   See Also |

Retrieve a backward moving iterator to the map.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual DefinitionBindingMapIterator ReverseIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ReverseIterator As DefinitionBindingMapIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual DefinitionBindingMapIterator^ ReverseIterator() ``` |

#### Return Value

Returns a backward moving iterator to the map.

# See Also

DefinitionBindingMap Class

Autodesk.Revit.DB Namespace

#### Lbf Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol lbf, indicating unit Pounds force.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Lbf { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Lbf As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Lbf { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### TotalLength Property

---

|  |
| --- |
| Rebar Class   See Also |

The length of an individual bar multiplied by Quantity.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2009

# Syntax

| C# |
| --- |
| ``` public double TotalLength { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property TotalLength As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double TotalLength { 	double get (); } ``` |

# See Also

Rebar Class

Autodesk.Revit.DB.Structure Namespace

#### Host Property

---

|  |
| --- |
| FamilyInstance Class   See Also |

If the instance is contained within another element, this property returns the containing element. An instance that is face hosted will return the element containing the face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Element Host { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Host As Element 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Element^ Host { 	Element^ get (); } ``` |

# Remarks

An example of an instance that is contained is a window. In this case the host property would return the wall in which the window is contained. Another example is an instance that is hosted to a planar or curved face in a Mass element will return the Mass element.

# See Also

FamilyInstance Class

Autodesk.Revit.DB Namespace

#### Comment Property

---

|  |
| --- |
| SynchronizeWithCentralOptions Class   See Also |

User description of changes made since the last Sync with Central. Empty by default.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string Comment { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Comment As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Comment { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: comment has more than 30,000 characters. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

SynchronizeWithCentralOptions Class

Autodesk.Revit.DB Namespace

#### DatumVolumeOfInterest Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Scope Box"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DatumVolumeOfInterest { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DatumVolumeOfInterest As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DatumVolumeOfInterest { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PhyMaterialParamMinimumYieldStress Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Minimum yield stress"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhyMaterialParamMinimumYieldStress { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhyMaterialParamMinimumYieldStress As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhyMaterialParamMinimumYieldStress { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### MassSurfaceData Class

---

|  |
| --- |
| Members   See Also |

Holds properties and other data about a face in the MassEnergyAnalyticalModel element.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` [ObsoleteAttribute("This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyAnalyticalDetailModel' and 'EnergyAnalysisSurface' classes instead.")] public class MassSurfaceData : Element ``` |

| Visual Basic |
| --- |
| ``` <ObsoleteAttribute("This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyAnalyticalDetailModel' and 'EnergyAnalysisSurface' classes instead.")> _ Public Class MassSurfaceData _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` [ObsoleteAttribute(L"This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyAnalyticalDetailModel' and 'EnergyAnalysisSurface' classes instead.")] public ref class MassSurfaceData : public Element ``` |

# Remarks

Properties stored in the MassSurfaceData can be used in regeneration by the MassEnergyAnalyticalModel. For example, faces of the MassEnergyAnalyticalModel take their material values from the settings in the MassSurfaceData.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB.Analysis MassSurfaceData

# See Also

MassSurfaceData Members

Autodesk.Revit.DB.Analysis Namespace

#### DaNDashMPerM Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol daN-m/m, indicating unit Dekanewton meters per meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DaNDashMPerM { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DaNDashMPerM As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DaNDashMPerM { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### FilterDoubleRule Constructor

---

|  |
| --- |
| FilterDoubleRule Class   See Also |

Constructs an instance of FilterDoubleRule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FilterDoubleRule( 	FilterableValueProvider valueProvider, 	FilterNumericRuleEvaluator evaluator, 	double ruleValue, 	double epsilon ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	valueProvider As FilterableValueProvider, _ 	evaluator As FilterNumericRuleEvaluator, _ 	ruleValue As Double, _ 	epsilon As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: FilterDoubleRule( 	FilterableValueProvider^ valueProvider,  	FilterNumericRuleEvaluator^ evaluator,  	double ruleValue,  	double epsilon ) ``` |

#### Parameters

valueProvider
:   Type:  Autodesk.Revit.DB FilterableValueProvider
     A pointer to a "value provider" object that will extract values from a Revit document.

evaluator
:   Type:  Autodesk.Revit.DB FilterNumericRuleEvaluator
     A pointer to the filter rule evaluator object that implements the desired test. The built-in evaluators implement commonly used tests such as less-than, greater-than less-than-or-equal-to, equal, etc.

ruleValue
:   Type:  System Double
     The user-supplied value against which values from a Revit document will be tested.

epsilon
:   Type:  System Double
     The tolerance within which two floating-point values may be considered equal.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given value for ruleValue is not finite -or- The given value for ruleValue is not a number -or- The given value for epsilon is not finite -or- The given value for epsilon is not a number |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FilterDoubleRule Class

Autodesk.Revit.DB Namespace

#### GetCutLayerModifiers Method

---

|  |
| --- |
| ExportLayerInfo Class   See Also |

Gets all the cut layer modifiers from the layer info.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public IList<LayerModifier> GetCutLayerModifiers() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCutLayerModifiers As IList(Of LayerModifier) ``` |

| Visual C++ |
| --- |
| ``` public: IList<LayerModifier^>^ GetCutLayerModifiers() ``` |

#### Return Value

The cut layer modifier array.

# See Also

ExportLayerInfo Class

Autodesk.Revit.DB Namespace

#### GetServiceTypeName Method

---

|  |
| --- |
| FabricationConfiguration Class   See Also |

Gets the service type name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public string GetServiceTypeName( 	int serviceTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetServiceTypeName ( _ 	serviceTypeId As Integer _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetServiceTypeName( 	int serviceTypeId ) ``` |

#### Parameters

serviceTypeId
:   Type:  System Int32
     The service type identifier.

# See Also

FabricationConfiguration Class

Autodesk.Revit.DB Namespace

#### SpaceOutdoorAirflow Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Outdoor Airflow"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpaceOutdoorAirflow { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpaceOutdoorAirflow As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpaceOutdoorAirflow { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ElementParameterFilter Constructor (FilterRule)

---

|  |
| --- |
| ElementParameterFilter Class   See Also |

Constructs a new instance of an ElementParameterFilter from a single rule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ElementParameterFilter( 	FilterRule filterRule ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	filterRule As FilterRule _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ElementParameterFilter( 	FilterRule^ filterRule ) ``` |

#### Parameters

filterRule
:   Type:  Autodesk.Revit.DB FilterRule
     The rule applied to test if the element passes this filter.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ElementParameterFilter Class

ElementParameterFilter Overload

Autodesk.Revit.DB Namespace

#### GetStairs Method

---

|  |
| --- |
| StairsRun Class   See Also |

Returns the stairs to which the stairs run belongs.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public Stairs GetStairs() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetStairs As Stairs ``` |

| Visual C++ |
| --- |
| ``` public: Stairs^ GetStairs() ``` |

#### Return Value

The stairs to which the stairs run belongs.

# See Also

StairsRun Class

Autodesk.Revit.DB.Architecture Namespace

#### SetNumericRevisionSettings Method

---

|  |
| --- |
| RevisionNumberingSequence Class   See Also |

Replaces the current numeric revision numbering settings with the provided settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void SetNumericRevisionSettings( 	NumericRevisionSettings settings ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetNumericRevisionSettings ( _ 	settings As NumericRevisionSettings _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetNumericRevisionSettings( 	NumericRevisionSettings^ settings ) ``` |

#### Parameters

settings
:   Type:  Autodesk.Revit.DB NumericRevisionSettings
     The NumericRevisionSettings to be applied to numeric revision numbering.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | settings is not a valid NumericRevisionSettings. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RevisionNumberingSequence Class

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| EnergyAnalysisDetailModel Class   See Also |

Creates a new energy analysis detailed model.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static EnergyAnalysisDetailModel Create( 	Document document, 	EnergyAnalysisDetailModelOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	options As EnergyAnalysisDetailModelOptions _ ) As EnergyAnalysisDetailModel ``` |

| Visual C++ |
| --- |
| ``` public: static EnergyAnalysisDetailModel^ Create( 	Document^ document,  	EnergyAnalysisDetailModelOptions^ options ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document that contains the physical model of the building.

options
:   Type:  Autodesk.Revit.DB.Analysis EnergyAnalysisDetailModelOptions
     The options to control the calculation rules.

#### Return Value

The created model instance.

# Remarks

The generated energy model is always returned in world coordinates. The method TransformModel() transforms all surfaces in the model according to ground plane, shared coordinates and true north. The EnergyModelType in argument EnergyAnalysisDetailModelOptions indicates whether the generated energy model is based on rooms/spaces or building elements. The default value is EnergyModelType.SpatialElement.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | An EnergyAnalysisDetailModel cannot be created if EnergyModelType.BuildingElement is input and AnalysisMode.ConceptualMasses is set in EnergyDataSettings (these values are incompatible). -or- Throws if there are no valid spatial bounding elements, or no valid spatial elements in the document. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Failed to create the energy analysis detail model. |
| Autodesk.Revit.Exceptions OperationCanceledException | Throws if user aborted the energy analysis detail model creation. |

# See Also

EnergyAnalysisDetailModel Class

Autodesk.Revit.DB.Analysis Namespace

#### Hours Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Hours.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Hours { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Hours As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Hours { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### SpotSlopeSlopeDirection Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Slope Direction"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpotSlopeSlopeDirection { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpotSlopeSlopeDirection As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpotSlopeSlopeDirection { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### InsulationThickness Property

---

|  |
| --- |
| FabricationPart Class   See Also |

The insulation thickness of the fabrication part. If the fabrication part is not insulated, returns zero.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public double InsulationThickness { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property InsulationThickness As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double InsulationThickness { 	double get (); } ``` |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### Item Property

---

|  |
| --- |
| CurveByPointsArray Class   See Also |

Gets or sets a curve at a specified index within the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual CurveByPoints this[ 	int index ] { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Property Item ( _ 	index As Integer _ ) As CurveByPoints 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property CurveByPoints^ Item[int index] { 	CurveByPoints^ get (int index); 	void set (int index, CurveByPoints^ value); } ``` |

#### Parameters

index
:   Type:  System Int32
     The index of the curve to be set or retrieved.

#### Return Value

Returns the curve at the specified index.

# See Also

CurveByPointsArray Class

Autodesk.Revit.DB Namespace

#### BasepointEastwestParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"E/W"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BasepointEastwestParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BasepointEastwestParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BasepointEastwestParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SetVisibility Method

---

|  |
| --- |
| ImportInstance Class   See Also |

Sets the visibility for the import instance in a family document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetVisibility( 	FamilyElementVisibility visibility ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetVisibility ( _ 	visibility As FamilyElementVisibility _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetVisibility( 	FamilyElementVisibility^ visibility ) ``` |

#### Parameters

visibility
:   Type:  Autodesk.Revit.DB FamilyElementVisibility

# Remarks

The visibility of the import instance geometry can be changed for different types of views and detail levels in the family document.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when visibility is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when regeneration failed, or the import instance is in a project document. |

# See Also

ImportInstance Class

Autodesk.Revit.DB Namespace

#### WinderLegTooShortOrRunWidthTooGreatFailure Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

One leg of the winder run is too small or the runwidth is too great.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId WinderLegTooShortOrRunWidthTooGreatFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WinderLegTooShortOrRunWidthTooGreatFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ WinderLegTooShortOrRunWidthTooGreatFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### ViewGraphSchedTextAppearance Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Text Appearance"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewGraphSchedTextAppearance { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewGraphSchedTextAppearance As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewGraphSchedTextAppearance { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetWorksetIterator Method

---

|  |
| --- |
| FilteredWorksetCollector Class   See Also |

Returns a FilteredWorksetIterator to the worksets passing the current filter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public FilteredWorksetIterator GetWorksetIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetWorksetIterator As FilteredWorksetIterator ``` |

| Visual C++ |
| --- |
| ``` public: FilteredWorksetIterator^ GetWorksetIterator() ``` |

# Remarks

Calling this when you have an active iterator to this same collector will result in the first iterator being stopped by this call.

# See Also

FilteredWorksetCollector Class

Autodesk.Revit.DB Namespace

#### CustMullionWidth2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Width on side 2"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CustMullionWidth2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CustMullionWidth2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CustMullionWidth2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PascalSeconds Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Pascal seconds.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PascalSeconds { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PascalSeconds As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PascalSeconds { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### GetPartStatusDescription Method

---

|  |
| --- |
| FabricationConfiguration Class   See Also |

Gets the status description from its identifier.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public string GetPartStatusDescription( 	int statusId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPartStatusDescription ( _ 	statusId As Integer _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetPartStatusDescription( 	int statusId ) ``` |

#### Parameters

statusId
:   Type:  System Int32
     The status identifier.

#### Return Value

The status description.

# See Also

FabricationConfiguration Class

Autodesk.Revit.DB Namespace

#### RbsCabletrayBendradius Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bend Radius"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsCabletrayBendradius { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsCabletrayBendradius As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsCabletrayBendradius { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetLossFactor Method

---

|  |
| --- |
| LightType Class   See Also |

Return a copy of an object derived from LossFactor

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public LossFactor GetLossFactor() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLossFactor As LossFactor ``` |

| Visual C++ |
| --- |
| ``` public: LossFactor^ GetLossFactor() ``` |

# See Also

LightType Class

Autodesk.Revit.DB.Lighting Namespace

#### GetSurfaces Method

---

|  |
| --- |
| IFCGeometryInfo Class   See Also |

Gets the IfcSurface handles created representing the processed geometry and stored in this object.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ICollection<IFCAnyHandle> GetSurfaces() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSurfaces As ICollection(Of IFCAnyHandle) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<IFCAnyHandle^>^ GetSurfaces() ``` |

#### Return Value

The collection of surface handles.

# See Also

IFCGeometryInfo Class

Autodesk.Revit.DB.IFC Namespace

#### IsReporting Property

---

|  |
| --- |
| FamilyParameter Class   See Also |

Indicates if the parameter is a reporting parameter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool IsReporting { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsReporting As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsReporting { 	bool get (); } ``` |

# Remarks

If true, the parameter is a reporting parameter associated to a dimension value, and cannot be modified. If false, the parameter is a driving parameter and if associated to a dimension, can modify the dimension it labels.

# See Also

FamilyParameter Class

Autodesk.Revit.DB Namespace

#### UnableToMaintainExclusionsWarn Property

---

|  |
| --- |
| BuiltInFailures GroupFailures Class   See Also |

Unable to maintain exclusion of some group members. Some excluded members have been restored.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId UnableToMaintainExclusionsWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property UnableToMaintainExclusionsWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ UnableToMaintainExclusionsWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GroupFailures Class

Autodesk.Revit.DB Namespace

#### GetDefaultParameterNameForKeySchedule Method

---

|  |
| --- |
| ViewSchedule Class   See Also |

Gets the default parameter name that will be used when creating a key schedule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static string GetDefaultParameterNameForKeySchedule( 	Document document, 	ElementId categoryId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetDefaultParameterNameForKeySchedule ( _ 	document As Document, _ 	categoryId As ElementId _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: static String^ GetDefaultParameterNameForKeySchedule( 	Document^ document,  	ElementId^ categoryId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document to which the new schedule will be added.

categoryId
:   Type:  Autodesk.Revit.DB ElementId
     The ID of the category of elements that the schedule's keys will be associated with.

#### Return Value

The default parameter name.

# Remarks

See ViewSchedule.KeyScheduleParameterName for details.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | document is not a project document. -or- categoryId is not a valid category for a key schedule. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ViewSchedule Class

Autodesk.Revit.DB Namespace

#### PathReinEndHookOrient2Wall Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Alternating Bar - End Hook Orientation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PathReinEndHookOrient2Wall { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PathReinEndHookOrient2Wall As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PathReinEndHookOrient2Wall { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FormatOptions Class

---

|  |
| --- |
| Members   See Also |

Options for formatting numbers with units.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class FormatOptions : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class FormatOptions _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class FormatOptions : IDisposable ``` |

# Remarks

The FormatOptions class contains settings that control how to format numbers with units as strings. It contains those settings that are typically chosen by an end user in the Format dialog and stored in the document.

The FormatOptions class is used in two different ways. A FormatOptions object in the  Units  class represents the default settings for the document. A FormatOptions object used elsewhere represents settings that may optionally override the default settings.

The  UseDefault  property controls whether a FormatOptions object represents default or custom formatting. If UseDefault is true, formatting will be according to the default settings in the Units class, and none of the other settings in the object are meaningful. If UseDefault is false, the object contains custom settings that override the default settings in the Units class. UseDefault is always false for FormatOptions objects in the Units class.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB FormatOptions

# See Also

FormatOptions Members

Autodesk.Revit.DB Namespace

#### Rebar Class

---

|  |
| --- |
| Members   Example   See Also |

Represents a rebar element in Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2009

# Syntax

| C# |
| --- |
| ``` public class Rebar : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class Rebar _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class Rebar : public Element ``` |

# Examples

 Copy  C#

```
private void Getinfo_Rebar(Rebar rebar)
{
    string message = "Rebar: ";
    //get the bar type of the rebar
    message += "\nBar Type: " + (rebar.Document.GetElement(rebar.GetTypeId()) as RebarBarType).Name;

    //get the curve information
    IList<Curve> curves = rebar.GetCenterlineCurves(false, false, false, MultiplanarOption.IncludeOnlyPlanarCurves, 0);
    message += "\n\nThe Curves property has " + curves.Count + " curves:";
    foreach (Curve curve in curves)
    {
        // Get curve start point
        message += "\nCurve start point:(" + curve.GetEndPoint(0).X + ", "
            + curve.GetEndPoint(0).Y + ", " + curve.GetEndPoint(0).Z + ")";
        // Get curve end point
        message += "; Curve end point:(" + curve.GetEndPoint(1).X + ", "
            + curve.GetEndPoint(1).Y + ", " + curve.GetEndPoint(1).Z + ")";
    }

    //get the host element of the rebar
    if (null != rebar.Document.GetElement(rebar.GetHostId())) //maybe some rebars don't have host
    {
        message += "\n\nThe host element ID : " + rebar.GetHostId().ToString();
    }

    TaskDialog.Show("Revit", message);
}
```

 Copy  VB.NET

```
Private Sub Getinfo_Rebar(rebar As Rebar)
    Dim message As String = "Rebar: "
    'get the bar type of the rebar
    message += vbLf & "Bar Type: " + TryCast(rebar.Document.GetElement(rebar.GetTypeId()), RebarBarType).Name

 'get the curve information
 Dim curves As IList(Of Curve) = rebar.GetCenterlineCurves(False, False, False, MultiplanarOption.IncludeOnlyPlanarCurves, 0)
 message += vbLf & vbLf & "The Curves property has " & curves.Count & " curves:"
    For Each curve As Curve In curves
        ' Get curve start point
        message += ((vbLf & "Curve start point:(" + curve.GetEndPoint(0).X & ", ") + curve.GetEndPoint(0).Y & ", ") + curve.GetEndPoint(0).Z & ")"
        ' Get curve end point
        message += (("; Curve end point:(" + curve.GetEndPoint(1).X & ", ") + curve.GetEndPoint(1).Y & ", ") + curve.GetEndPoint(1).Z & ")"
    Next

    'get the host element of the rebar
    If rebar.Document.GetElement(rebar.GetHostId()) IsNot Nothing Then
        'maybe some rebars don't have host
        message += vbLf & vbLf & "The host element ID : " + rebar.GetHostId().ToString()
    End If

    TaskDialog.Show("Revit", message)
End Sub
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB.Structure Rebar

# See Also

Rebar Members

Autodesk.Revit.DB.Structure Namespace

#### FlowState Property

---

|  |
| --- |
| PipePressureDropData Class   See Also |

The flowState of the pipe.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public PipeFlowState FlowState { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FlowState As PipeFlowState 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property PipeFlowState FlowState { 	PipeFlowState get (); 	void set (PipeFlowState value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

PipePressureDropData Class

Autodesk.Revit.DB.Plumbing Namespace

#### IsGrossBuildingArea Property

---

|  |
| --- |
| AreaScheme Class   See Also |

Indicates if the area scheme is a Gross Building Area scheme.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsGrossBuildingArea { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsGrossBuildingArea As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsGrossBuildingArea { 	bool get (); } ``` |

# See Also

AreaScheme Class

Autodesk.Revit.DB Namespace

#### RemoveAddInCommandBinding Method

---

|  |
| --- |
| UIApplication Class   See Also |

Removes an AddInCommandBinding.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void RemoveAddInCommandBinding( 	RevitCommandId revitCommandId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub RemoveAddInCommandBinding ( _ 	revitCommandId As RevitCommandId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void RemoveAddInCommandBinding( 	RevitCommandId^ revitCommandId ) ``` |

#### Parameters

revitCommandId
:   Type:  Autodesk.Revit.UI RevitCommandId
     The Revit command id to identify the command handler you want to remove the binding.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when uiApplication or revitCommandId is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the given command is not bound with this add-in. |

# See Also

UIApplication Class

Autodesk.Revit.UI Namespace

#### AnalyticalModelWallTopProjection Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top y Projection"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AnalyticalModelWallTopProjection { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticalModelWallTopProjection As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AnalyticalModelWallTopProjection { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ReverseIterator Method

---

|  |
| --- |
| FaceArray Class   See Also |

Retrieve a backward moving iterator to the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual FaceArrayIterator ReverseIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ReverseIterator As FaceArrayIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual FaceArrayIterator^ ReverseIterator() ``` |

#### Return Value

Returns a backward moving iterator to the array.

# See Also

FaceArray Class

Autodesk.Revit.DB Namespace

#### GetSheetLocation Method

---

|  |
| --- |
| FabricSheet Class   See Also |

Gets the position and the orientation of the Fabric Sheet instance.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public Transform GetSheetLocation() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSheetLocation As Transform ``` |

| Visual C++ |
| --- |
| ``` public: Transform^ GetSheetLocation() ``` |

#### Return Value

The location of the Fabric Sheet instance.

# See Also

FabricSheet Class

Autodesk.Revit.DB.Structure Namespace

#### RebarSystemSpacingTopDirn1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top Major Spacing"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemSpacingTopDirn1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemSpacingTopDirn1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemSpacingTopDirn1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### InstOutsideFaceBoundary Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

Instance origin does not lie on host face. Instance will lose association to host.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InstOutsideFaceBoundary { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InstOutsideFaceBoundary As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InstOutsideFaceBoundary { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace

#### ConfusingPadByElementsInAnotherDesignOption Property

---

|  |
| --- |
| BuiltInFailures DesignOptionFailures Class   See Also |

A pad in a Design Option cannot be hosted by a topography in another Design Option [--if you continue it will not be added to the design option set].

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ConfusingPadByElementsInAnotherDesignOption { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ConfusingPadByElementsInAnotherDesignOption As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ConfusingPadByElementsInAnotherDesignOption { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DesignOptionFailures Class

Autodesk.Revit.DB Namespace

#### RoomDesignLightingLoadParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Specified Lighting Load"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoomDesignLightingLoadParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomDesignLightingLoadParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoomDesignLightingLoadParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetDockablePane Method

---

|  |
| --- |
| UIControlledApplication Class   See Also |

Gets a DockablePane object by its ID.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public DockablePane GetDockablePane( 	DockablePaneId id ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetDockablePane ( _ 	id As DockablePaneId _ ) As DockablePane ``` |

| Visual C++ |
| --- |
| ``` public: DockablePane^ GetDockablePane( 	DockablePaneId^ id ) ``` |

#### Parameters

id
:   Type:  Autodesk.Revit.UI DockablePaneId
     Unique identifier for the new pane.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if no dockable pane has been registered with identifier %id%. |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if the dockable pane with identifier %id% has not been created yet. |

# See Also

UIControlledApplication Class

Autodesk.Revit.UI Namespace

#### GetFillGrid Method

---

|  |
| --- |
| FillPattern Class   See Also |

Gets the specified fill grid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FillGrid GetFillGrid( 	int gridIdx ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFillGrid ( _ 	gridIdx As Integer _ ) As FillGrid ``` |

| Visual C++ |
| --- |
| ``` public: FillGrid^ GetFillGrid( 	int gridIdx ) ``` |

#### Parameters

gridIdx
:   Type:  System Int32
     The index of the fill grid.

#### Return Value

The fill grid.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The index of the FillGrid is not valid. |

# See Also

FillPattern Class

Autodesk.Revit.DB Namespace

#### ElementIdParameterValue Constructor (ElementId)

---

|  |
| --- |
| ElementIdParameterValue Class   See Also |

Value constructor

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public ElementIdParameterValue( 	ElementId value ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	value As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ElementIdParameterValue( 	ElementId^ value ) ``` |

#### Parameters

value
:   Type:  Autodesk.Revit.DB ElementId

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ElementIdParameterValue Class

ElementIdParameterValue Overload

Autodesk.Revit.DB Namespace

#### Noise Class

---

|  |
| --- |
| Members   See Also |

A static class that provides access to the property names that appear in the Noise visual asset schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static class Noise ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class Noise ``` |

| Visual C++ |
| --- |
| ``` public ref class Noise abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Visual Noise

# See Also

Noise Members

Autodesk.Revit.DB.Visual Namespace

#### BoltSpacing Property

---

|  |
| --- |
| StructuralSectionCSlopedFlange Class   See Also |

Standard bolt spacing, in. (mm)

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public double BoltSpacing { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BoltSpacing As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double BoltSpacing { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionCSlopedFlange Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### Executed Event

---

|  |
| --- |
| AddInCommandBinding Class   See Also |

Occurs when the command associated with this AddInCommandBinding executes.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public event EventHandler<ExecutedEventArgs> Executed ``` |

| Visual Basic |
| --- |
| ``` Public Event Executed As EventHandler(Of ExecutedEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<ExecutedEventArgs^>^ Executed { 	void add (EventHandler<ExecutedEventArgs^>^ value); 	void remove (EventHandler<ExecutedEventArgs^>^ value); } ``` |

# See Also

AddInCommandBinding Class

Autodesk.Revit.UI Namespace

#### IsValidObject Property

---

|  |
| --- |
| NonContinuousRailStructure Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

NonContinuousRailStructure Class

Autodesk.Revit.DB.Architecture Namespace

#### IsAHanger Method

---

|  |
| --- |
| FabricationPart Class   See Also |

Checks whether it is a hanger.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool IsAHanger() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsAHanger As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsAHanger() ``` |

#### Return Value

True if the part is a hanger. False otherwise.

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### GroupedModelElemHasViewSpecificSubordinates Property

---

|  |
| --- |
| BuiltInFailures GroupFailures Class   See Also |

Unable to group the selected elements. Model element in group has view specific subordinates or view specific element in group has non-view specific subordinates.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId GroupedModelElemHasViewSpecificSubordinates { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GroupedModelElemHasViewSpecificSubordinates As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ GroupedModelElemHasViewSpecificSubordinates { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GroupFailures Class

Autodesk.Revit.DB Namespace

#### AnalysisDisplayColorEntry Class

---

|  |
| --- |
| Members   See Also |

Contains one entry of intermediate colors in color settings for analysis display style.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class AnalysisDisplayColorEntry : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class AnalysisDisplayColorEntry _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class AnalysisDisplayColorEntry : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Analysis AnalysisDisplayColorEntry

# See Also

AnalysisDisplayColorEntry Members

Autodesk.Revit.DB.Analysis Namespace

#### RuleValue Property

---

|  |
| --- |
| FilterIntegerRule Class   See Also |

The user-supplied value against which values from a Revit document will be tested.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public int RuleValue { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property RuleValue As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int RuleValue { 	int get (); 	void set (int value); } ``` |

# See Also

FilterIntegerRule Class

Autodesk.Revit.DB Namespace

#### RebarConstraintTargetHostFaceType Enumeration

---

|  |
| --- |
| See Also |

A type to help identify the individual face on a host element to which a Rebar handle is constrained.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum RebarConstraintTargetHostFaceType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RebarConstraintTargetHostFaceType ``` |

| Visual C++ |
| --- |
| ``` public enum class RebarConstraintTargetHostFaceType ``` |

# Members

| Member name | Description |
| --- | --- |
| FaceWithTagId | Face identified by integer tag. |
| Top | Face forms the top surface of the host geometry. |
| Bottom | Face forms the bottom surface of the host geometry. |
| End0 | Face forms the starting end surface of the host geometry. |
| End1 | Face forms the end surface of the host geometry. |
| Side0 | Face forms the exterior surface of the host geometry. |
| Side1 | Face forms the interior surface of the host geometry. |

# Remarks

For some types of host, it is possible to describe the face in terms of recognizable topology (i.e. Top, Bottom, etc.). However, for most elements, the face can only be identified by integer tag. In all cases, a Pick to the host face can be obtained by calling RebarConstraint.GetTargetHostFaceReference().

# See Also

Autodesk.Revit.DB.Structure Namespace

#### HostElementId Property

---

|  |
| --- |
| LinkElementId Class   See Also |

The id of the element in the host, or invalidElementId if there is a link.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ElementId HostElementId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HostElementId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ HostElementId { 	ElementId^ get (); } ``` |

# See Also

LinkElementId Class

Autodesk.Revit.DB Namespace

#### RightSideSupportType Property

---

|  |
| --- |
| StairsType Class   See Also |

The type of right support used in the stair.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId RightSideSupportType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property RightSideSupportType As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ RightSideSupportType { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: rightSideStringerTypeId is not a valid support type. -or- When setting this property: The specified rightSideStringerTypeId doesn't match the desired style of the right side support. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The right support style is none, so this related data cannot be set. |

# See Also

StairsType Class

Autodesk.Revit.DB.Architecture Namespace

#### ApplicableSegmentLengthRounding Property

---

|  |
| --- |
| RebarRoundingManager Class   See Also |

The applicable rounding for shared parameters used by rebar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double ApplicableSegmentLengthRounding { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ApplicableSegmentLengthRounding As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double ApplicableSegmentLengthRounding { 	double get (); } ``` |

# Remarks

IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true. ApplicableSegmentLengthRounding is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.

# See Also

RebarRoundingManager Class

Autodesk.Revit.DB.Structure Namespace

#### HasValue Property

---

|  |
| --- |
| IFCData Class   See Also |

Identifies if the data is empty or contains a value.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool HasValue { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HasValue As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool HasValue { 	bool get (); } ``` |

# See Also

IFCData Class

Autodesk.Revit.DB.IFC Namespace

#### ViewDisplayBackgroundImageFlags Enumeration

---

|  |
| --- |
| See Also |

A collection of bit flags that control how the background image is positioned in relation to the crop region (or the view boundary).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum ViewDisplayBackgroundImageFlags ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ViewDisplayBackgroundImageFlags ``` |

| Visual C++ |
| --- |
| ``` public enum class ViewDisplayBackgroundImageFlags ``` |

# Members

| Member name | Description |
| --- | --- |
| None | The image is displayed pixel-to-pixel |
| FitToScreen | The image is stretched in both directions |
| FixedAspectRatio | The image is stretched but the ratio of its height to width is preserved. |
| UseTiling | The pixels of the background are filled by tiling of the image. |

# See Also

Autodesk.Revit.DB Namespace

#### ShowActiveWorkPlane Method

---

|  |
| --- |
| View Class   See Also |

Show the active work plane of the view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public void ShowActiveWorkPlane() ``` |

| Visual Basic |
| --- |
| ``` Public Sub ShowActiveWorkPlane ``` |

| Visual C++ |
| --- |
| ``` public: void ShowActiveWorkPlane() ``` |

# Remarks

If this method is invoked while the current work plane is hidden, only the outline of the updated work plane will be shown immediately. The updated sketch plane will be shown fully after the current transaction is committed. Therefore it is recommended the Add-On commits the transaction before performing UI operations (for example, PickPoint).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when there is no active sketch plane, or when an error occurs during setting the sketch plane visibility. |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### WidthMeasuredAt Enumeration

---

|  |
| --- |
| See Also |

The allowed values for the WALL\_TYPE\_WIDTH\_MEASURED\_AT parameter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public enum WidthMeasuredAt ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WidthMeasuredAt ``` |

| Visual C++ |
| --- |
| ``` public enum class WidthMeasuredAt ``` |

# Members

| Member name | Description |
| --- | --- |
| Top | The top of the wall taking into account the top offset before any attachment. |
| Base | The base constraint of the wall. |
| Bottom | The bottom of the wall taking into the base offset before any attachment. |

# See Also

Autodesk.Revit.DB Namespace

#### IsUGridLine Property

---

|  |
| --- |
| CurtainGridLine Class   See Also |

Retrieve the direction of a grid line.If it is true,we say it is a UGridLine,otherwise it is VGridLine

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsUGridLine { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsUGridLine As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsUGridLine { 	bool get (); } ``` |

# See Also

CurtainGridLine Class

Autodesk.Revit.DB Namespace

#### BarDiameter Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Bar Diameter, in discipline Structural.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BarDiameter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BarDiameter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BarDiameter { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### ServerSupportsIFCLinks Method

---

|  |
| --- |
| ExternalResourceServerUtils Class   See Also |

Checks that the server referenced by the given ExternalResourceReference supports IFC links.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static bool ServerSupportsIFCLinks( 	ExternalResourceReference extRef ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ServerSupportsIFCLinks ( _ 	extRef As ExternalResourceReference _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool ServerSupportsIFCLinks( 	ExternalResourceReference^ extRef ) ``` |

#### Parameters

extRef
:   Type:  Autodesk.Revit.DB ExternalResourceReference
     The ExternalResourceReference to check.

#### Return Value

True if the ExternalResourceReference refers to a server that supports IFC links. False otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExternalResourceServerUtils Class

Autodesk.Revit.DB Namespace

#### ProjectGridsOnSectionBox Property

---

|  |
| --- |
| View3D Class   See Also |

This option projects all grids from the current 3d view on the bottom face of the section box. Only grids that are inside or intersects the section box

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public bool ProjectGridsOnSectionBox { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ProjectGridsOnSectionBox As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ProjectGridsOnSectionBox { 	bool get (); 	void set (bool value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Returns true if the view is not a view template. |

# See Also

View3D Class

Autodesk.Revit.DB Namespace

#### LightSourceInsideGeometry Property

---

|  |
| --- |
| BuiltInFailures RenderFailures Class   See Also |

Light source is inside solid geometry. No light will be emitted during rendering.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId LightSourceInsideGeometry { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LightSourceInsideGeometry As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ LightSourceInsideGeometry { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RenderFailures Class

Autodesk.Revit.DB Namespace